{"text": "\n\nYip Man Hing Kevin v Gleneagles Hospital\n[2014] SGHC 15\n\nCase Number\n:\nOriginating Summons No 877 of 2013 (Summons No 5324 of 2013)\nDecision Date\n:\n24 January 2014\nTribunal/Court\n:\nHigh Court\nCoram\n:\nChoo Han Teck J\nCounsel Name(s)\n:\nEdwin Tong, Kenneth Lim and Christine Tee (Allen & Gledhill LLP) for the applicant; Lok Vi Ming SC, Audrey Chiang and Calvin Lim (Rodyk & Davidson LLP) for the respondent; Khoo Boo Jin for the Attorney-General's Chambers.\nParties\n:\nYip Man Hing Kevin -- Gleneagles Hospital\n24 January 2014\nChoo Han Teck J:\n\n1 This Originating Summons was an application for leave under O 53 of the Rules of Court (Cap 322, R 5, 2006 Rev Ed). The applicant was Dr Kevin Yip Man Hing (\"Dr Yip\"). He is an orthopaedic surgeon who has been in private practice for about 15 years at Gleneagles Medical Centre. Dr Yip was accorded accreditation and privileges to practice at Gleneagles Medical Centre by Gleneagles Hospital (\"GEH\"), the respondent in this case. GEH is a private hospital, licensed under the Private Hospitals and Medical Clinics Act (Cap 248, 1999 Rev Ed) (\"PHMC\").\n2 Two of Dr Yip's patients were important to the case. The first was Shanmugan Baskaran (\"Shanmugan\"), who was admitted, after having been hit by an excavator, on 13 March 2012. He was primarily treated by the on-call general surgeon. Dr Yip only treated him in relation to his fractured collarbone. Shanmugan died on 18 March 2012, from septicaemia, as a result of thoraco-adominal injuries. The second was Murugesan Dharmaraj (\"Murugesan\"), who was admitted, after having fallen from a one-storey height, on 15 June 2012. Dr Yip assessed his condition and referred him to an intensivist. Murugesan's condition stabilised on 19 June 2012, and he was then transferred to the National University Hospital. In between the admission of the two patients, on 9 April 2012, GEH issued a letter to all doctors practising at GEH, stating that, \"[t]he committee recommended referring your patient to the restructured hospitals for initial assessment and acute management after you have triaged your patient via phone that massive transfusions are required.\" GEH classified the contents of the letter as a directive, whereas Dr Yip questioned the mandatory nature of the contents, arguing they constituted a mere recommendation. While the contents of this letter have been relied on by both parties in their submissions on whether an arguable case has been made out, I found there was no need to make a determination on this matter. I have stated the contents of the letter only to shed light on the events that precipitated this matter before me.\n3 On 18 December 2012, Dr Yip was informed that his professional performance and conduct of two incidents were being reviewed by the Professional Performance Review Committee (\"PPRC\"). The two incidents cited concerned the cases of Shanmugan and Murugesan, although neither patient's name was cited. Ostensibly, the incidents involved Dr Yip's treatment of the patients regarding the contents of the letter issued by GEH on 9 April 2012. The PPRC requested a written report from Dr Yip, in which he was to answer questions relating to the two incidents. Such questions revolved around the facts and circumstances of Dr Yip's contact with each patient, for instance, how he came into contact with the patient and why Dr Yip chose a certain course in dealing with the patient. Dr Yip submitted his report on 6 January 2013.\n4 On 9 January 2013, Dr Yip appealed to the chairman of the Medical Advisory Board, the board which establishes the PPRC, to replace Dr James Lee (\"Dr Lee\"), who was appointed as one of the 9 members of the PPRC. Dr Yip based his appeal on the grounds that Dr Lee had previously made inappropriate comments to two of Dr Yip's patients about Dr Yip's management of these patients. On 14 January 2013, the chairman disallowed Dr Yip's appeal for Dr Lee to be replaced. No reasons were given.\n5 On 2 March 2013, the PPRC invited Dr Yip for an oral interview to respond to questions relating to the two incidents. The interview was scheduled for 14 March 2013 at 5.30pm. On 12 March 2013, the PPRC provided Dr Yip with written statements of 3 witnesses called to give evidence before the PPRC. On 14 March 2013, Dr Yip attended the interview, at which only six out of the nine members of the PPRC were present. At the interview, Dr Yip formed the view that the PPRC members were not familiar with the material facts and circumstances of the two incidents. As such, he submitted a further report to the PPRC on 30 April 2013. However, by then, the PPRC had already submitted its report to the chairman of the Medical Advisory Board on 27 March 2013. The Medical Advisory Board reviewed the PPRC's findings and conclusions on 22 April 2013, and also later reviewed Dr Yip's letter dated 30 April 2013. The Medical Advisory Board, in turn, submitted its recommendations to the Chief Executive Officer (\"CEO\") of GEH. Dr Yip was not given a copy of either the formal report or the recommendations.\n6 On 19 August 2013, the CEO of GEH wrote to Dr Yip stating that:\n(a) GEH concurred with the Medical Advisory Board's conclusion that there was a \"serious lapse\" on Dr Yip's part in meeting acceptable standards of professional performance or behaviour; and\n(b) GEH concurred with the Medical Advisory Board's recommendation that Dr Yip face a 3-month suspension of his accreditation and privileges to practice in GEH. The suspension was to commence on 16 September 2013.\nOn 22 August 2013, Dr Yip's lawyers, Allen & Gledhill LLP (\"A&G\"), wrote to GEH to state that Dr Yip wished to appeal against GEH's decision as well as meet with the CEO and the executive vice-president of Parkway Health Group to discuss the appeal. On 27 August 2013, the CEO of GEH wrote to A&G to say that, notwithstanding the lack of a formal avenue for appeal, GEH was willing to consider granting Dr Yip's request for a meeting. On 2 September 2013, A&G wrote to GEH to:\n(a) state the intended agenda for the proposed meeting;\n(b) propose that the meeting be scheduled either at 10am on 26 September 2013 or 10am on 27 September 2013; and\n(c) request that the Dr Yip's suspension be stayed pending the resolution of the outcome of the meeting.\nOn 3 September 2013, A&G received a telephone call from Rodyk & Davidson LLP (\"R&D\"), counsel for GEH. R&D enquired as to whether Dr Yip would agree to meet GEH's representatives without lawyers present at the proposed meeting. On 4 September 2013, A&G informed R&D that Dr Yip would meet GEH's representatives without lawyers present, but if the matter was not resolved after that, A&G, Dr Yip, and GEH should meet regarding the appeal. The meeting without the parties' lawyers was fixed for 10 September 2013.\n7 On 10 September 2013, Dr Yip met GEH's representatives. At the meeting, GEH's representatives did not confirm if they would meet Dr Yip and A&G on 26 or 27 September 2013, or if the suspension would be stayed. Instead, GEH's representatives told Dr Yip to have his lawyers contact R&D.\n8 On 11 September 2013, A&G wrote to R&D, repeating Dr Yip's request for a meeting and for the suspension to be stayed, and asked for a reply by 12 September 2013, but no confirmation was received by that date. On 13 September 2013, A&G wrote to R&D saying that Dr Yip had no choice but to take steps to apply for a review of the decision of GEH. On the same day, R&D replied, stating that although GEH would postpone the commencement of the suspension from 16 September 2013 to 23 September 2013, it would not meet with Dr Yip. Dr Yip subsequently commenced these proceedings on 18 September 2013, applying for:\n(a) Leave to be granted to apply for:\n(i) A quashing order against the decision of the PPRC of GEH that, inter alia, there was a failure or omission on his part to comply with the acceptable standards of professional performance or behaviour;\n(ii) A quashing order against the decision of the Medical Advisory Board of GEH that, inter alia, there was a serious lapse on his part in meeting acceptable standards of professional performance or behaviour;\n(iii) A quashing order against the decision of the CEO of GEH that there was a serious lapse on his part in meeting acceptable standards of professional performance or behaviour;\n(iv) A quashing order against the 3-month suspension which commenced on 23 September 2013;\n(b) A stay on the suspension pending determination of these proceedings; and\n(c) GEH to be restrained from disclosing or publishing the existence and the contents of the decisions of the CEO, the Medical Advisory Board and the PPRC, as well as the suspension, pending determination of these proceedings.\n9 On 20 September 2013, Dr Yip applied for an injunction such that GEH be enjoined from enforcing the suspension order against Dr Yip. I granted this injunction. Upon hearing the parties in chambers on 13 January 2014, I declined to grant leave to the applicant. For leave to be granted, the matter must be susceptible to judicial review: see the recent High Court decision of Marplan Pte Ltd v Attorney-General [2013] 3 SLR 201 at [10], citing with approval the test for leave to apply for a quashing order as laid out in Lim Mey Lee Susan v Singapore Medical Council [2011] SGHC 131 at [3]. While I note the submissions by counsel for Dr Yip relating to the conduct of the disciplinary proceedings and decisions and recommendations by the various parties involved (which dealt with the matter of whether there was an arguable case, a further element for leave to be granted) I do not have to deal with them as the nub of this case lay elsewhere. The sole issue in this case turned on one element -- whether the decision of the GEH was subject to judicial review. Factually, it turned on one document -- the contract between GEH and Dr Yip. That contract conferred on Dr Yip privileges to practice at Gleneagles Medical Centre. It was under the terms of this contract that GEH suspended Dr Yip. As such, this matter was entirely contractual and not subject to judicial review. Dr Yip's remedies, if any, must be sought in contract.\n10 In administrative law, the determination as to whether a decision is subject to judicial review has to be examined in regard to the source, as well as the nature, of the power behind the decision. If the source of power of a body is derived from statute or subsidiary legislation, the body may be susceptible to judicial review. Even if the source of power is non-statutory, the body may be susceptible to judicial review if the body performs public functions: see Yeap Wai Kong v Singapore Exchange Securities Trading Ltd [2012] 3 SLR 565 (\"Yeap Wai Kong\") at [15], citing Clive Lewis, Judicial Remedies in Public Law (Sweet & Maxwell, 4th Ed, 2009) at para 2-003.\n11 Contrary to the arguments by A&G, the source of GEH's power to suspend Dr Yip was not the PHMC or the relevant subsidiary regulations. As Mr Khoo from the Attorney-General's Chambers had pointed out, A&G seemed to conflate statutory obligations, which GEH bears under the PHMC and the relevant subsidiary regulations, with statutory powers to discipline doctors such as Dr Yip, which neither the PHMC, nor the relevant subsidiary regulations, confer. Rather, the source of GEH's power to suspend Dr Yip is the \"Medical Advisory Board Professional Performance Review Committee Role & Responsibility\", which is a set of rules that governs how GEH disciplines doctors. This set of rules gains legitimacy solely from the contract between Dr Yip and GEH.\n12 The decision made did not concern a public function. In Yeap Wai Kong, Philip Pillai J found (at [28]) that the requirement of a public function in that case was satisfied in the light of, the \"statutory underpinning of the reprimand power and the nature of the reprimand function\", meaning that the tribunal concerned was exercising a judicial, or quasi-judicial, function. That case involved the public reprimand of a director of a listed company by Singapore Exchange Securities Trading Ltd. The power to publicly reprimand a director was, as pointed out by Philip Pillai J (at [24]), conferred by Rule 720(4) of Singapore Exchange Securities Trading Limited's Listing Manual, which in turn had been properly enacted and approved by the Monetary Authority of Singapore in accordance with s 23 of the Securities and Futures Act (Cap 289, 2006 Rev Ed). This case is different. There were no such statutory regulations concerning the suspension power exercised by GEH. The decision to suspend Dr Yip, as well as the disciplinary proceedings that culminated in that decision, were functions that were carried out pursuant to the contract between Dr Yip and GEH.\n13 At the heart of this application is the decision to suspend Dr Yip. This decision, like the disciplinary proceedings around it, was not of a judicial or quasi-judicial nature. Neither was the source of the power to make that decision from a statute or subsidiary legislation. Therefore, this application cannot be held to involve a matter that can be said to be subject to judicial review. The application for leave (at [8(a)]) as well as the applications contingent on the determination of these proceedings (at [8(b)] and [8(c)]) failed. I therefore dismissed Dr Yip's application for leave and discharged the injunction granted on 20 September 2013. I ordered Dr Yip to pay costs to the respondent and the Attorney-General, to be agreed or taxed, with liberty to apply for a further hearing to fix costs if necessary.\nCopyright (c) Government of Singapore.\n", "label": [[2, 57, "PRECEDENT"], [202, 215, "JUDGE"], [236, 246, "LAWYER"], [248, 259, "LAWYER"], [264, 277, "LAWYER"], [320, 331, "LAWYER"], [336, 349, "LAWYER"], [354, 364, "LAWYER"], [408, 420, "LAWYER"], [468, 486, "RESPONDENT"], [526, 539, "JUDGE"], [683, 701, "OTHER_PERSON"], [798, 823, "ORG"], [828, 831, "OTHER_PERSON"], [889, 914, "ORG"], [918, 937, "ORG"], [976, 979, "ORG"], [1022, 1094, "STATUTE"], [1109, 1112, "OTHER_PERSON"], [1166, 1184, "OTHER_PERSON"], [1335, 1338, "OTHER_PERSON"], [1397, 1406, "OTHER_PERSON"], [1415, 1428, "DATE"], [1505, 1524, "OTHER_PERSON"], [1624, 1627, "OTHER_PERSON"], [1687, 1696, "OTHER_PERSON"], [1772, 1800, "ORG"], [1851, 1863, "DATE"], [1865, 1868, "ORG"], [1914, 1917, "ORG"], [2146, 2149, "ORG"], [2215, 2218, "OTHER_PERSON"], [2640, 2656, "DATE"], [2661, 2664, "OTHER_PERSON"], [2867, 2876, "OTHER_PERSON"], [2881, 2890, "OTHER_PERSON"], [2973, 2976, "OTHER_PERSON"], [3052, 3055, "ORG"], [3059, 3071, "DATE"], [3077, 3081, "ORG"], [3117, 3120, "OTHER_PERSON"], [3254, 3257, "OTHER_PERSON"], [3354, 3357, "OTHER_PERSON"], [3413, 3416, "OTHER_PERSON"], [3441, 3455, "DATE"], [3462, 3476, "DATE"], [3481, 3484, "OTHER_PERSON"], [3573, 3577, "ORG"], [3593, 3602, "OTHER_PERSON"], [3608, 3611, "OTHER_PERSON"], [3664, 3668, "ORG"], [3673, 3676, "OTHER_PERSON"], [3717, 3720, "OTHER_PERSON"], [3777, 3780, "OTHER_PERSON"], [3801, 3804, "OTHER_PERSON"], [3884, 3887, "OTHER_PERSON"], [3904, 3907, "OTHER_PERSON"], [3952, 3964, "DATE"], [3970, 3974, "ORG"], [3986, 3989, "OTHER_PERSON"], [4127, 4140, "DATE"], [4146, 4150, "ORG"], [4163, 4166, "OTHER_PERSON"], [4241, 4245, "COURT"], [4250, 4263, "DATE"], [4268, 4271, "OTHER_PERSON"], [4345, 4349, "ORG"], [4385, 4388, "OTHER_PERSON"], [4414, 4418, "ORG"], [4555, 4559, "ORG"], [4563, 4576, "DATE"], [4600, 4604, "ORG"], [4687, 4700, "DATE"], [4742, 4746, "ORG"], [4777, 4790, "DATE"], [4819, 4822, "OTHER_PERSON"], [4838, 4851, "DATE"], [4962, 4965, "ORG"], [4970, 4973, "OTHER_PERSON"], [5052, 5066, "DATE"], [5079, 5082, "ORG"], [5095, 5098, "OTHER_PERSON"], [5117, 5120, "ORG"], [5215, 5218, "OTHER_PERSON"], [5308, 5311, "ORG"], [5379, 5382, "OTHER_PERSON"], [5460, 5463, "ORG"], [5499, 5516, "DATE"], [5521, 5535, "DATE"], [5540, 5543, "OTHER_PERSON"], [5555, 5575, "ORG"], [5594, 5597, "ORG"], [5615, 5618, "OTHER_PERSON"], [5644, 5647, "ORG"], [5724, 5744, "ORG"], [5771, 5785, "DATE"], [5798, 5801, "ORG"], [5811, 5814, "ORG"], [5884, 5887, "ORG"], [5924, 5927, "OTHER_PERSON"], [5956, 5972, "DATE"], [5987, 5990, "ORG"], [6111, 6128, "DATE"], [6140, 6157, "DATE"], [6187, 6190, "OTHER_PERSON"], [6271, 6287, "DATE"], [6324, 6344, "ORG"], [6366, 6369, "ORG"], [6401, 6404, "OTHER_PERSON"], [6425, 6428, "ORG"], [6499, 6515, "DATE"], [6542, 6545, "OTHER_PERSON"], [6557, 6560, "ORG"], [6651, 6654, "OTHER_PERSON"], [6659, 6662, "OTHER_PERSON"], [6668, 6671, "ORG"], [6761, 6778, "DATE"], [6785, 6802, "DATE"], [6807, 6810, "OTHER_PERSON"], [6815, 6818, "ORG"], [6854, 6857, "ORG"], [6914, 6917, "OTHER_PERSON"], [6922, 6925, "OTHER_PERSON"], [6929, 6952, "DATE"], [7001, 7004, "ORG"], [7031, 7034, "OTHER_PERSON"], [7073, 7090, "DATE"], [7123, 7126, "OTHER_PERSON"], [7282, 7299, "DATE"], [7333, 7336, "OTHER_PERSON"], [7410, 7413, "ORG"], [7467, 7470, "ORG"], [7526, 7543, "DATE"], [7592, 7595, "OTHER_PERSON"], [7600, 7603, "OTHER_PERSON"], [7648, 7665, "DATE"], [7776, 7779, "ORG"], [7974, 8003, "ORG"], [8192, 8195, "ORG"], [8485, 8488, "ORG"], [8631, 8635, "ORG"], [8713, 8730, "DATE"], [8735, 8738, "OTHER_PERSON"], [8775, 8778, "ORG"], [8838, 8841, "OTHER_PERSON"], [9085, 9144, "PRECEDENT"], [9231, 9299, "PRECEDENT"], [9348, 9351, "OTHER_PERSON"], [9737, 9740, "ORG"], [9834, 9837, "ORG"], [9845, 9848, "OTHER_PERSON"], [9880, 9883, "OTHER_PERSON"], [9910, 9935, "ORG"], [9982, 9985, "ORG"], [9999, 10002, "OTHER_PERSON"], [10089, 10092, "OTHER_PERSON"], [10609, 10700, "PRECEDENT"], [10718, 10729, "OTHER_PERSON"], [10842, 10845, "ORG"], [10861, 10864, "ORG"], [10887, 10890, "OTHER_PERSON"], [10903, 10907, "ORG"], [10954, 10958, "OTHER_PERSON"], [11065, 11068, "ORG"], [11085, 11089, "STATUTE"], [11186, 11189, "OTHER_PERSON"], [11209, 11213, "ORG"], [11286, 11289, "ORG"], [11312, 11315, "OTHER_PERSON"], [11324, 11410, "ORG"], [11454, 11457, "ORG"], [11550, 11553, "OTHER_PERSON"], [11558, 11561, "ORG"], [11622, 11635, "JUDGE"], [11637, 11650, "JUDGE"], [12018, 12060, "ORG"], [12127, 12140, "JUDGE"], [12167, 12178, "PROVISION"], [12182, 12227, "ORG"], [12306, 12337, "ORG"], [12357, 12361, "PROVISION"], [12369, 12418, "STATUTE"], [12530, 12533, "ORG"], [12562, 12565, "OTHER_PERSON"], [12714, 12717, "OTHER_PERSON"], [12722, 12725, "ORG"], [12793, 12796, "OTHER_PERSON"], [13295, 13298, "OTHER_PERSON"], [13364, 13381, "DATE"], [13396, 13399, "OTHER_PERSON"], [13565, 13588, "ORG"]]}
