{"text": "\n\nIN THE GENERAL DIVISION OF THE HIGH COURT OF THE REPUBLIC OF SINGAPORE\n[2021] SGHC 56\n\nOriginating Summons No 1281 of 2020\nBetween\n(1)\nAmeet Nalin Parikh\n... Plaintiff\nAnd\n(1)\nIshan Anoop Sakraney\n... Defendant\nEX TEMPORE JUDGMENT\n\n[Contract] -- [Contractual terms]\n[Civil Procedure] -- [Ancillary disclosure order]\nAmeet Nalin Parikh\nv\nIshan Anoop Sakraney\n[2021] SGHC 56\n\nGeneral Division of the High Court -- Originating Summons No 1281 of 2020\nKwek Mean Luck JC\n2 March 2021\n2 March 2021\nKwek Mean Luck JC:\nIntroduction\n\n1 This Originating Summons (\"OS\") involves the interpretation of Clause 4.2 (\"Clause 4.2\") of a Letter of Engagement dated 14 June 2013 (\"the Letter of Engagement\") read with an Addendum dated 1 April 2017 (\"the Addendum\") (collectively \"the Agreement\"). Clause 4.2 relates to the payment of fees by the defendant to the plaintiff.\n2 Under the Agreement, the defendant engaged the plaintiff to perform services related to the sale of assets held by certain companies in which the defendant was a  1/3  shareholder. Pursuant to Clause 3 of the Letter of Engagement, the plaintiff's term of appointment ended on 30 September 2017. However, Clause 3.2 also states that Clause 4 of the Letter of Engagement would survive for a period of 2 years from the date of expiry of the Letter of Engagement (the \"tail period\"). In other words, the tail period would end on 30 September 2019.\n3 It is undisputed that the services had been performed by the plaintiff and that the defendant had paid the plaintiff fees up till 30 September 2019, which is the end of the tail period in the Agreement.\n4 In this OS, the plaintiff seeks a declaration that he is entitled to further payments beyond 30 September 2019, pursuant to Clause 4.2. This is estimated at eventually amounting to about US$1.5 million, although the plaintiff is not seeking an immediate payment of the specific sum in this application. The plaintiff has also applied for an ancillary disclosure order.\nUndisputed facts\n\n5 The plaintiff provides business consultancy services to individuals and corporations. The defendant is currently the sole shareholder of Shorai Holdings Inc (\"Shorai\"). Through Shorai, the defendant beneficially owns  1/3  of the share capital of Portillo Holdings Corporation (\"PH\") and Prime Target Development Inc (\"PT\") (collectively \"the Companies\"). The other  2/3  of the shares in the Companies are owned by another two families in the defendant's extended family. The Companies are holding companies of a group of companies, which include entities incorporated in Hong Kong, India, UAE and the British Virgin Islands (\"the Watanmal Group\").\n6 In 2011, the three families owning the Companies had disagreements and agreed to divest, liquidate and monetise their interest in all assets of the Companies, as well as assets they shared an interest in. However, in 2012, the other two families set up an operations committee and a sales committee that excluded the defendant and sought to use their combined  2/3  shareholding majority to exclude the defendant from the management and operation of the Companies.\n7 The defendant engaged the plaintiff to provide services in relation to the operations of the Companies and to monetise the defendant's  1/3  interest in the Companies. They entered into the first Tranzmute Agreement dated 29 March 2012, which was then superseded by the second Tranzmute Agreement dated 14 June 2013 (collectively the \"Tranzmute Agreements\"). Tranzmute Business Advisory LLP was an advisory firm the plaintiff was then conducting business under. The second Tranzmute Agreement was terminated by Tranzmute Business Advisory LLP by notice, in a letter dated 1 July 2016.\n8 During that time, the defendant continued to be excluded from the management and discussions on the sale of the assets of the Companies. The plaintiff and defendant entered into the Letter of Engagement, dated 14 June 2013, where the plaintiff was engaged to: (a) act as the defendant's alternate director on the board of the Companies; and (b) act as a member of the sales committee constituted to oversee and implement the sale of the assets of the Companies (\"the Sale\"). In return, the parties agreed that the plaintiff would be entitled to fees for his services, which were to be computed and paid in accordance with Clause 4.2, which was subsequently amended and superseded by the Addendum on 1 April 2017. All the relevant agreements in respect of the Sale were executed on or about 15 December 2016 and all the monies in respect of the Sale were received by the various Watanmal Group companies by May 2017.\n9 Clause 4.2, as amended by the Addendum, is the clause that governs the plaintiff's entitlement to fees, and interpretation of which is the primary subject of this OS. It reads:\n4.2 Fees for such services will be computed and paid on the basis of\na. 1% (One percent) of the value realized by Ishan [the defendant] upto [sic] US$20 million\nb. 15% (Fifteen percent) of the value realized by Ishan in excess of US$20 million\nFor the purposes of this letter, \"value realized by Ishan\" will be value or amounts received by Ishan from the Companies [ie, PH and PT] or Shorai Holdings Inc., or any other holder of the shares currently held by Shorai Holdings Inc., in any form whatsoever commencing from the date of this Addendum, including but not limited to sales proceeds form [sic] the sale of the assets of the Companies, dividends, royalties, non-compete fees or any similar such payments / fees that are linked to or arise from Ishan's ownership of 1/3rd share of the Companies. However, for the avoidance of doubt, this will not include any monthly dividends (US$25,000) received by Ishan and will not be counted as \"value realized by Ishan\". These fees will be paid immediately upon Ishan receiving the monies described above. For the purposes of this paragraph, besides value realized by Ishan from the Companies, the following assets / receivables will be counted as 'value realized by Ishan' upon receipt by Ishan or by his immediate family or entities owned or for the benefit of Ishan or his immediate family:\na. Sale proceeds from the sale of Ishan's 1/3rd share or the acquisition by Ishan of the remaining 2/3rd share in the Pune Bungalow (located at Pot No. 365 Sindh Society, Aundh, Pune) For the purposes of calculation of my fees, in either of the abovementioned situations, the \"value realized by Ishan\" shall be the transacted value of Ishan's 1/3rd beneficial share in the Pune Bungalow...\n10 Clauses 3 and 4.4 of the Letter of Engagement relate to the termination date of the Agreement and the survival of Clause 4 of the Letter of Engagement for a period of 2 years thereafter. They state :\n3. Term and termination\n3.1 The terms of the Alternative Director and the membership of the Sales Committee shall commence form [sic] the date of such appointment by the Companies and end on 30 September 2017\n3.2 In any event, this agreement -may be terminated, without case, by either party by providing 3 months notice in writing. In the event this agreement is terminated other than through a voluntary termination by me [ie, the plaintiff], clause 4 and 5 of this agreement will survive the termination of this agreement for a period of 2 years. The termination date has been agreed to be 30 September 2017\n4. Fees\n...\n4.4 This clause 4 will survive the termination of this agreement for a period of 2 years except if the agreement is voluntarily terminated by me [ie, the plaintiff] in which case clause 4 is terminated with immediate effect.\nThe parties' case\nThe interpretation of the text of Clause 4.2\n\n11 The crux of the dispute is the interpretation of Clause 4.2. The plaintiff's case is that he is entitled to payment when the Sale has been completed prior to the termination of the Agreement, although actual payment only needs to be made when the defendant receives the monies.\n12 The plaintiff submitted that \"value\" in the phrase \"value or amounts received by Ishan\" in Clause 4.2 must connote something broader than \"amounts\":\n(a) While \"amounts\" means cash or monies, \"value\" can be \"in any form whatsoever\".\n(b) This is supported by the non-exhaustive list of examples in Clause 4.2 of \"value\" received, which includes \"sales [sic] proceeds from the sale of the assets of the Companies, dividends, royalties, non-compete fees or any such payments/fees ...\" While dividends, for instance, involve monies paid to the defendant, sale proceeds do not, as sale proceeds arising from the Sale are paid to the Companies.\n(c) This shows that \"value\" received by the defendant under Clause 4.2 includes the Companies' receipt of sale proceeds from the Sale, even though such monies did not flow directly to the defendant.\n13 While Clause 4.2 also states that \"(t)hese fees will be paid immediately upon Ishan receiving the monies described above\", the plaintiff's interpretation of this is that the payment of fees, which is predicated on monies received by the defendant, is distinct from entitlement to fees, which is predicated on value realised. In addition, the plaintiff's position is that the fees that are payable to him under Clause 4.2 would take into account the expenses incurred in relation to the Sale and other operating costs of the Companies, as well as the interest that the Watanmal Group may have earned during the tail period. During oral submissions, counsel for the plaintiff put his case as that the plaintiff is entitled in principle to be paid 15% of the amount that is received by the defendant.\n14 The plaintiff referred to the example at Clause 4.2(a.) of the Agreement to support his interpretation. There, \"value realized\" by Ishan is defined to also include:\na. Sale proceeds from the sale of Ishan's 1/3rd share or the acquisition by Ishan of the remaining 2/3rd share in the Pune Bungalow ... in either of the abovementioned situations, the 'value realized by Ishan' shall be the transacted value of Ishan's 1/3rd beneficial share in the Pune Bungalow.\n15 This means that even if the defendant were to buy the other  2/3  share in the Pune Bungalow, that is even if the defendant did not receive monies for his  1/3  share in Pune Bungalow, the defendant would still have to pay monies to the plaintiff for the  1/3  share. The plaintiff submitted that this reinforces the point that \"value realized\" is broader than \"value received\".\n16 The defendant's case is that his payment obligation only arises upon the actual receipt of monies by the defendant from the Companies or Shorai. The defendant pointed out that in Clause 4.2, \"value realized\" means \"value received\" by the defendant. A literal reading of Clause 4.2 means that the defendant is only obliged to pay the plaintiff upon receipt of the monies from the Companies. The literal meaning of \"receipt\" means that the defendant must take possession of the monies. The defendant has no obligation to pay the plaintiff if the actual receipt of monies took place after the expiry of the two-year tail period. Thus, even if no dividends were declared at all until after the expiry of the two-year tail period, there would be no payment to the plaintiff. This is because the service provided by the plaintiff was to monetise the assets for the defendant. If the monies stayed in the Companies and did not flow directly to the defendant, the defendant's position would not be improved.\nCommercial context of the Agreement\n\n17 The plaintiff submitted that the commercial context supported his interpretation. Parties to the Agreement knew that the proceeds of such Sale would not be paid directly to the defendant, as the sellers were the operating subsidiaries. The plaintiff was also aware that the defendant had no control as to when dividends from his shareholding would be made. It is therefore consistent with the commercial context that payment obligations would be triggered upon the completion of the Sale and the receipt of the Sale proceeds by the relevant companies. At that point, value would have been realised by the defendant qua shareholder, even if actual distributions would take place later.\n18 The defendant's view on the commercial context differed. The objective, as the defendant saw it, was to liquidate and monetise the defendant's  1/3  interest in the Companies. This means actual receipt of monies by the defendant. Further, the plaintiff had always known that the defendant had no control over the Companies and over any receipt of monies, and that any \"value realized\" depended on the declaration of dividends by the board of directors of the Companies, or actual payment from the Companies to the defendant. This is consistent with the defendant's conduct, as the defendant had only paid the plaintiff's fees upon actual receipt of monies from the Companies.\n19 The defendant stated that not all the amounts that currently rest in the Companies may be eventually realized and received by him. The Companies and their subsidiaries incur liabilities and other expenses in the jurisdictions where they operate. These costs would be deducted from the cash balance received by the subsidiaries of the Companies from the Sale. While the Sale has been completed since sometime around 2017, the defendant has not received all of the Sale proceeds.\nThe two-year tail period in Clause 4.4\n\n20 The defendant submitted that the two-year tail period in Clause 4.4 of the Letter of Engagement (\"Clause 4.4\") supports his interpretation of Clause 4.2. His position is that Clause 4.4 contractually stipulated the final date on which the plaintiff would be legally entitled to fees arising from the defendant's receipt of monies from the Companies. If the court were to declare that the plaintiff is entitled to further fees, it would indefinitely extend the tail period.\n21 The plaintiff submitted that Clause 4.4 is not meant to extinguish the plaintiff's entitlement to fees for services rendered. The nature of the Sale involved large assets. There could be a lag time between the plaintiff's services to effect the Sale, the completion of the transaction, and the receipt of the Sale proceeds. Hence, a two-year tail period was to entitle the plaintiff to payment for his services where the Sale came to fruition within two years after the termination of the Agreement. If the Sale only took place two years after the termination of the Agreement, it would not be attributable to the plaintiff's services and he would not receive payment.\nThe relevance of the two Tranzmute Agreements\n\n22 The defendant referred to the Tranzmute Agreements to support his interpretation. It is undisputed that the Tranzmute Agreements have been superseded and there are no longer any outstanding obligations under them. The Tranzmute Agreements both contained a similar clause to Clause 4.2:\n(a) Clause 4.2 of the first Tranzmute Agreement provides that:\n... Value Creation Fees will be computed on the basis of 3% of the value realized by the KLS Family in any form whatsoever commencing after the date of this engagement letter, including but not limited to, sale proceeds from sale of ownership in the Watanmal Group, dividends, royalties, non-compete fees or any similar such payments/fees that are linked to or arise from KLS Family's ownership of 1/3rd share of the Watanmal Group. In any event, the value realized by the KLS Family will be the present value of any deferred payments that may be receivable by them. For the purposes of this paragraph, value realized by the immediate family members of KLS, or by any of the entities under the Custodianship of KLS or the KLS Family will be considered to be value received by the KLS Family.\n(b) Clause 4.2 of the second Tranzmute Agreement provides that:\n...Value Creation Fees will be computed on the basis of 3% of the value, up to a maximum of US$57.5 Million, realized by the KLS Family, in any form whatsoever commencing after the date of this engagement letter, including and not limited to, sale proceeds from sale of ownership in the Watanmal Group, dividends, royalties, non-compete fees or any similar such payments/fees that are linked to or arise from KLS Family's ownership of 1/3rd share of the Watanmal Group. However, for the removal of doubt, this will not include the monthly dividends (of US$ 25,000) received by the KLS Family and will not be counted as \"value realized\" by the KLS Family. For the purposes of this paragraph, value realized by the immediate family members of KLS, or by any of the entities under the Custodianship of KLS or the KLS Family will be considered to be value received by the KLS Family.\n23 The defendant submitted that the two prior Tranzmute Agreements confirm his interpretation that \"value realized\" is identical to \"value received\". In both Tranzmute Agreements, \"value realized\" is defined as \"value received\".\n24 The plaintiff submitted that the Tranzmute Agreements are not relevant, since they have been superseded. In any event, they support his interpretation that \"value realized\" is not synonymous with \"value received\". In the first Tranzmute Agreement, \"value realized\" is \"value of any deferred payment that may be receivable by [the KLS family]\". In the second Tranzmute Agreement, Clause 5 states that \"this engagement will commence from the date of this letter and until the receipt, by the KLS Family, of its share of the monies realized by the Companies through the sale of the business and operating assets of the Watanmal Group...\", which again shows that \"realized\" differs from \"receipt\".\nMy decision\nPrinciples of contractual interpretation\n\n25 The relevant principles on contractual interpretation are undisputed. The Court of Appeal in Leiman, Ricardo and another v Noble Resources Ltd and another [2020] 2 SLR 386 (\"Leiman v Noble Resources Ltd\") stated at [59]:\n(a) The starting point is that the court looks to the text that the parties have used: Lucky Realty Co Pte Ltd v HSBC Trustee (Singapore) Ltd [2016] 1 SLR 1069 at [2].\n(b) The court may have regard to the relevant context as long as the relevant contextual points are clear, obvious and known to both parties: Zurich Insurance (Singapore) Pte Ltd v B-Gold Interior Design & Construction Pte Ltd [2008] 3 SLR(R) 1029 at [125], [128] and [129].\n(c) The court has regard to the relevant context because it then places itself in \"the best possible position to ascertain the parties' objective intentions by interpreting the expressions used by the parties in the [contract] in their proper context\": Sembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal [2013] 4 SLR 193 at [72].\n(d) In general, the meaning ascribed to the terms of the contract must be one which the expressions used by the parties can reasonably bear: Yap Son On v Ding Pei Zhen [2017] 1 SLR 219 at [31].\n26 The Court of Appeal in Leiman v Noble Resources Ltd further stated at [60] that due consideration should be given to the \"commercial purpose of the transaction or provision, and ...why a particular obligation was undertaken\".\n27 In addition, the High Court has held that it would generally be admissible to look at prior contracts as part of the circumstances surrounding a later contract, though a cautious and sceptical approach should be taken to finding assistance in the earlier contract given that the latter contract has superseded the earlier: see Standard Chartered Bank v Neocorp International Ltd [2005] 2 SLR(R) 345 (\"Standard Chartered v Neocorp International\") at [42].\nThe text of Clause 4.2\n\n28 In my judgment, the key to the interpretation of Clause 4.2 in this dispute lies in the following phrases of Clause 4.2 set out in bold:\n... For the purposes of this letter, 'value realized by Ishan' will be value or amounts received by Ishan from the Companies [ie, PH and PT] or Shorai Holdings Inc., or any other holder of the shares currently held by Shorai Holdings Inc., in any form whatsoever commencing from the date of this Addendum, including but not limited to sales proceeds form [sic] the sale of the assets of the Companies, dividends, royalties, non-compete fees or any similar such payments / fees that are linked to or arise from Ishan's ownership of 1/3rd share of the Companies...\n[emphasis added]\n29 On a literal reading of these phrases of Clause 4.2, the value received by Ishan (the defendant) from the Companies, in any form whatsoever, includes the sale proceeds from the sale of assets of the Companies. Such sale proceeds would inevitably be paid to the Companies rather than to the defendant directly. In other words, under Clause 4.2, value received was not limited to cash amounts received by the defendant.\n30 The defendant's response to this was that these phrases of Clause 4.2 must be still read as requiring amounts to be received by the defendant. However, if the defendant's interpretation -- that value is received by Ishan only when monies are received by Ishan -- is accepted, that would mean that this specific part of Clause 4.2 would never be activated. In other words, the defendant's interpretation would render this portion of Clause 4.2 meaningless. The plain reading of Clause 4.2 therefore supports the plaintiff's case. It indicates that the plaintiff's entitlement in principle to payment arose when the Sale was effected. This entitlement in principle would be to payment based on the percentage rates set out in Clause 4.2, of the amounts that would eventually be paid to the defendant from the Sale.\nOther clauses of the Agreement\n\n31 Clause 4.2(a.) of the Agreement supports this reading. It refers to the sale or acquisition of the Pune Bungalow by the defendant and sets out a specific situation where \"value\" is defined to be \"received\" by the defendant, even though he does not actually receive monies. Clause 4.2(a.) is set out as an example of \"assets\" that will be counted as \"value realized by Ishan\", besides \"value realized by Ishan from the Companies\". The list of examples in Clause 4.2 clarifies the scope of what assets are considered as \"value realized by Ishan\". There is no language indicating that it is provided as an exception to a Clause 4.2 that is based on the defendant's interpretation, of \"value realized\" being synonymous with \"value received\" by the defendant. Instead, the framing and siting of this example within Clause 4.2 reinforces the plaintiff's case that \"value realized\" is broader than \"value received\", and that \"value realized\" is not limited to monies received directly by the defendant.\n32 The defendant's response to this was to refer to Clause 4.4, as stated above at [20], submitting that the purpose of the tail period was to contractually stipulate the final date on which the plaintiff would be legally entitled to fees arising from the defendant's receipt of monies from the Companies. Thus, if it is declared that the plaintiff is entitled to further fees to be paid after 30 September 2019, this would effectively extend the tail period for an indefinite time.\n33 The plaintiff explained, as stated above at [21], that in transactions involving the sale of large assets, there can be a lag time between the provision of services by the plaintiff and the completion of the transaction and receipt of the Sale proceeds. The intent of the two-year tail period was to allow the plaintiff payment for his services, should the plaintiff's services result in a sale that only came to fruition after the Termination Date, but within the tail period of two years. However, if more than two years had elapsed from the termination of the plaintiff's engagement before a sale was completed, then the parties recognised that such sale would not be attributable to the plaintiff's services and therefore, the plaintiff would not be entitled to fees for such sale. The plaintiff submitted that contrary to the defendant's submission, there is no perpetual entitlement to fees under Clause 4.4, since if the defendant does not receive monies from the Companies, the plaintiff would not collect.\n34 I find that the plaintiff's explanation is consonant with the plain reading of Clause 4.4. Given that the two-year tail period was included in the engagement letter, before the Sale was completed, it is also aligned with the commercial context. It was acknowledged by counsel for the defendant that on the defendant's reading of Clause 4.4, there would not be any payment to the plaintiff, even if services were fully rendered, as long as no payment was directly made to the defendant within the two-year tail period. The defendant submits that this is because the service of the plaintiff was to monetise the assets for the defendant. However, Clause 2 of the Agreement (\"Clause 2\") sets out the scope of work of the plaintiff, in terms of service as an Alternate Director and to serve on the Sales Committee, and neither parties disputed that the plaintiff has fully rendered his services. The plaintiff has also pointed out that value creation does not come solely from monetising assets, but also from ensuring a good selling price for the assets. The defendant's interpretation of Clause 4.4 would mean that the plaintiff himself had inserted a clause on payment that could shut him out of receiving a single cent of payment, despite having fully performed the services required. There would hardly be any commercial purpose for the plaintiff to do so and agree to such.\n35 The text of clause 4.4 read with the scope of work set out in Clause 2, as well as its commercial purpose viewed objectively, support the plaintiff's interpretation. Clause 4.4 therefore does not contradict, but is consistent with the plain reading of Clause 4.2, which is that \"value received\" by the defendant extends beyond just cash received by the defendant, and the plaintiff's entitlement in principle to payment arose upon the completion of the Sale and payment of the Sale proceeds to the Companies.\nCommercial context\n\n36 The defendant drew reference to the Tranzmute Agreements as commercial context supporting his interpretation of Clause 4.2, pointing out that the definition of \"value realized\" in the Tranzmute Agreements are similarly worded to that in the Agreement, as \"value received\".\n37 The plaintiff submitted that the Tranzmute Agreements are irrelevant to this application since they are different contracts and have been terminated. But even if they were considered, they actually support the plaintiff's case.\n38 Given that the Tranzmute Agreements were superseded by the Agreement, I do not find them to be of much assistance. As noted at [27] above, the court in Standard Chartered v Neocorp International rightly pointed out that a cautious and sceptical approach should be taken to finding assistance in the earlier contract, given that the latter contract has superseded the earlier. In any event, even if the Tranzmute Agreements were considered, I find that a closer examination of them supports the plaintiff's case regarding the commercial context of the Agreement.\n(a) Clause 4.2 of the first Tranzmute Agreement defined value realized as \"the present value of any deferred payments that may be receivable by [KLS Family]\". It also stated that \"value realized by the immediate family members of KLS [ie, the defendant's family], or by any of the entities under the Custodianship of KLS or the KLS Family will be considered to be value received by the KLS Family\". This reinforces the plaintiff's case that \"value\" received by the defendant is not synonymous with \"amounts\", that is, cash received. \"Value\" includes payments that \"may be receivable\", not just payments that are actually received. In addition, \"value realized\" does not require direct receipt by the KLS Family, so long as it is received by entities under the KLS Family.\n(b) Clause 5 of the second Tranzmute Agreement acknowledged the distinction between the concepts of \"realization\" and \"receipt\" by stating that:\n...this engagement will commence from the date of this letter and until the receipt, by the KLS Family, of its share of the monies realized by the companies through the sale of the business and operating assets of the Watanmal Group...\n39 In light of the above analysis, I found that the payment obligation had arisen upon the completion of the Sale. This interpretation of Clause 4.2 is supported by the plain meaning of the text, as well as the commercial context of parties' agreement. As such, the plaintiff is entitled to payment at the rates provided for in Clause 4.2, upon the defendant receiving the monies from the Companies.\nAncillary Disclosure\n\n40 Besides the declaration, the plaintiff also sought an ancillary order under the second and third prayers of the OS, framed as follows:\n2. An order that the Defendant discloses, within 3 working days of any resolution, notice or declaration made by any entity within the Watanmal Group (including but not limited to Watanmal Boolch and & Co Ltd) of an intention to distribute or pay any amounts, or declare any dividends in respect of the Proceeds to the Defendant and/or Shorai, the details of the amounts to be received and the expected date of such receipts of payment; and\n3. An order that the Defendant discloses within 7 working days of the date of this Order, details of any amounts received under Clause 4.2 of the Letter of Engagement (read with the Addendum) from 30 Sept 2019 to the date of the order to be made therein.\n41 The plaintiff submitted that the court is empowered to make such an order using its inherent jurisdiction to make effective the remedies that it grants. Assuming that this court is empowered to make such an order under its inherent jurisdiction, there must be a need of sufficient gravity for the court to invoke its inherent jurisdiction in such a manner. There must be reasonably strong or compelling reasons to show why the court's inherent jurisdiction should be invoked: see Wee Soon Kim Anthony v Law Society of Singapore [2001] 2 SLR(R) 821 at [29]-[30].\n42 The plaintiff acknowledged that such orders have been made only in the context of Mareva injunctions, in the context of preventing a defendant from dissipating his assets and thus rendering nugatory a judgment against him.\n43 Here, no Mareva injunction has been filed against the defendant. It was also undisputed that the defendant had been timely and upfront in making payments to the plaintiff. There is no evidence of any concern relating to dissipation of assets, or any dishonesty on the part of the defendant such that there is a need of such gravity to invoke the court's inherent jurisdiction.\nConclusion\n\n44 For the reasons given above, I give order in terms to the first prayer of OS 1281 of 2020, that the plaintiff is entitled to fees for services rendered during the period between 14 June 2013 and 30 September 2017 (both dates inclusive) pursuant to Clause 4.2 of the Agreement, to be paid immediately upon the defendant's and/or Shorai's receipt of any monies and/or proceeds as set out in Clause 4.2. I make no order on the second and third prayers, but give liberty to apply.\n45 I will hear parties on costs.\nKwek Mean Luck\nJudicial Commissioner\nPrakash Pillai, Koh Junxiang, Charis Toh Si Ying (Clasis LLC) for the plaintiff;\nIsaac Tito Shane, Lee Koon Foong Adam Hariz, Shamini Shara d/o Balakrishnan (Tito Isaac & Co LLP) for the defendant.\n", "label": [[9, 72, "COURT"], [137, 155, "PETITIONER"], [178, 198, "RESPONDENT"], [318, 359, "PRECEDENT"], [782, 792, "PROVISION"], [1054, 1062, "PROVISION"], [1165, 1175, "PROVISION"], [1193, 1201, "PROVISION"], [1736, 1746, "PROVISION"], [2138, 2157, "ORG"], [2248, 2277, "ORG"], [2289, 2317, "ORG"], [2574, 2583, "GPE"], [2585, 2590, "GPE"], [2592, 2595, "GPE"], [2604, 2626, "GPE"], [3479, 3510, "ORG"], [3631, 3662, "ORG"], [3692, 3703, "DATE"], [3917, 3929, "DATE"], [4329, 4339, "PROVISION"], [4406, 4418, "DATE"], [4497, 4513, "DATE"], [4585, 4609, "ORG"], [4625, 4635, "PROVISION"], [4916, 4921, "OTHER_PERSON"], [5013, 5018, "OTHER_PERSON"], [5098, 5103, "OTHER_PERSON"], [5142, 5147, "OTHER_PERSON"], [5186, 5206, "ORG"], [5260, 5280, "ORG"], [5552, 5557, "OTHER_PERSON"], [5708, 5713, "OTHER_PERSON"], [5760, 5765, "OTHER_PERSON"], [5809, 5814, "OTHER_PERSON"], [5915, 5920, "OTHER_PERSON"], [6014, 6019, "OTHER_PERSON"], [6037, 6042, "OTHER_PERSON"], [6110, 6115, "OTHER_PERSON"], [6175, 6180, "OTHER_PERSON"], [6217, 6222, "OTHER_PERSON"], [6312, 6317, "GPE"], [6319, 6323, "GPE"], [6436, 6441, "OTHER_PERSON"], [6476, 6481, "OTHER_PERSON"], [6534, 6551, "PROVISION"], [6648, 6656, "PROVISION"], [6925, 6942, "DATE"], [7179, 7193, "PROVISION"], [7366, 7374, "PROVISION"], [7536, 7544, "PROVISION"], [7634, 7644, "PROVISION"], [7698, 7708, "PROVISION"], [8011, 8016, "OTHER_PERSON"], [8021, 8031, "PROVISION"], [8226, 8236, "PROVISION"], [8628, 8638, "PROVISION"], [8776, 8786, "PROVISION"], [8848, 8853, "OTHER_PERSON"], [9180, 9190, "PROVISION"], [9338, 9352, "ORG"], [9612, 9625, "PROVISION"], [9702, 9707, "OTHER_PERSON"], [9770, 9775, "OTHER_PERSON"], [9812, 9817, "OTHER_PERSON"], [9939, 9944, "OTHER_PERSON"], [9979, 9984, "OTHER_PERSON"], [10114, 10127, "ORG"], [10205, 10218, "GPE"], [10596, 10606, "PROVISION"], [10687, 10697, "PROVISION"], [13330, 13340, "PROVISION"], [13402, 13412, "PROVISION"], [13443, 13453, "PROVISION"], [13487, 13497, "PROVISION"], [13520, 13530, "PROVISION"], [13850, 13860, "PROVISION"], [14814, 14824, "PROVISION"], [14978, 14988, "ORG"], [15139, 15153, "ORG"], [15261, 15271, "ORG"], [15306, 15320, "ORG"], [15362, 15372, "ORG"], [15542, 15545, "ORG"], [15600, 15603, "ORG"], [15611, 15621, "ORG"], [15669, 15679, "ORG"], [15870, 15880, "ORG"], [16032, 16046, "ORG"], [16154, 16164, "ORG"], [16199, 16213, "ORG"], [16326, 16336, "ORG"], [16388, 16398, "ORG"], [16486, 16489, "ORG"], [16544, 16547, "ORG"], [16555, 16565, "ORG"], [16613, 16616, "ORG"], [17187, 17197, "ORG"], [17236, 17244, "PROVISION"], [17347, 17357, "ORG"], [17473, 17487, "ORG"], [17701, 17779, "PRECEDENT"], [17782, 17810, "PRECEDENT"], [17916, 17995, "PRECEDENT"], [18139, 18270, "PRECEDENT"], [18525, 18623, "PRECEDENT"], [18766, 18817, "PRECEDENT"], [18845, 18873, "PRECEDENT"], [19378, 19495, "PRECEDENT"], [19518, 19528, "PROVISION"], [19582, 19592, "PROVISION"], [19642, 19652, "PROVISION"], [19726, 19731, "OTHER_PERSON"], [19770, 19775, "OTHER_PERSON"], [19814, 19834, "ORG"], [19888, 19908, "ORG"], [20180, 20185, "OTHER_PERSON"], [20294, 20304, "PROVISION"], [20328, 20333, "OTHER_PERSON"], [20585, 20595, "PROVISION"], [20733, 20743, "PROVISION"], [20889, 20894, "OTHER_PERSON"], [20928, 20933, "OTHER_PERSON"], [20993, 21003, "PROVISION"], [21106, 21116, "PROVISION"], [21151, 21161, "PROVISION"], [21398, 21408, "PROVISION"], [21522, 21535, "PROVISION"], [21795, 21808, "PROVISION"], [21890, 21895, "OTHER_PERSON"], [21925, 21930, "OTHER_PERSON"], [21976, 21986, "PROVISION"], [22059, 22064, "OTHER_PERSON"], [22140, 22150, "PROVISION"], [22332, 22342, "PROVISION"], [22570, 22580, "PROVISION"], [22912, 22929, "DATE"], [23907, 23917, "PROVISION"], [24101, 24111, "PROVISION"], [24351, 24361, "PROVISION"], [24667, 24675, "PROVISION"], [24695, 24704, "PROVISION"], [25108, 25118, "PROVISION"], [25413, 25423, "PROVISION"], [25463, 25471, "PROVISION"], [25567, 25577, "PROVISION"], [25653, 25663, "PROVISION"], [26045, 26055, "PROVISION"], [26592, 26634, "PRECEDENT"], [27232, 27235, "ORG"], [27319, 27322, "ORG"], [27330, 27333, "ORG"], [27388, 27391, "ORG"], [27702, 27712, "ORG"], [28011, 28021, "ORG"], [28137, 28151, "ORG"], [28293, 28303, "PROVISION"], [28483, 28493, "PROVISION"], [28850, 28864, "ORG"], [28895, 28923, "ORG"], [29284, 29294, "PROVISION"], [29894, 29974, "PRECEDENT"], [30845, 30855, "PROVISION"], [30925, 30931, "OTHER_PERSON"], [30986, 30996, "PROVISION"], [31144, 31158, "LAWYER"], [31160, 31172, "LAWYER"], [31174, 31192, "LAWYER"], [31225, 31241, "LAWYER"], [31243, 31268, "OTHER_PERSON"], [31270, 31283, "OTHER_PERSON"]]}
