{"text": "\n\nCulindo Livestock (1994) Pte Ltd v Ananda UK (China) Limited\n[2014] SGHC 178\n\nCase Number\n:\nSuit No 357 of 2012\nDecision Date\n:\n10 September 2014\nTribunal/Court\n:\nHigh Court\nCoram\n:\nTay Yong Kwang J\nCounsel Name(s)\n:\nTito Shane Isaac and Justin Chan (Tito Isaac & Co LLP) for the plaintiff; Sankaran Karthikeyan (Toh Tan LLP) for the defendant.\nParties\n:\nCulindo Livestock (1994) Pte Ltd -- Ananda UK (China) Limited\n10 September 2014\nTay Yong Kwang J:\nIntroduction\n\n1 This is a dispute arising out of the sale of ceftiofur sodium sterile (\"CSS\") from the defendant, Ananda UK (China) Limited (\"Ananda\"), to the plaintiff, Culindo Livestock (1994) Pte Ltd (\"Culindo\"). CSS is an antibiotic that is commonly used for the treatment of respiratory diseases in livestock. Culindo is a company incorporated in Singapore which counts among its principal business activities the wholesale business of livestock. Ananda is a company incorporated in Hong Kong which deals mainly with the trading of pharmaceutical products. The present action concerns the alleged breach by Ananda of 11 sales contracts that were entered into between Ananda and Culindo over a course of almost two years between 2009 and 2011. At the conclusion of the trial, I allowed Culindo's claim in part and dismissed Ananda's counterclaim in its entirety. Both parties have since appealed against my decision.\nThe facts\n\n2 Culindo has been engaging in the wholesale business of livestock since 1994. Prior to its contractual relationship with Ananda, Culindo had purchased CSS through both local and foreign intermediaries. Ananda entered into the picture when it demonstrated interest in becoming Culindo's supplier of CSS. Back then, Ananda had sent an introductory email to Culindo to offer three different products, one of which was CSS. In that email, Ananda was described as a \"sophisticated distributor\".\n3 Both parties then engaged in discussions for the sale of CSS from Ananda to Culindo. This eventually culminated in a total of 11 sales contracts entered into between the parties from 2009 to 2011. For ease of reference, a brief summary of the details concerning the 11 contracts for CSS are reproduced as follows:\nS/N\nDate\nQuantity (kg)\nUnit Price (USD/kg)\nContract Price (USD)\n1\n3 September 2009\n100\n570\n57,000\n2\n16 October 2009\n300\n570\n171,000\n3\n11 November 2009\n200\n570\n114,000\n4\n15 January 2010\n200\n570\n114,000\n5\n26 February 2010\n200\n570\n114,000\n6\n7 April 2010\n200\n570\n114,000\n7\n11 June 2010\n200\n570\n114,000\n8\n16 August 2010\n200\n570\n114,000\n9\n1 November 2010\n240\n570\n136,800\n10\n4 March 2011\n200\n595\n119,000\n11\n6 April 2011\n200\n595\n119,000\nIn total, Culindo purchased 2,240kg of CSS from Ananda for the price of USD1,286,800.\n4 Each individual sale process was usually commenced by Culindo sending a purchase order to Ananda. Ananda would reply with the actual sales contract and the following documents would also be prepared:\n(a) a commercial invoice;\n(b) a packing list;\n(c) a certificate of analysis;\n(d) a certificate of origin;\n(e) a certificate of insurance; and\n(f) an air waybill.\n5 Prior to Culindo's acceptance of the shipments, it would send a sample extracted from each shipment to an external laboratory, Pacific Laboratory Services (\"Pacific Lab\"), for tests to be conducted on the sample. Pacific Lab would conduct a \"matching test\" with reference to a sample that was provided by Chem Tec Incorporated (\"Chemtec\"), the manufacturer of the CSS in question. This was also referred to as the Chemtec standard (see [35] below).\n6 The primary dispute in the present action concerns the tenth and eleventh contracts dated 4 March 2011 and 6 April 2011 respectively. In each of the two sale contracts, Ananda was to supply 200kg of CSS to Culindo at a unit price of USD595 per kg, giving rise to a total contract price of USD119,000. Pursuant to a test conducted by Pacific Lab, Ananda's CSS delivered under the tenth sales contract was shown to have a composition of 93.29% of CSS, which was below the Chemtec standard of 95.05%.\nA second sample from the same batch was extracted and sent for a laboratory test to be conducted. The test results yielded an even lower composition of 91.86% of CSS.\n7 Under the eleventh sales contract, two shipments of CSS were sent by Ananda to Culindo. Two samples were sent to Pacific Lab for the \"matching test\" to be conducted and the results revealed a percentage composition of 96.15% and 0.26%.\nWhile the first sample met the Chemtec standard, the second sample fell short by a very large margin.\n8 In around June 2011, Culindo returned approximately 150kg of CSS to Ananda,\nwhich proceeded to deliver a replacement batch of 160kg of CSS to Culindo. The additional 10kg of CSS was said to be a gesture of goodwill by Ananda.\n9 At around the same time, a Korean-based company, Woogene Biotechnology Co Ltd (\"Woogene\"), approached Culindo with a business proposal to supply CSS to Culindo. Woogene followed up by conducting a laboratory test to compare the CSS supplied by Ananda with its product. To Culindo's surprise, the test results revealed that the two compounds had different chemical compositions. It therefore requested Pacific Lab to conduct a laboratory test to compare Ananda's CSS against the internationally recognised reference standard of Sigma-Aldrich, which had been widely used in the chemical and biochemical industries.\n10 To confirm the results, Culindo also sent samples in or around August 2011 for two further tests to be done by Pacific Lab. In addition, it engaged another independent laboratory, TUV SUD PSB Pte Ltd (\"TUV\"), to run tests on Ananda's CSS with reference to the Sigma-Aldrich standard. To ensure the integrity of the test results, Culindo also engaged an independent entity, Crown Agents, to conduct the extraction of samples from Ananda's goods for use in the laboratory tests. The laboratory test results and their significance will be elaborated upon below.\n11 In brief, based on the test results generated by Pacific Lab and TUV, Culindo concluded that Ananda's shipment for both the tenth and the eleventh contracts contained little or no CSS. In fact, additional tests conducted on the samples extracted from Ananda's goods revealed that Ananda had supplied cefotaxime sodium (\"CFX\") in place of CSS. Evidence was led by Culindo to show that the CFX was a substantially cheaper compound than CSS. It was also suggested that CFX was mainly used to treat respiratory tract infections in humans, as opposed to CSS which was primary used on livestock.\n12 Subsequently, Culindo initiated various attempts to resolve the issue with Ananda, which include requesting true copies of the certificate of origin to prove that Ananda's product was indeed supplied from Canada. Culindo also wrote to Ananda to propose a joint extraction and laboratory tests to determine if Ananda's product was really CFX, as opposed to CSS. These requests were not accepted by Ananda. Instead, Ananda wrote to Culindo to request that the latter either return the 400kg of CSS that had been delivered or make payment for it.\nThe parties' arguments\nCulindo\n\n13 Culindo argued that Ananda had breached the implied condition under s 13 of the Sale of Goods Act (Cap 393, 1999 Rev Ed) (\"SGA\") that the goods would correspond with the description. In this respect, it was asserted by Culindo that CFX had been supplied in place of CSS that was expressly specified in the sales contracts.\n14 Culindo further contended that the CSS delivered by Ananda was not fit for its intended purpose pursuant to ss 14(1) and 14(2) of the Act. In support of its argument, Culindo compared CSS against the CFX supplied by Ananda.\n15 In response to Ananda's characterisation of the transaction as one of sale by sample, Culindo argued that a sale by sample only arose in \"rare cases\" and where the written contract did not expressly state that it was a sale by sample, no extrinsic evidence would be allowed.\n16 In addition, Culindo asserted that the parole evidence rule pursuant to ss 93 and 94 of the Evidence Act (Cap 97, 1997 Rev Ed) applied in this case such that there could not be an implication of any contractual term. This was in response to Ananda's argument that a contractual term could be implied to the effect that Ananda was to specifically supply CSS from a company known as Chemtec. In response, Culindo submitted that an application of the business efficacy test could not have given rise to any such contractual implication.\n17 Culindo also argued that there was a total failure of consideration as a result of Ananda supplying CFX when the sales contracts clearly called for the delivery of CSS.\nAnanda\n\n18 In response to Culindo's claim for breaches of the implied conditions under ss 13(1) and 14(2) of the SGA, Ananda characterised the transaction as one of sale by sample as opposed to a sale by description.\n19 As mentioned earlier, Ananda also asserted that a series of contractual terms ought to be implied into the sales contracts. In so doing, it was Ananda's position that the court would be giving effect to the presumed intention of the parties as well as giving business efficacy to the 11 sale contracts. The terms sought to be implied by Ananda are summarised below:\n(a) CSS was to be procured from Chemtec and not any other supplier;\n(b) Chemtec's certificate of analysis was sufficient to certify the quality of CSS sold by Ananda;\n(c) Culindo would use the Chemtec standard to test the suitability and quality of the CSS delivered; and\n(d) the certificate of analysis in (c) would be sufficient to certify both the suitability and the quality of the CSS delivered.\n20 In addition, Ananda also brought a counterclaim against Culindo for non-payment of the contract price in respect of the tenth and the eleventh contracts.\nThe issues\n\n21 The core issues which have arisen in the present action are as follows:\n(a) whether the contract for the sale of CSS from Ananda to Culindo was a sale by description or a sale by sample or both;\n(b) in the event that the sale was by description, whether there was breach of the condition implied under s 13(1) of the SGA that the goods would correspond with the description;\n(c) whether there was a breach of the condition implied under s 14(2) of the SGA that the goods supplied would be of satisfactory quality;\n(d) whether it was an express or implied term of the contract that the source of CSS would be Chemtec;\n(e) whether it was an implied term of the contract that the Chemtec standard would be used to test the suitability and quality of CSS supplied by Ananda;\n(f) what would be an appropriate remedy on the facts of the present case if there was a breach of the sales contract.\n22 I will now proceed to deal with these issues in turn.\nThe decision\nWhether the contract for the sale of CSS from Ananda to Culindo was a sale by description or sale by sample or both\n\n23 In determining which of the implied terms under the SGA would be applicable, there is a need to first ascertain the nature of the sale transaction. While s 14 of the SGA broadly applies to all types of sale in the course of business, s 13 primarily deals with the sale of goods by description, as opposed to s 15 which only applies to a sale by sample.\n24 At the outset, it has been recognised that where the contract is for unascertained goods, the sale must be by description since the buyer must have some means of knowing whether the goods supplied by the seller are the goods specified in the sale contract (see Benjamin's Sale of Goods (Sweet & Maxwell, 8th Ed, 2010) at para 11-008). In this respect, a distinction is often drawn between words that identify the goods, as opposed to words that denote the quality of the goods.\n25 In the present case, each individual sale transaction is usually initiated by a purchase order which is sent by Culindo to Ananda. In the purchase order, Culindo would state the description of the goods, the quantity required, the unit price and the amount which is to be paid. For ease of reference, the description in the purchase order is reproduced as follows:\nCeftiofur Sodium Sterile\n5 kg/can. From Canada. Quoted in USD.\n[emphasis added]\nAfter receiving the purchase order from Culindo, Ananda would reply with a sales contract to confirm the conditions of the sale. In the sales contract, the commodity is again described as \"Ceftiofur Sodium Sterile (Source: Canada)\".\nLooking at these commercial documents as a whole, the sale of goods from Ananda to Culindo was undisputedly a sale by description, where the goods to be sold were consistently described as CSS.\n26 That is, however, not the end of the matter as s 13(2) of the SGA states that it is not sufficient that the bulk of the goods corresponds with the sample if the goods do not also correspond with the description in the event that \"the sale is by sample as well as by description\". This provision clearly envisages a situation where a sale is by description as well as by sample. In ascertaining whether a sale is by sample, the starting position would be s 15(1) of the SGA which states that:\nA contract of sale is a contract for sale by sample where there is an express or implied term to that effect in the contract.\n27 A close perusal of the commercial documents, especially the purchase orders and the sales contracts, reveals the lack of any express term to suggest that the sales were by sample. Any arguments that there was an implied term to that effect are also likely to fail if one takes into account the sale process for each individual transaction. As explained above at [25], the sale process is usually commenced by Culindo when it sends a purchase order to Ananda. After receiving the purchase order, Ananda would then reply with a sales contract. Up to the point in time when the sales contract is concluded by the parties, there is no mention of any sample being used as the reference standard for the purpose of the sale. It is also undisputed that there was no physical delivery of any sample from Ananda to Culindo prior to the actual delivery of the goods in question. In this regard, the only way in which the goods are identified in the commercial documents is \"Ceftiofur Sodium Sterile\".\n28 I found it useful to also refer to the High Court decision of Compact Metal Industries Ltd v PPG Industries (Singapore) Ltd [2006] SGHC 242 (\"Compact Metal v PPG\"), where Sundaresh Menon JC (as he then was) made the following observations at [98]:\n... a sample that was agreed as a reference standard after the contract had been concluded would not ordinarily be relevant to a contract for sale by sample since a contract would generally not be concluded without the subject matter being agreed. ...\nThere is no evidence to suggest that the parties had agreed on a reference standard prior to the sales contract being concluded. If parties had intended for a sample to be used as a reference standard, they must have, at the very least, brought the issue up in the course of negotiations, even if it was not expressly set out in the actual sales contract. There was no evidence to suggest that parties had even raised the issue of a sample being used as a reference standard, let alone arrive at an agreement on the same. Looking at the evidence as a whole, I cannot accept Ananda's arguments that the sale was by sample. I therefore find that the sale of CSS from Ananda to Culindo was by description, not by sample.\nWhether there was breach of the implied condition that the goods would correspond with the description\n\n29 Having found that the sale was by description, s 13(1) of the SGA would be applicable:\nWhere there is a contract for the sale of goods by description, there is an implied condition that the goods will correspond with the description.\nGiven that the sales contracts clearly describe the goods as CSS, the issue is whether the goods that were actually delivered by Ananda corresponded with this description.\n30 The condition implied under s 13(1) of the SGA was recently examined by the Court of Appeal in Chai Cher Watt (trading as Chuang Aik Engineering Works) v SDL Technologies Pte Ltd and another appeal [2012] 1 SLR 152. In that case, it was held (at [19]) that the fact that the wording of s 13(1) classified every description of the contract categorically as a \"condition\" was of crucial significance. The Court of Appeal referred to the condition-warranty approach in common law and observed that under both the SGA as well as at common law, a contractual term must be strictly complied with upon being classified as a \"condition\".\n31 The Court of Appeal also cited extensively from Benjamin's Sale of Goods, where it was observed that there were generally two types of cases where goods have been held not to correspond with their description. The first type comprises cases where there is some small discrepancy from the description in the contract. In other words, with the exception of the minor discrepancy, the goods conform substantially to what is required under the contract. The second type comprises cases where in the absence of detailed commercial description, the goods supplied are to be regarded as not being the goods ordered in a general sense. It was further observed that in the second type of cases, a more considerable discrepancy was required, although most of the authorities involved holding an exemption clause inapplicable where the goods supplied are of a different kind.\n32 Returning to the facts of the present case, it is undisputed that the sales contracts entered into between Culindo and Ananda do not contain any exemption clause. In fact, the dispute between the parties is relatively straightforward. Culindo's position is that Ananda had supplied CFX in place of CSS, and that this would amount to a breach of the implied condition under s 13(1) of the SGA. On the other hand, Ananda argued that it would not have breached the sales contract in so far as the goods supplied satisfy the Chemtec standard.\n33 In order to arrive at a finding on whether the goods correspond with the description in the sales contracts, the dispute over the identity of the goods that were actually delivered by Ananda will have to be resolved. Looking at the evidence as a whole, I am satisfied that the goods delivered by Ananda to Culindo in relation to the shipments made pursuant to the tenth and eleventh contracts were CFX and not CSS.\n34 To establish the fact that Ananda had supplied CFX instead of CSS, Culindo relied on the laboratory test results produced by Pacific Lab and TUV.\nPacific Lab\n\n35 Ms Ngai Yuet Hoong (\"Ms Ngai\"), the laboratory director of Pacific Lab, gave evidence on the laboratory tests conducted on behalf of Culindo. It appears that prior to 2011, Pacific Lab was already conducting tests on the goods supplied by Ananda to Culindo. The testing method between 2009 and 2010 involved the comparison of the samples extracted from the goods supplied by Ananda against a specific standard provided by Chemtec. This was also known as the Chemtec standard. Ms Ngai explained that Pacific Lab was merely required to conduct a \"matching test\" and that no independent evaluation on the quality and the composition of the samples had ever been conducted prior to 2011.\n36 Sometime in June 2011, Culindo requested Pacific Lab to conduct independent laboratory tests on samples extracted from the shipments under the tenth and the eleventh contracts. For the purposes of these tests, a reference sample of ceftiofur sodium from Sigma-Aldrich was used. In this regard, Ms Ngai explained that Sigma-Aldrich was an internationally recognised supplier of reference standard materials and that the Sigma standard was one of the most recognised and commonly used standards in the industry.\n37 Pacific Lab conducted a total of five independent laboratory tests on the samples extracted from Ananda's goods. In the first independent test, the sample from Ananda was tested against both the usual Chemtec standard and the Sigma-Aldrich reference standard. A separate control test was then conducted on samples of CSS that were obtained from an independent third party supplier from China. The following results were obtained:\nSample\nChemtec standard\nSigma-Aldrich Reference Standard\nAnanda\n99.90% ceftiofur sodium\n0.69% ceftiofur sodium\nThird party supplier (Sample 1)\n0.09% ceftiofur sodium\n96.80% ceftiofur sodium\nThird party supplier (Sample 2)\n0.09% ceftiofur sodium\n91.36% ceftiofur sodium\n38 This was followed soon after by a second laboratory test on a sample obtained from the batch of goods delivered by Ananda in or around 10 May 2011. The results were negative as no ceftiofur sodium was detected in the sample. The third laboratory test was conducted on two samples: a sample obtained from Ananda's goods and a sample of CSS obtained from an independent supplier. The test results for Ananda's goods were once again negative as no ceftiofur sodium was detected. In contrast, the sample from the independent supplier was found to contain 99.51% of ceftiofur sodium.\n39 At that point in time, Pacific Lab was informed by Culindo that the goods supplied by Ananda were suspected to be CFX, as opposed to CSS. As a result, Pacific Lab proceeded to obtain a reference sample of CFX from Tokyo Chemical Industry Co Ltd (\"Tokyo Chemical\"). Ms Ngai stated that Tokyo Chemical was a renowned company in the manufacture and supply of organic laboratory chemicals. The reference materials supplied by Tokyo Chemical were said to be internationally recognised and highly regarded in the industry.\nIn the fourth laboratory test, two samples extracted from Ananda's goods were tested against the reference sample of CFX from Tokyo Chemical. The test results revealed that the two samples contained 99.89% and 98.93% of CFX. This was followed soon after by the fifth laboratory test, where Pacific Lab ran a similar test against another two different samples that were extracted from Ananda's goods. The test results revealed that the two samples contained 92.98% and 99.54% of CFX.\n40 On the basis of the results obtained from the five laboratory tests, Pacific Lab arrived at the conclusion that the samples extracted from Ananda's goods were in fact CFX and not CSS as described in the sales contracts.\nTUV\n\n41 Apart from Pacific Lab, Culindo also instructed TUV to perform independent tests on the samples obtained from Ananda's goods. Ms Lim Hwee Jen (\"Ms Lim\"), the Product Manager of Food and Pharmaceutical Testing, Chemical Materials of TUV, gave evidence on behalf of Culindo.\n42 Three test reports were generated by TUV. The first test report was produced by subjecting a sample extracted from Ananda's goods and a reference sample of CSS from Sigma-Aldrich to a process known as mass spectrometry. The test results revealed different mass-to-charge ratios for both samples, thus leading to the conclusion that Ananda's sample was not CSS.\nThe third test report was produced by subjecting a different sample, also extracted from Ananda's goods, to a similar test. The results revealed that the later sample also did not contain CSS.\n43 In the second test, the following three samples were tested for ceftiofur: a sample of CSS from a third party supplier and two samples that were extracted from Ananda's goods. The following results were obtained:\nSample\nAssay\nThird party supplier\n96.0%\nAnanda (Sample 1)\nNot detected\nAnanda (Sample 2)\nNot detected\n44 On the basis of the results above, TUV arrived at the conclusion that no ceftiofur was detected in the samples obtained from Ananda's goods.\nThe findings\n\n45 Up to the point in time when the trial was ongoing, there was no evidence to suggest that Ananda had sent any of their goods for independent testing. No witnesses were called to rebut the evidence given by Ms Ngai and Ms Lim. In fact, the cross-examination of these two witnesses was relatively short. The focus of Ananda's counsel's (Mr Karthikeyan) cross-examination was on the fact that the laboratory tests conducted by Pacific Lab and TUV were based on the Sigma-Aldrich standard, as opposed to the Chemtec standard. Both Ms Ngai and Ms Lim were content to agree that the conclusions they had arrived at were based on the Sigma-Aldrich standard. Apart from that, Mr Karthikeyan did not appear to challenge the procedure undertaken by both laboratories and the veracity of the test results that have been placed before me. As a result, Ms Ngai and Ms Lim's evidence remain unchallenged and unrebutted.\n46 In the light of the overwhelming evidence in the form of the test results generated by Pacific Lab and TUV, I find that the goods supplied by Ananda to Culindo under the tenth and the eleventh sales contracts to be CFX instead of CSS. In arriving at this finding, I acknowledge that Pacific Lab had not only relied on the Sigma-Aldrich standard to establish that the samples extracted from Ananda's goods were not CSS. It had gone one step further to test the samples against a reference sample of CFX from Tokyo Chemical. After doing so, it had arrived at the finding that the samples were CFX. In this regard, the reference samples that were obtained from Sigma-Aldrich and Tokyo Chemical were more reliable than the Chemtec standard that was an in-house sample provided by the manufacturer. Therefore, looking at the evidence as a whole, I am of the view that Culindo has satisfied its burden of establishing that the goods supplied by Ananda were CFX and not CSS.\n47 On that basis, I have no hesitation in finding that Ananda breached the condition implied under s 13(1) of the SGA. The description of the goods in the commercial documents, such as the purchase orders and the sales contracts, was clearly CSS. In this regard, the CFX supplied by Ananda would have failed to correspond with the description set out in the sales contracts.\nWhether there was a breach of the implied condition that the goods supplied under the contract would be of satisfactory quality\n\n48 Apart from s 13(1) of the SGA, Culindo has also argued that Ananda was in breach of the condition of satisfactory quality implied under s 14(2) of the SGA. While Culindo's submissions alluded to Ananda's goods not being fit for their purpose, it is noted that there was no attempt to argue that the goods were not fit for a particular purpose. In this respect, s 14(3) of the SGA was not cited by either party. I will, therefore, proceed on the basis that Culindo was merely referring to the general purpose of the goods under s 14(2B)(a) as one factor to be taken into account for the purpose of determining whether the goods were of satisfactory quality, as opposed to a particular purpose under s 14(3) of the SGA.\n49 The general principles governing the application of s 14(2) of the SGA have been summarised by Sundaresh Menon JC (as he then was) in Compact Metal v PPG at [102]:\n(a) The inquiry whether the goods are of a satisfactory quality is an objective one to be undertaken from the view point of a reasonable person.\n(b) The reasonable person in question is one who is placed in the position of the buyer and armed with his knowledge of the transaction and its background rather than one who is not so acquainted - Bramhill v Edwards [2004] 2 Ll Rep 653 at [39] (\"Bramhill\").\n(c) The burden of proof in this case is on the plaintiff who is alleging that the goods are not of satisfactory quality - see Bramhill at [41].\n(d) The inquiry is a broad based one directed at whether the reasonable person placed in the situation of the buyer would regard the quality of the goods in question as satisfactory.\n(e) At every stage of that inquiry, the [SGA] clearly contemplates that the court should consider any and all factors that may be relevant to the hypothetical reasonable person. The [SGA] does provide some practical guidelines to aid in structuring the inquiry.\n...\n[emphasis in original]\nThese principles were cited with approval by the Court of Appeal in the subsequent decision of National Foods Ltd v Pars Ram Brothers (Pte) Ltd [2007] 2 SLR(R) 1048 at [58].\n50 Based on the evidence that has been placed before me, I am of the view that Culindo has discharged its burden of proving that the goods supplied by Ananda were not of satisfactory quality, such that the implied condition under s 14(2) was breached. While it is accepted that there was no evidence to suggest that the goods supplied by Ananda had resulted in any perceivable harm to Culindo's livestock, it bears emphasising that the factors listed in s 14(2B) of the SGA are non-exhaustive. As was mentioned in Compact Metal v PPG, the court has to adopt a context-specific approach at every stage of the inquiry, taking into account \"any and all\" factors that may be relevant to the hypothetical reasonable person.\n51 More importantly, s 14(2A) of the SGA also states unequivocally that goods are of satisfactory quality if they meet the standard that a reasonable person would regard as satisfactory, taking into account \"any description of the goods, the price (if relevant) and all other relevant circumstances\". On the facts of the present case, it is noted that the goods to be supplied by Ananda were clearly described as CSS. As discussed in the previous section on s 13(1) of the SGA, Culindo has established that the goods supplied by Ananda were CFX and not CSS. More significantly, there was evidence led by Culindo to establish the fact that the market price of CSS was significantly higher than CFX. This was not challenged by Ananda.\n52 On that basis, given that the price of the goods agreed upon in the sales contracts was aligned with the market price of CSS, I am of the view that the reasonable hypothetical buyer would not regard CFX as being of satisfactory quality when CSS was clearly meant to be delivered under the sales contracts. If this were not the case, the buyer would effectively be overpaying by a significant margin due to the price differential between the market price of CSS and CFX. Further, although there was no evidence to suggest that the CFX supplied by Ananda caused any harm to Culindo's livestock, evidence was led through Ms Ngai on the differences between CSS and CFX.\nIn essence, she stated that CSS was a broad-spectrum antibiotic used mainly in the field of veterinary practice against respiratory diseases for livestock. In contrast, CFX was a broad-spectrum antibiotic used to treat, amongst other things, respiratory tract infections in humans. This was not challenged by Ananda in the course of the trial.\n53 In fact, Culindo had adduced screenshots of Ananda's website where \"Cefotaxime Sodium\" (ie, CFX) was listed under the main product list, while \"Ceftiofur Sodium\" (ie, CSS) was classified under veterinary products.\nWhen Ananda's sole witness, Sindy Lui Ha (\"Ms Lui\"), was cross-examined on this difference in classification, she gave the following evidence:\nQ:No, no, product list is different. One features for products that I believe are for human consumption and the other, at page 104 and particularly ceftiofur sodium, is under your veterinary products. Correct?\nA:Er, yah, you can say like this.\n...\nQ:So following from your answer, you were able to distinguish that cefotaxime should be put under a product list primarily for human consumption and ceftiofur sodium should be put under a list for veterinary products. Correct?\nA:Yah. From my supplier, it is that.\nBased on the evidence before me, it does appear that at the very least, CFX was primarily for human consumption while CSS was essentially used as a veterinary product. Given the difference in usage, it is therefore extremely unlikely that the hypothetical reasonable buyer would accept CFX as being of satisfactory quality under the contracts when the contracts clearly call for the delivery of CSS.\n54 On an overall assessment of the facts, I find that Culindo has discharged its burden of proving that the goods supplied by Ananda were of unsatisfactory quality, so as to give rise to a breach of the implied condition in s 14(2) of the SGA.\nWhether it was an express or implied term of the contract that the source of the CSS would be Chemtec\n\n55 I now move on to consider Ananda's arguments that it was either an express or implied term of the contract that the source of CSS would be Chemtec. A perusal of the commercial documents concerning the sale of CSS from Ananda to Culindo reveals that there was no such express term. In the purchase orders that were sent by Culindo, the goods requested were merely described as ceftiofur sodium sterile \"[f]rom Canada\".\nThere was no mention of Chemtec being the only source to which Ananda could turn to in fulfilling Culindo's request. In the subsequent sales contracts that were forwarded by Ananda to Culindo, there was similarly no mention of Chemtec being the specified source of CSS.\n56 Looking at the commercial documents as a whole, the source of CSS was only identified as \"Chem Tec Incorporated\" in the following documents:\n(a) the commercial invoice;\n(b) the air waybill;\n(c) the packing list; and\n(d) the certificate of origin.\nIn this regard, these documents were only prepared after the contract of sale had been entered into by the parties. This was accepted by Ms Lui in the course of cross-examination:\nQ:... So the contract which is on page 62 prepared by you is dated the 3rd of September, correct?\nA:Yah.\n...\nQ:... And the commercial invoice is on the 23rd September.\nA:Yes.\nQ:Roughly about 20 days later. Correct?\nA:Correct.\nBy way of comparison, the purchase orders and the actual sales contracts do not specify the actual source apart from the country of origin, which was Canada. I am therefore of the view that the insertion of \"Chem Tec Incorporated\" in the above-mentioned documents was only meant to identify the actual source of the goods in each individual shipment for the purpose of shipping the goods. The references to \"Chem Tec Incorporated\" cannot be regarded as an express term of the sales contract and thereby confine Ananda to obtaining CSS from Chemtec.\n57 In addressing the issue of whether such a term can be implied on the facts of the present case, I found it useful to refer to the recent Court of Appeal decision of Sembcorp Marine Ltd v PPL Holdings Pte Ltd and another and another appeal [2013] 4 SLR 193 (\"Sembcorp Marine v PPL\"). In that case, it was observed (at [29]) that the implication of terms in fact was the process by which the court filled a gap in the contract to give effect to the parties' presumed intentions. The Court of Appeal acknowledged that the court should only consider implying a term into the parties' contract in the situation where \"the parties did not contemplate the issue at all and so left a gap\" (at [94]). This can be contrasted with situations where the parties contemplated the issue but chose not to provide a term for it either because they mistakenly thought that the express terms of the contract had adequately addressed it or because they could not agree on a solution.\n58 The fundamental flaw in Ananda's case would be the failure to establish that it was the presumed intention of both parties for Ananda to confine itself to purchasing CSS from Chemtec. While Ananda has led evidence to show that it had done prior research on the dealings Culindo had with previous suppliers, this is of limited use in so far as it does not show that Culindo and Ananda had both intended to restrict the source of CSS to Chemtec in the present relationship. Right at the beginning of the relationship between Culindo and Ananda, the email dated 10 March 2009 that was sent by Ms Lui to Culindo only offered the following description:\n...\n2) Certiofur Sodium (Qty: 100kgs)\nUSD 570.-/kg CIF AIR Singapore\nPacking in 5 kg/aluminum can\n...\nThere was no mention that CSS would only be obtained from Chemtec and not any other supplier. After an exchange of emails between the parties, the first order was eventually made by Ananda on 31 August 2000. As elaborated above, there was no mention of \"Chem Tec Incorporated\" in the purchase order by Culindo and the sales contract by Ananda.\n59 Applying the three-step process laid down by the Court of Appeal in Sembcorp Marine v PPL, the court must first ascertain how the gap in the contract arose. In this respect, implication will only be considered if the court discerns that the gap arose because the parties did not contemplate the gap. Looking at the commercial documents as a whole, I am unable to find any gap in the contract that needs to be filled for it to be commercially workable. On this basis alone, I am unable to accept Ananda's position that a term restricting the source of CSS to Chemtec should be implied into the contract.\n60 Moving on to the second step, the court then proceeds to consider whether it is necessary in the business or commercial sense to imply a term in order to give the contract efficacy. Following from my analysis in the first step, it would not be necessary for such a term to be implied into the contract. Under the terms of the contract, Ananda could source its CSS from any supplier, so long as the country of origin was Canada. It was not necessary to impose a restriction on Ananda to obtain CSS from Chemtec only in order to give the contract efficacy.\n61 Finally, the third step involves the court considering the specific term to be implied. At this stage, the officious bystander test is often used as a reference point, where the court must be satisfied that the parties, having regard to the need for business efficacy, would have responded \"Oh, of course!\" had the proposed term been put to them at the time of the contract. If the officious bystander test is not satisfied, the gap persists and the consequences of that gap ensue. On the facts of the present case, there is no evidence to suggest that both parties would have responded in such a manner if it had been put to them that Ananda would be compelled to obtain CSS from Chemtec and no other supplier.\n62 The tenor of the evidence given by Ms Lui suggests that only Ananda was operating under the assumption that it was confined to obtaining CSS from Chemtec. While reference was made to the prior arrangements that Culindo had with other suppliers prior to Ananda entering into the picture, this does not help Ananda's claim in so far as there is no evidence to suggest that Culindo had negotiated with Ananda on the basis of the prior arrangements it had with other suppliers. Further, no evidence was led to suggest that in those prior arrangements, the suppliers were, in fact, restricted to obtaining CSS from Chemtec. Under cross-examination, Ms Lui appeared to be labouring under the misconception that it would be sufficient for the term to be implied into the contract so long as Ananda was working on the basis of that presumed intention:\nQ:... What do you mean by imply?\nA:Imply is for my presumed intention because for my knowledge---\nQ:Stop there, stop there, stop there. Imply, you mean, it was your presumed intention.\nA: Yes.\nQ:Is that what you mean?\nA:Yah.\n[emphasis added]\n63 Finally, both the purchase orders and the sales contracts expressly stated that the country of origin was to be Canada.\nThere was no evidence to suggest that Chemtec was the sole supplier of CSS in Canada such that the reference to Canada would necessarily be a reference to Chemtec. In the absence of such evidence, it is more likely that parties had only intended to restrict the source of CSS to Canada. Ananda was free to obtain its supply from any supplier so long as the country of origin was Canada. The wording of the sales contracts does not allow for the implication of terms to further restrict the source of CSS to a particular supplier.\n64 On an overall assessment of the facts, I am of the view that Ananda's argument for such a term to be implied cannot be sustained simply because no gap exists in the sales contracts. In the circumstances, implying such a term would only have the effect of allowing the court to rewrite the contract entered into by the parties, an approach which was soundly eschewed by the Court of Appeal in Panwah Steel Pte Ltd v Koh Brothers Building & Civil Engineering Contractor (Pte) Ltd [2006] 4 SLR(R) 571 at [8].\nWhether it was an implied term of the contract that the Chemtec standard would be used to test the suitability and quality of the CSS\n\n65 Apart from arguing that there was an implied term designating Chemtec as the only source of CSS allowed under the sales contracts, Ananda also argued for the implication of the term that the Chemtec standard would be used to test the suitability and quality of the CSS. I am unable to accept Ananda's arguments for the reasons that follow.\n66 First, in applying the three-step test laid down in the Court of Appeal decision of Sembcorp Marine v PPL, I am unable to find any gap in the contract that needs to be filled for it to be commercially workable. The sales contracts entered into by the parties clearly call for CSS to be delivered. In this respect, there is no evidence to suggest that the Chemtec standard was the only way of ascertaining the quality of the CSS that was delivered. In fact, reference samples from independent laboratories such as Sigma-Aldrich were internationally recognised and would arguably serve as a better reference point to determine the quality of the CSS. The criterion of necessity for the implication of terms in fact was clearly not met.\n67 Second, the Court of Appeal in Sembcorp Marine v PPL also held (at [98]) that \"a term that is not reasonable, not equitable, unclear, or that contradicts an express term of the contract, will not be implied\". It was further observed that such a term will necessarily fail the officious bystander test. On the facts of the present case, I am of the view that if a term governing the quality and suitability of the goods in question is to be implied, it would have to be a scientifically objective standard. The standard to be implied cannot be wholly subjective, such as the Chemtec standard, which was entirely dependent on the sample provided by Chemtec. It appears that Culindo was, at one point in time, labouring under the impression that the Chemtec standard was an objective standard. This was, however, not the case. In this regard, Ananda's arguments that the Chemtec standard should be implied into the contract cannot succeed.\n68 Third, as a follow up from the previous point, it is noted that the implication of an entirely subjective standard, such as the Chemtec standard, would in effect contradict the express term of the contract which calls for CSS to be delivered. If Ananda's arguments are accepted, it would result in the absurd outcome where it would not be held liable for delivering a substance that does not correspond at all with the contractual description so long as it complies with the Chemtec standard. This would, for all intents and purposes, contradict the express term in the contract which calls for a specific chemical to be delivered.\n69 Nevertheless, that is not to say that parties should not be allowed to rely on a subjective standard, or more commonly known as an in-house standard, to test the suitability and quality of the goods supplied under a sales contract. They simply have to incorporate such a standard as an express term of the contract.\n70 Finally, it bears emphasising that the court will not rewrite the contract for the parties based on its own sense of what is fair and just. In this respect, the Court of Appeal in Sembcorp Marine v PPL (at [88]) referred to Lord Pearson's observations in Trollope & Colls Ltd v North West Metropolitan Regional Hospital Board [1973] 1 WLR 601 at 609 that the court will not improve the contract which the parties have made for themselves, however desirable the improvement may be. While Ananda may be of the view that it has been penalised unfairly given that it was merely the middleman in the entire transaction, it must be emphasised that this is the nature of transactions involving the sale of goods. Ananda had sold goods to Culindo and the fact that it may have been misled by its supplier is no defence to a claim for breach of the sales contracts between Ananda and Culindo.\n71 On an overall assessment of the facts, I am unable to accept Ananda's argument that the Chemtec standard should be implied into the contract.\nThe appropriate remedy\n\n72 It is noted at the outset that Culindo's claim was not confined to the breach of the implied conditions in the tenth and the eleventh contracts. It also sought relief in relation to the breach of all 11 contracts entered into between 2009 and 2011. Although it was undisputed that the goods supplied under the first nine contracts had already been consumed, Culindo sought to base its claim on Ananda's assertion that the goods in all shipments pursuant to the 11 contracts were the same. On that basis, given that it was established that the goods in the shipments in relation to the tenth and the eleventh contracts were CFX as opposed to CSS, it was reasoned that the earlier shipments pursuant to the first nine contracts must have been CFX as well. I rejected Culindo's claim in respect of the first nine contracts.\n73 It is undisputed that the goods delivered pursuant to the first nine contracts had already been consumed by Culindo. While this does not preclude Culindo from seeking a remedy for the alleged breaches of the first nine contracts, it does give rise to evidential difficulties in so far as samples can no longer be extracted from these shipments. It would inevitably be an uphill task to establish that the goods delivered in the earlier shipments also comprised CFX as opposed to CSS. Unlike the shipments in relation to the tenth and the eleventh contracts, there was simply no objective evidence available to prove that the goods delivered pursuant to the first nine contracts were also not CSS.\n74 Culindo relied on Ms Lui's assertion that Ananda had supplied the same goods throughout the entire course of their relationship (ie, across all 11 contracts). For ease of reference, the part of Ms Lui's testimony that was relied upon by Culindo is reproduced as follows:\nQ:... From the evidence you've given in this Court, you have confirmed that the defendants supplied the same goods since the first contract all the way to the 12th contract. Am I correct?\nA:Yes, correct.\nQ:Meaning from 2009 all the way to 2011, correct?\nA:Yes, correct.\nI am, however, reluctant to place too much weight on Ms Lui's testimony that the same goods were supplied throughout all 11 contracts. Although she gave evidence that the goods supplied under the different shipments were all the same, it bears emphasising that this was merely her personal assumption. It was undisputed that unlike Culindo, Ananda had not sent any samples for independent laboratory tests. Due to the lack of objective evidence, I find that Culindo failed to establish, on a balance of probabilities, that the goods supplied pursuant to all 11 contracts were the same. I therefore reject Culindo's claim in respect of the first nine contracts.\n75 With regard to the appropriate remedy for the breach of the tenth and the eleventh contracts, I will first deal with Culindo's claims on the basis of unjust enrichment and a total failure of consideration. Initially, there was some confusion over the quantum of relief sought by Culindo as it appeared to have overlooked the fact that it had not made payment pursuant to the tenth and the eleventh contracts. This was clarified subsequently when Culindo revised its claim downwards to take into account the non-payment.\n76 In this respect, Culindo's claim in unjust enrichment cannot succeed as Ananda had not received any payment for the deliveries made under the tenth and the eleventh contracts. While payment was made in relation to the first nine contracts, Culindo's claim in respect of those contracts has been rejected. Even if it is accepted that Ananda breached the first nine contracts, no evidence was led to quantify Ananda's enrichment or gain. Given the arrangement where Ananda would first purchase the goods from Chemtec before selling it to Culindo, Ananda's gain would presumably be the difference in the sale prices. While the sale prices between Ananda and Culindo were not disputed, no evidence was adduced to shed any light on the amounts Ananda had paid to Chemtec. On that basis, there was simply no way in which Culindo's claim in unjust enrichment could have been quantified.\n77 Similarly, Culindo's claim for total failure of consideration also fails as it had not made any payment pursuant to the tenth and the eleventh contracts. There was nothing Culindo could have recovered from Ananda. Earlier payments that were made in relation to the first nine contracts would not be recoverable as Culindo's claim in respect of those contracts has been dismissed. Furthermore, even if it is accepted that Ananda breached the first nine contracts, Culindo's claim for total failure of consideration remains doubtful in so far as it had received and used up all the goods that were supplied by Ananda and there is no way of knowing now how much of those goods was not CSS. Further, there was no evidence to suggest that the CSS supplied by Ananda was entirely ineffectual. While it was asserted that there was a perceivable reduction in the amount of CSS required after it changed its supplier to Uni-Hana Sdn Bhd (\"Uni-Hana\"), no objective evidence was led to support such an assertion. As Culindo candidly stated, the livestock industry could be subject to many other factors. Even if Culindo's assertions were accepted in their entirety, that would not necessarily lead to the conclusion that the CSS supplied by Ananda was not CSS at all and wholly ineffective so as to give rise to a claim for a total failure of consideration. For the reasons above, Culindo's claim for total failure of consideration cannot succeed.\n78 In the usual course of events, assuming that Culindo had already paid the contract price in full, I would have been prepared to grant Culindo damages amounting to the difference in value between CSS and CFX. As explained above, evidence was led by Culindo to establish that CFX had a significantly lower value as compared to CSS. Nevertheless, this measure of damages was not applicable to the present case as Culindo had not made any payment pursuant to the tenth and the eleventh contracts.\n79 Given that Culindo had purchased CSS from Uni-Hana at a higher price, I was of the view that it would be appropriate to award Culindo damages amounting to USD4,005.99 being the difference between the total sale price of the tenth and the eleventh contracts and the price paid to Uni-Hana. Apart from that, I also awarded Culindo the sum of S$3,755.76 being payment for the extraction and independent laboratory tests conducted in August 2011. This was in the form of consequential losses that Culindo had incurred as a result of the breach on the part of Ananda.\n80 Culindo also sought to be reimbursed for the costs of storage and utilities charges that were incurred in storing Ananda's goods at a warehouse. In response, Ananda argued that it should not be held liable for these charges as it had offered to take back the goods that Culindo had rejected. While Culindo did not deny that Ananda had, in fact, offered to take back the rejected goods, Culindo explained that it had retained the goods in question to prevent the goods from being destroyed by Ananda. Culindo further argued that it had made proposals to Ananda to jointly send further samples for laboratory tests but its requests were rebuffed by Ananda.\n81 I am of the view that Culindo acted reasonably and should thus be entitled to be reimbursed for the storage charges incurred. While it may be argued that Culindo had already sent multiple samples for independent laboratory tests at that point in time, such tests may very well be challenged on the basis that the samples had not been properly extracted from the goods in question. There was therefore a need to retain the goods supplied by Ananda so as to allow the possibility of further independent tests to be conducted. In this regard, I acknowledge that Culindo had, in fact, made multiple requests to Ananda for both parties to jointly send further samples for laboratory tests. Unfortunately, Ananda refused Culindo's offer. I therefore awarded Culindo the sum of S$16,500 being the costs of storage and utilities charges that were incurred in storing Ananda's goods at a warehouse.\nConclusion\n\n82 For the reasons set out above, I allowed Culindo's claim in relation to the breach of the tenth and the eleventh contracts but only in respect of the items mentioned above. Culindo's claim that the first nine contracts were also breached was rejected due to the lack of objective evidence demonstrating that the goods supplied over the course of all 11 contracts were the same. Given that Ananda was found to have breached the tenth and the eleventh contracts, its counterclaim for the unpaid contract price was thereby rejected and dismissed accordingly.\n83 After giving my decision in this case, I was informed by Mr Karthikeyan that he had no instructions on whether Ananda wanted the goods to be returned. He explained that Ananda would likely not have any use for the rejected goods as it was not in the position to seek a refund from Chemtec after such a long time. I therefore granted an order for the goods to be disposed of within seven days in the absence of any objections on the part of Ananda so that further storage and utilities charges need not be incurred.\n84 On the issue of costs, I granted fixed costs of $100,000, inclusive of disbursements, in favour of Culindo. This took into account the fact that Culindo did not succeed on every pleaded point and that its witness, Mr Peter Tay, had protracted the proceedings unnecessarily by not answering questions to the point.\nCopyright (c) Government of Singapore.\n", "label": [[184, 198, "JUDGE"], [219, 235, "LAWYER"], [240, 251, "LAWYER"], [293, 313, "LAWYER"], [437, 451, "JUDGE"], [569, 594, "ORG"], [625, 657, "ORG"], [770, 777, "PETITIONER"], [807, 816, "GPE"], [907, 913, "PETITIONER"], [943, 952, "GPE"], [1067, 1073, "OTHER_PERSON"], [1127, 1133, "OTHER_PERSON"], [1138, 1145, "OTHER_PERSON"], [1245, 1252, "OTHER_PERSON"], [1283, 1289, "OTHER_PERSON"], [1389, 1396, "PETITIONER"], [1509, 1515, "ORG"], [1517, 1524, "ORG"], [1590, 1596, "ORG"], [1664, 1671, "OTHER_PERSON"], [1702, 1708, "ORG"], [1743, 1750, "ORG"], [1823, 1829, "ORG"], [1946, 1952, "GPE"], [1956, 1963, "OTHER_PERSON"], [2633, 2640, "OTHER_PERSON"], [2671, 2677, "OTHER_PERSON"], [2765, 2772, "OTHER_PERSON"], [2801, 2807, "OTHER_PERSON"], [2809, 2815, "OTHER_PERSON"], [3084, 3091, "OTHER_PERSON"], [3202, 3243, "ORG"], [3288, 3299, "ORG"], [3380, 3401, "ORG"], [3616, 3628, "DATE"], [3695, 3701, "OTHER_PERSON"], [3732, 3739, "OTHER_PERSON"], [3859, 3870, "ORG"], [3872, 3878, "OTHER_PERSON"], [4262, 4268, "OTHER_PERSON"], [4272, 4279, "GPE"], [4306, 4317, "ORG"], [4554, 4561, "OTHER_PERSON"], [4601, 4607, "OTHER_PERSON"], [4675, 4682, "OTHER_PERSON"], [4751, 4757, "OTHER_PERSON"], [4810, 4838, "ORG"], [4863, 4870, "OTHER_PERSON"], [4913, 4920, "OTHER_PERSON"], [4922, 4929, "OTHER_PERSON"], [5005, 5011, "OTHER_PERSON"], [5033, 5040, "OTHER_PERSON"], [5162, 5173, "ORG"], [5214, 5220, "OTHER_PERSON"], [5288, 5301, "ORG"], [5401, 5408, "OTHER_PERSON"], [5488, 5499, "ORG"], [5557, 5576, "ORG"], [5602, 5608, "OTHER_PERSON"], [5637, 5650, "STATUTE"], [5706, 5713, "OTHER_PERSON"], [5806, 5812, "OTHER_PERSON"], [5988, 5999, "ORG"], [6004, 6007, "OTHER_PERSON"], [6009, 6016, "OTHER_PERSON"], [6032, 6038, "OTHER_PERSON"], [6190, 6196, "OTHER_PERSON"], [6219, 6225, "OTHER_PERSON"], [6302, 6309, "OTHER_PERSON"], [6546, 6553, "OTHER_PERSON"], [6607, 6613, "OTHER_PERSON"], [6695, 6701, "OTHER_PERSON"], [6737, 6743, "GPE"], [6745, 6752, "OTHER_PERSON"], [6767, 6773, "OTHER_PERSON"], [6841, 6847, "OTHER_PERSON"], [6929, 6935, "OTHER_PERSON"], [6946, 6952, "OTHER_PERSON"], [6962, 6969, "OTHER_PERSON"], [7099, 7106, "PETITIONER"], [7111, 7118, "OTHER_PERSON"], [7131, 7137, "OTHER_PERSON"], [7179, 7183, "PROVISION"], [7191, 7238, "STATUTE"], [7330, 7337, "OTHER_PERSON"], [7437, 7444, "OTHER_PERSON"], [7489, 7495, "OTHER_PERSON"], [7545, 7563, "PROVISION"], [7604, 7611, "OTHER_PERSON"], [7653, 7659, "OTHER_PERSON"], [7679, 7685, "OTHER_PERSON"], [7750, 7757, "OTHER_PERSON"], [7955, 7962, "OTHER_PERSON"], [8014, 8026, "PROVISION"], [8034, 8068, "STATUTE"], [8183, 8189, "OTHER_PERSON"], [8261, 8267, "ORG"], [8323, 8330, "ORG"], [8345, 8352, "OTHER_PERSON"], [8479, 8486, "OTHER_PERSON"], [8562, 8568, "ORG"], [8648, 8654, "OTHER_PERSON"], [8674, 8681, "OTHER_PERSON"], [8735, 8753, "PROVISION"], [8761, 8764, "STATUTE"], [8766, 8772, "OTHER_PERSON"], [8890, 8896, "OTHER_PERSON"], [9012, 9018, "OTHER_PERSON"], [9205, 9211, "OTHER_PERSON"], [9266, 9273, "ORG"], [9306, 9313, "ORG"], [9393, 9399, "OTHER_PERSON"], [9405, 9412, "OTHER_PERSON"], [9651, 9657, "OTHER_PERSON"], [9694, 9701, "OTHER_PERSON"], [9929, 9935, "OTHER_PERSON"], [9939, 9946, "OTHER_PERSON"], [10109, 10116, "PROVISION"], [10124, 10127, "STATUTE"], [10244, 10251, "PROVISION"], [10259, 10262, "STATUTE"], [10570, 10576, "OTHER_PERSON"], [10812, 10818, "OTHER_PERSON"], [10822, 10829, "GPE"], [10938, 10941, "STATUTE"], [11040, 11044, "PROVISION"], [11052, 11055, "STATUTE"], [11120, 11124, "PROVISION"], [11194, 11198, "PROVISION"], [11503, 11511, "OTHER_PERSON"], [11835, 11842, "OTHER_PERSON"], [11846, 11852, "OTHER_PERSON"], [11877, 11884, "OTHER_PERSON"], [12128, 12134, "GPE"], [12208, 12215, "OTHER_PERSON"], [12217, 12223, "OTHER_PERSON"], [12474, 12480, "OTHER_PERSON"], [12484, 12491, "GPE"], [12645, 12652, "PROVISION"], [12660, 12663, "STATUTE"], [13052, 13059, "PROVISION"], [13067, 13070, "STATUTE"], [13628, 13635, "OTHER_PERSON"], [13670, 13676, "OTHER_PERSON"], [13714, 13720, "OTHER_PERSON"], [14015, 14021, "GPE"], [14025, 14032, "GPE"], [14275, 14375, "PRECEDENT"], [14384, 14399, "OTHER_PERSON"], [15287, 15293, "OTHER_PERSON"], [15378, 15384, "OTHER_PERSON"], [15388, 15395, "GPE"], [15585, 15592, "PROVISION"], [15600, 15603, "STATUTE"], [15901, 15907, "OTHER_PERSON"], [15975, 15982, "PROVISION"], [15990, 15993, "STATUTE"], [16042, 16056, "PRECEDENT"], [16069, 16161, "PRECEDENT"], [16233, 16240, "PROVISION"], [16457, 16460, "COURT"], [16628, 16636, "OTHER_PERSON"], [17555, 17562, "OTHER_PERSON"], [17567, 17573, "OTHER_PERSON"], [17683, 17690, "OTHER_PERSON"], [17710, 17716, "OTHER_PERSON"], [17821, 17828, "PROVISION"], [17836, 17839, "STATUTE"], [17860, 17866, "OTHER_PERSON"], [18174, 18180, "OTHER_PERSON"], [18286, 18292, "OTHER_PERSON"], [18296, 18303, "OTHER_PERSON"], [18435, 18441, "OTHER_PERSON"], [18475, 18482, "OTHER_PERSON"], [18533, 18544, "ORG"], [18549, 18552, "OTHER_PERSON"], [18573, 18588, "WITNESS"], [18629, 18640, "ORG"], [18703, 18710, "OTHER_PERSON"], [18743, 18754, "ORG"], [18809, 18815, "OTHER_PERSON"], [18819, 18826, "OTHER_PERSON"], [18945, 18951, "OTHER_PERSON"], [18992, 18999, "ORG"], [19049, 19053, "OTHER_PERSON"], [19069, 19080, "ORG"], [19280, 19287, "OTHER_PERSON"], [19298, 19309, "ORG"], [19511, 19524, "ORG"], [19554, 19558, "OTHER_PERSON"], [19574, 19587, "ORG"], [19867, 19873, "OTHER_PERSON"], [19930, 19936, "OTHER_PERSON"], [20156, 20161, "GPE"], [20587, 20593, "OTHER_PERSON"], [20776, 20782, "OTHER_PERSON"], [20871, 20877, "OTHER_PERSON"], [21077, 21088, "ORG"], [21105, 21112, "OTHER_PERSON"], [21140, 21146, "OTHER_PERSON"], [21205, 21216, "ORG"], [21268, 21298, "ORG"], [21322, 21326, "OTHER_PERSON"], [21339, 21353, "ORG"], [21476, 21490, "ORG"], [21629, 21635, "OTHER_PERSON"], [21697, 21711, "ORG"], [21861, 21872, "ORG"], [21955, 21961, "OTHER_PERSON"], [22126, 22137, "ORG"], [22196, 22202, "OTHER_PERSON"], [22296, 22307, "ORG"], [22309, 22316, "OTHER_PERSON"], [22333, 22336, "ORG"], [22395, 22401, "OTHER_PERSON"], [22414, 22426, "OTHER_PERSON"], [22517, 22520, "ORG"], [22549, 22556, "OTHER_PERSON"], [22598, 22601, "ORG"], [22676, 22682, "OTHER_PERSON"], [22726, 22739, "ORG"], [22893, 22899, "OTHER_PERSON"], [23011, 23017, "OTHER_PERSON"], [23278, 23284, "OTHER_PERSON"], [23371, 23377, "WITNESS"], [23402, 23408, "OTHER_PERSON"], [23561, 23567, "OTHER_PERSON"], [23684, 23690, "OTHER_PERSON"], [23803, 23807, "OTHER_PERSON"], [23815, 23818, "OTHER_PERSON"], [23909, 23915, "OTHER_PERSON"], [23932, 23943, "OTHER_PERSON"], [24018, 24029, "ORG"], [24034, 24037, "ORG"], [24124, 24128, "OTHER_PERSON"], [24136, 24139, "OTHER_PERSON"], [24265, 24276, "OTHER_PERSON"], [24437, 24441, "OTHER_PERSON"], [24449, 24452, "OTHER_PERSON"], [24590, 24601, "ORG"], [24606, 24609, "ORG"], [24645, 24651, "OTHER_PERSON"], [24655, 24662, "GPE"], [24786, 24797, "ORG"], [24893, 24899, "OTHER_PERSON"], [25010, 25024, "ORG"], [25161, 25174, "ORG"], [25179, 25193, "ORG"], [25366, 25373, "OTHER_PERSON"], [25442, 25448, "OTHER_PERSON"], [25526, 25532, "OTHER_PERSON"], [25570, 25577, "PROVISION"], [25585, 25588, "STATUTE"], [25754, 25760, "OTHER_PERSON"], [25989, 25996, "PROVISION"], [26004, 26007, "STATUTE"], [26009, 26016, "OTHER_PERSON"], [26038, 26044, "OTHER_PERSON"], [26114, 26121, "PROVISION"], [26129, 26132, "STATUTE"], [26140, 26147, "OTHER_PERSON"], [26173, 26179, "OTHER_PERSON"], [26339, 26346, "PROVISION"], [26354, 26357, "STATUTE"], [26434, 26441, "OTHER_PERSON"], [26505, 26516, "PROVISION"], [26676, 26683, "PROVISION"], [26691, 26694, "STATUTE"], [26751, 26758, "PROVISION"], [26766, 26769, "STATUTE"], [26794, 26809, "OTHER_PERSON"], [26833, 26852, "PRECEDENT"], [27978, 28055, "PRECEDENT"], [28136, 28143, "OTHER_PERSON"], [28208, 28214, "OTHER_PERSON"], [28287, 28294, "PROVISION"], [28395, 28401, "OTHER_PERSON"], [28442, 28449, "OTHER_PERSON"], [28511, 28519, "PROVISION"], [28527, 28530, "STATUTE"], [28571, 28590, "PRECEDENT"], [28797, 28805, "PROVISION"], [28813, 28816, "STATUTE"], [29156, 29162, "OTHER_PERSON"], [29234, 29241, "PROVISION"], [29249, 29252, "STATUTE"], [29254, 29261, "OTHER_PERSON"], [29305, 29311, "OTHER_PERSON"], [29380, 29387, "OTHER_PERSON"], [29501, 29507, "OTHER_PERSON"], [30058, 30064, "OTHER_PERSON"], [30084, 30091, "OTHER_PERSON"], [30133, 30137, "OTHER_PERSON"], [30165, 30168, "ORG"], [30173, 30176, "ORG"], [30206, 30209, "ORG"], [30487, 30493, "OTHER_PERSON"], [30534, 30541, "OTHER_PERSON"], [30569, 30575, "OTHER_PERSON"], [30744, 30750, "OTHER_PERSON"], [30767, 30779, "WITNESS"], [30785, 30789, "LAWYER"], [31848, 31855, "ORG"], [31920, 31926, "OTHER_PERSON"], [32018, 32025, "PROVISION"], [32033, 32036, "STATUTE"], [32170, 32176, "OTHER_PERSON"], [32362, 32368, "OTHER_PERSON"], [32372, 32379, "OTHER_PERSON"], [32466, 32473, "OTHER_PERSON"], [32553, 32559, "GPE"], [32586, 32593, "ORG"], [32625, 32631, "OTHER_PERSON"], [32660, 32667, "OTHER_PERSON"], [32736, 32742, "OTHER_PERSON"], [32746, 32753, "OTHER_PERSON"], [32789, 32796, "ORG"], [32925, 32946, "ORG"], [33222, 33225, "OTHER_PERSON"], [33333, 33349, "DATE"], [33638, 33644, "GPE"], [33896, 33917, "ORG"], [33999, 34005, "OTHER_PERSON"], [34028, 34035, "ORG"], [34205, 34295, "PRECEDENT"], [34298, 34319, "PRECEDENT"], [35031, 35037, "OTHER_PERSON"], [35134, 35140, "OTHER_PERSON"], [35182, 35189, "ORG"], [35197, 35203, "OTHER_PERSON"], [35277, 35284, "OTHER_PERSON"], [35372, 35379, "OTHER_PERSON"], [35384, 35390, "OTHER_PERSON"], [35442, 35449, "ORG"], [35530, 35537, "OTHER_PERSON"], [35542, 35548, "OTHER_PERSON"], [35600, 35603, "OTHER_PERSON"], [35607, 35614, "OTHER_PERSON"], [35815, 35822, "ORG"], [35939, 35945, "OTHER_PERSON"], [35949, 35963, "DATE"], [36011, 36032, "ORG"], [36059, 36066, "OTHER_PERSON"], [36093, 36099, "OTHER_PERSON"], [36172, 36193, "PRECEDENT"], [36599, 36605, "OTHER_PERSON"], [37046, 37052, "OTHER_PERSON"], [37130, 37136, "GPE"], [37186, 37192, "ORG"], [37212, 37219, "ORG"], [37904, 37910, "OTHER_PERSON"], [37949, 37956, "ORG"], [38021, 38024, "OTHER_PERSON"], [38044, 38050, "OTHER_PERSON"], [38129, 38136, "ORG"], [38194, 38201, "OTHER_PERSON"], [38236, 38242, "OTHER_PERSON"], [38289, 38295, "OTHER_PERSON"], [38354, 38361, "OTHER_PERSON"], [38382, 38388, "OTHER_PERSON"], [38593, 38600, "ORG"], [38630, 38633, "OTHER_PERSON"], [38767, 38773, "OTHER_PERSON"], [39230, 39237, "ORG"], [39270, 39276, "GPE"], [39304, 39310, "GPE"], [39347, 39354, "ORG"], [39471, 39477, "GPE"], [39479, 39485, "OTHER_PERSON"], [39571, 39577, "GPE"], [39786, 39792, "OTHER_PERSON"], [40117, 40229, "PRECEDENT"], [40431, 40438, "ORG"], [40500, 40506, "OTHER_PERSON"], [40661, 40667, "OTHER_PERSON"], [40796, 40817, "PRECEDENT"], [41225, 41238, "ORG"], [41480, 41501, "PRECEDENT"], [42096, 42103, "ORG"], [42121, 42128, "OTHER_PERSON"], [42289, 42295, "OTHER_PERSON"], [42635, 42641, "OTHER_PERSON"], [43523, 43553, "PRECEDENT"], [43572, 43579, "OTHER_PERSON"], [43598, 43692, "PRECEDENT"], [43830, 43836, "OTHER_PERSON"], [44049, 44055, "OTHER_PERSON"], [44074, 44081, "OTHER_PERSON"], [44207, 44213, "OTHER_PERSON"], [44218, 44225, "OTHER_PERSON"], [44291, 44297, "OTHER_PERSON"], [44430, 44437, "OTHER_PERSON"], [44757, 44764, "OTHER_PERSON"], [44793, 44799, "OTHER_PERSON"], [45164, 45171, "OTHER_PERSON"], [45331, 45338, "OTHER_PERSON"], [45369, 45376, "OTHER_PERSON"], [45923, 45930, "OTHER_PERSON"], [45944, 45947, "OTHER_PERSON"], [45965, 45971, "OTHER_PERSON"], [46120, 46123, "OTHER_PERSON"], [46160, 46167, "OTHER_PERSON"], [46520, 46523, "OTHER_PERSON"], [46796, 46803, "OTHER_PERSON"], [46805, 46811, "OTHER_PERSON"], [46922, 46929, "OTHER_PERSON"], [47069, 47076, "OTHER_PERSON"], [47245, 47252, "OTHER_PERSON"], [47407, 47414, "OTHER_PERSON"], [47574, 47581, "OTHER_PERSON"], [47668, 47675, "OTHER_PERSON"], [47723, 47729, "OTHER_PERSON"], [47891, 47898, "OTHER_PERSON"], [47984, 47990, "OTHER_PERSON"], [48058, 48064, "OTHER_PERSON"], [48115, 48121, "OTHER_PERSON"], [48158, 48165, "ORG"], [48187, 48194, "OTHER_PERSON"], [48196, 48202, "OTHER_PERSON"], [48295, 48301, "OTHER_PERSON"], [48306, 48313, "OTHER_PERSON"], [48390, 48396, "OTHER_PERSON"], [48409, 48416, "ORG"], [48466, 48473, "OTHER_PERSON"], [48545, 48552, "OTHER_PERSON"], [48706, 48713, "OTHER_PERSON"], [48740, 48746, "OTHER_PERSON"], [48848, 48855, "OTHER_PERSON"], [48955, 48961, "OTHER_PERSON"], [48997, 49004, "OTHER_PERSON"], [49142, 49148, "OTHER_PERSON"], [49288, 49294, "OTHER_PERSON"], [49445, 49461, "ORG"], [49539, 49546, "OTHER_PERSON"], [49635, 49642, "OTHER_PERSON"], [49764, 49770, "OTHER_PERSON"], [49904, 49911, "OTHER_PERSON"], [50019, 50026, "OTHER_PERSON"], [50108, 50115, "OTHER_PERSON"], [50222, 50229, "OTHER_PERSON"], [50384, 50391, "OTHER_PERSON"], [50481, 50488, "OTHER_PERSON"], [50512, 50520, "ORG"], [50596, 50603, "OTHER_PERSON"], [50749, 50757, "ORG"], [50791, 50798, "OTHER_PERSON"], [50963, 50970, "OTHER_PERSON"], [51025, 51031, "OTHER_PERSON"], [51036, 51043, "OTHER_PERSON"], [51150, 51156, "OTHER_PERSON"], [51194, 51200, "OTHER_PERSON"], [51306, 51313, "OTHER_PERSON"], [51334, 51341, "OTHER_PERSON"], [51360, 51366, "OTHER_PERSON"], [51422, 51429, "OTHER_PERSON"], [51528, 51534, "OTHER_PERSON"], [51536, 51543, "OTHER_PERSON"], [51589, 51595, "OTHER_PERSON"], [51683, 51689, "OTHER_PERSON"], [51716, 51723, "OTHER_PERSON"], [51848, 51855, "OTHER_PERSON"], [52134, 52140, "OTHER_PERSON"], [52253, 52260, "OTHER_PERSON"], [52301, 52307, "OTHER_PERSON"], [52394, 52400, "OTHER_PERSON"], [52409, 52416, "OTHER_PERSON"], [52446, 52453, "OTHER_PERSON"], [52553, 52559, "OTHER_PERSON"], [52640, 52647, "OTHER_PERSON"], [52772, 52779, "OTHER_PERSON"], [52988, 52994, "OTHER_PERSON"], [53218, 53229, "OTHER_PERSON"], [53269, 53275, "OTHER_PERSON"], [53327, 53333, "OTHER_PERSON"], [53439, 53446, "ORG"], [53598, 53604, "OTHER_PERSON"], [53775, 53782, "OTHER_PERSON"], [53821, 53828, "OTHER_PERSON"], [53893, 53902, "WITNESS"], [54004, 54027, "ORG"]]}
