{"text": "\n\nInternational Factors Leasing Pte Ltd v The Personal Representative of Tan Hock Kee & Others\n[2002] SGHC 270\n\nCase Number\n:\nSuit No 1443 of 2001, RA No 107 of 2002\nDecision Date\n:\n18 November 2002\nTribunal/Court\n:\nHigh Court\nCoram\n:\nWoo Bih Li JC\nCounsel Name(s)\n:\nSean Lim and Tan Aik How (Hin Tat & Partners) for the plaintiff; Hri Kumar and Gary Low (Drew & Napier LLC) for all the defendants\nParties\n:\n--\nCivil Procedure - Summary judgment - Application for summary judgment - Counterclaim by defendants - Application for stay of execution - Whether to grant stay of execution where counterclaim existing\nContract - Contractual terms - Use of excess payment by borrower towards reducing principal sum due\nJudgment\nGROUNDS OF DECISION\nBackground\n\n1. The Plaintiff International Factors Leasing Pte Ltd ('IFL') claims against the First and Second Defendants Tan Hock Kee (deceased) and THK Realty Pte Ltd ('THK Realty') payment of an outstanding loan and interest. The Third to Fifth Defendants, i.e Tan Hock Keng, Thng Sock Ching and Tan Ah Geok are guarantors. The loan was for $12 million and disbursed under two accounts. It was secured by mortgages over various properties.\n2. IFL then applied for summary judgment against the Defendants. At the hearing before the Assistant Registrar, judgment was ordered to be entered against all the Defendants as follows:\n(i) Interlocutory Judgment be entered against the Defendants for the principal amounts due under the loans and the guarantees and simple interests such sums to be assessed by the Registrar\n(ii) The Defendants have unconditional leave to defend the claim for compound interests/default interests\n(iii) The Defendants have leave to apply for a stay of execution for the sums assessed to be due to IFL pending the counterclaim by way of a separate application to be supported by an affidavit that provides a quantification of the Defendants' counterclaim\n(iv) Cost of the Interlocutory Judgment shall be paid by the Defendants to IFL such cost to be reserved to the Registrar assessing the quantum of the principal and interests due to IFL\n(v) Cost of the balance claim shall be cost in the cause.\n3. At the hearing before the Assistant Registrar, two main contentions were raised by the Defendants. Firstly, the Defendants argued that IFL had claimed default interest at 18% per annum against the Defendants and such interest amounted to a penalty, relying on the Singapore Court of Appeal case of Hong Leong Finance Ltd v Tan Gin Huay & Anor\n[1999] 2 SLR 153\n. Secondly, the Defendants claimed that IFL had breached their duties as mortgagees in possession owed to the Defendants and that they had a set-off or counterclaim against IFL.\n4. IFL appealed against this decision but the Defendants did not. The appeal was heard by me on 28 June 20002 and, after hearing arguments, I allowed the appeal and granted summary judgment for certain sums. After hearing further arguments on 22 July 2002 and 17 September 2002, I maintained my decision. The Defendants then orally applied for a stay of execution and, after hearing arguments, I dismissed the application for a stay of execution. The Defendants have appealed against my decision.\nThe default interest of 18% per annum\n\n5. The terms of the loan to the First and Second Defendants are set out in a Term Loan Agreement dated 29 September 1995. Under clause 8.4, if there is a default in payment, Tan Hock Kee and THK Realty are liable to pay interest at 18% per annum ('the Default Interest'), over and above the principal sum and the usual interest payable if there was no default.\n6. Before me, the Defendants' position as stated in the written submission of Mr Hri Kumar, their Counsel, was still that the Default Interest was a penalty and hence unenforceable. The written submission also pointed out that as IFL did not adduce any evidence on the principal amount due, the Assistant Registrar gave IFL's Counsel the option of adjourning the hearing to file a further affidavit or for interlocutory judgment to be entered. As IFL opted for the latter, it was not open to IFL to complain about the Assistant Registrar's orders.\n7. Mr Sean Lim, Counsel for IFL, said that while he did select the second option, he also did subsequently apply to adduce further evidence, to which the Defendants' Counsel did not object. Accordingly, further affidavits were filed on behalf of IFL. The material affidavit is the third affidavit of Doreen Chia Lee Yoon, an Assistant Vice President of IFL. What she did was to exhibit a calculation of the sums due under each of the two accounts on the basis that the Default Interest is not applied at all by IFL.\n8. In response, Mr Kumar submitted that while he did not object to the application of IFL to adduce further evidence, he had reserved the Defendants' position. However, as regards the new calculation exhibited in Doreen Chia's third affidavit which did not include any Default Interest at all, Mr Kumar said he had no response.\n9. As IFL had been allowed to adduce further evidence in the face of no objection by Mr Kumar, even though he reserved the Defendants' position, I was of the view that Mr Kumar could no longer insist that IFL should not appeal against the Assistant Registrar's order. Furthermore, since Mr Kumar did not have any response to the new calculation, I allowed the appeal and granted IFL summary judgment for the sums based on the new calculation. This was on 28 June 2002. At the same time, I adjourned the rest of the appeal for both Counsel to consider what submissions they wished to make as to whether the interlocutory judgment should still stand in respect of the balance of IFL's claim or unconditional leave should be granted to the Defendants for that balance. I also allowed the Defendants to make an oral application for stay of execution at the adjourned hearing.\n10. However, by the time the appeal was fixed for further hearing on 22 July 2002, Mr Kumar had raised an argument in respect of the new calculation. He submitted that the new calculation showed that the Defendants had made an excess payment of about $5,800 on one occasion which was applied by IFL to pay the next interest payment due. He submitted that IFL was not entitled to do that and should have applied the excess payment towards reducing the principal whereupon all the interest calculated thereafter would be consequently reduced and hence the sums claimed, even under the new calculation, were excessive.\n11. Mr Lim's response was that the allegation of an excess payment was on the basis that no Default Interest was chargeable. If it was, then there was no excess payment. However, even if no Default Interest was chargeable, it did not follow that IFL was obliged to apply the excess towards reducing the principal. He pointed out that under the terms of the term loan, payment of principal was not allowed unless certain conditions were complied with. For example, the borrowers had to pay a pre-payment fee and give three months' prior notice in writing or pay three months' interest in lieu of such notice. Furthermore, pre-payments had to be in multiples of $100,000. These terms applied to another 'over-payment' as well, which he drew to my attention.\n12. Upon hearing this submission, Mr Kumar conceded that when payments were made, there was no intention to make any capital pre-payment but he argued that this meant that the terms relied upon regarding pre-payment by Mr Lim did not apply. Notwithstanding this concession, Mr Kumar maintained that the excess should be used to reduce the principal.\n13. In my view, if the Default Interest is not enforceable, and this resulted in some over-payments, it did not follow that the excess must be used to reduce the principal. Otherwise, that would be tantamount to effecting a capital pre-payment which, firstly, was never intended and, secondly, did not comply with the terms applicable to a capital pre-payment. If Mr Kumar was right, a borrower could easily circumvent any term on capital pre-payment by simply paying more than what was due, without paying the requisite fee and giving the requisite notice, or interest in lieu of notice. In my view, IFL had already acted reasonably and correctly by applying the excess to reduce the next interest amount due in its new calculation.\n14. However, Mr Kumar had raised another point i.e whether the borrowers should have been given interest on the excess in the interim. My tentative view was that they were not entitled to such interest and, even if they were, that was a matter for a counterclaim.\n15. I would add that the arguments about the excess being used to reduce the principal or, alternatively, earning some interest would not have resulted in a significant reduction in the monies to be paid by the Defendants, even if either of the arguments were successful. It seemed to me that the strategy of the Defendants was simply to prevent or delay IFL from obtaining judgment for any sum. Had I accepted either one of these arguments, I would nevertheless have allowed IFL to come up with another calculation showing the slightly reduced sums as a result of the successful argument and granted judgment on those reduced sums.\n16. In the circumstances, I did not rescind or vary my earlier order. As for the balance, IFL was prepared to agree that the Defendants be granted unconditional leave to defend, and I so ordered.\nAlleged breach of duty as mortgagees\n\n17. The Defendants then alleged that IFL had breached its duty as mortgagee to claim a set-off or counterclaim so as to support their oral application for a stay of execution pending the disposal of their claims against IFL. Their allegations were really in the nature of counterclaims.\n18. The First Defendant Tan Hock Kee had mortgaged properties at 538 to 556 (even numbers only) Geylang Road, Singapore ('the Properties') to IFL as security for the loan. The Properties were rented to one Wong Choi Tim ('Wong') and Chua Tiong Tiong ('Chua') for 12 months from 1 February 2000. At the end of the tenancy, Wong and Chua continued to occupy the Properties on a month to month tenancy. It was only on or about 12 June 2001 that IFL took legal possession of the Properties.\n19. The first complaint by the Defendants was that within three days of taking legal possession, IFL entered into a sale and purchase agreement dated 15 June 2001 ('the S&P Agreement') to sell the Properties to MKTV Karaoke Lounge Pte Ltd ('MKTV') for $12 million. MKTV was a company owned or controlled by Chua. Chua is also known as 'Ah Long San', a well-known illegal moneylender operating in Geylang. At the material time, he had been facing corruption charges involving members of the Singapore Police Force.\n20. The Defendants also alleged that IFL should not have entered into the S&P Agreement with MKTV when the Third Defendant Tan Hock Keng had received phone calls from property agents that they had interested buyers to purchase the Properties at around $12 million. On this point, the Defendants produced a letter dated 11 June 2001 from a company known as Lay Seong Enterprises Pte Ltd to Tan Hock Keng offering to purchase the Properties at a price of $11.8 million. The offer was valid for three weeks.\n21. The Defendants maintained their allegation even though they (including the beneficiaries of the estate of the First Defendant Tan Hock Kee) had signed a letter of consent for IFL to sell the Properties at a price of $12 million. They alleged that the name of the buyer in the letter of consent was left blank and they had assumed that the buyer would be Chua, not MKTV.\n22. The Defendants alleged that MKTV was in fact an insolvent company as its accounts showed that its liabilities far exceeded its assets. Indeed, MKTV was unable to complete the purchase within the eight weeks as envisaged under the S&P Agreement and sought an extension of time to complete by 31 December 2001. Although the Defendants consented to the extension of time, they alleged that they did not suspect that anything was amiss and, so, had insisted on late completion interest being imposed.\n23. The Defendants also suggested that IFL's entry into the S&P Agreement was suspicious and pointed out that there was a conflict of interest on the part of IFL because IFL had also agreed to furnish 100% financing to MKTV.\n24. On 18 October 2001, MKTV informed IFL that it would not proceed with the purchase. On hearing the news, Jenny Pang, who is Tan Hock Keng's assistant, allegedly asked one C K Wong of IFL why IFL was not taking legal action against MKTV and was allegedly told that MKTV only had a paid-up capital of $2. This conversation was denied by C K Wong who exhibited a search of MKTV showing it to have a paid-up capital of $400,000.\n25. The second complaint was that the S&P Agreement only provided for a deposit of $120,000 which was paid. This was only 1% of the purchase price of $12 million instead of the usual 10%. Had IFL insisted on the usual 10%, the higher sum would have further reduced the outstanding loan.\n26. The third complaint was that under the S&P Agreement, IFL had agreed to renovate the Properties for between $1 million to $1.5 million and this would have prejudiced the Defendants' ability to redeem the mortgages.\n27. The fourth complaint was that IFL had refused to use a related company of THK Realty to do the renovation works and thereby minimise the costs thereof.\n28. The fifth complaint was that IFL had failed to collect rent from MKTV who was using the Properties, even though the completion of the S&P had been extended.\n29. The sixth complaint was that IFL had failed to take steps to protect the Properties because when MKTV vacated the Properties on or about 5 November 2001, MKTV had ripped out whatever it wanted and left parts of the false ceiling dangling and there was debris left all over the place.\n30. The seventh complaint was that IFL failed to take any step to rent out the Properties or unreasonably hindered the Defendants' attempts to find a tenant. In particular, the Defendants alleged that they had secured a prospective tenant who was interested in renting the first floor of the Properties for $55,000 per month but IFL insisted that the prospective tenant renovate the Properties to IFL's specifications and the renovation must cost up to $1.15 million.\n31. The eighth complaint was in relation to the sale of 14 Lorong 15 Geylang which was also mortgaged to IFL as security. It was alleged that the manner in which IFL, through its agents, had sold the property resulted in a loss of $400,000 as there was an interested purchaser by the name of Yeo Eng Tiong who was prepared to pay more than the price at which this property was actually sold. However he was unsuccessful as he did not have a cashier's order for the deposit.\n32. In response to the Defendants' allegations, IFL pointed out that it was the Third Defendant Tan Hock Keng himself who informed IFL that Chua was interested in buying the Properties. The Defendants also knew that Chua would use one of his companies to buy the Properties and Chua wanted some renovations to be done. Accordingly, IFL had sought and obtained the Defendants' consent to the sale. As regards the omission to state the name of the buyer in the consent, IFL's contention was that the Defendants knew it would be one of Chua's companies and if the identity of the buyer was as important as the Defendants were suggesting, they would not have signed the consent form without insisting on the name of the buyer being inserted in the consent form.\n33. Indeed, IFL pointed out that the Defendants did not give any reason why it was important to them that Chua be the buyer and not one of his companies when they themselves were currently saying negative things about Chua himself.\n34. As regards the allegation that Lay Seong Enterprises Pte Ltd had allegedly made an offer of $11.8 million, IFL pointed out that Tan Hock Keng had admitted in his second affidavit, paragraph 7, that he did not communicate this offer to IFL.\n35. As regards the allegation that MKTV was a $2 company only, IFL pointed out that two of the prospective purchasers which were subsequently recommended by the Defendants, i.e Rickson Building Construction Pte Ltd and Grazza Pte Ltd, were themselves $2 companies. IFL's point was that if IFL had refused to enter into the S&P Agreement with MKTV, the Defendants would be the first to cry foul against IFL.\n36. I would add that although the Defendants said they did not suspect anything was amiss when they agreed to an extension of time being given to the purchaser to complete the sale, the letter containing their consent to the extension clearly identified MKTV as the purchaser. So much for their purported ignorance about MKTV being the purchaser. What the Defendants were interested in was that MKTV should be charged late completion interest at 10% per annum, as stated in that consent.\n37. As for suspicion arising from the fact that IFL was financing MKTV's purchase, Mr Lim pointed out that Tan Hock Keng's second affidavit, para 7, showed that he knew that IFL was financing MKTV's purchase. Mr Lim also submitted that there was no conflict in IFL financing the purchase as the Defendants had wanted the purchase to go through.\n38. When Mr Lim pointed out that the Defendants knew that IFL was financing MKTV's purchase, Mr Kumar advanced another argument. He submitted that they did not know that IFL was intending to furnish 100% financing. If there was 100% financing, then a 10% deposit, instead of 1%, could have been paid. This pertains to the second complaint about a deposit about 1% only. However, Mr Lim pointed out that in Tan Hock Keng's first affidavit, para 11, he had admitted that he knew that IFL was intending to furnish 100% financing. It seemed to me also that it did not necessarily follow that just because the intention was to obtain 100% financing, MKTV would be prepared to pay a 10% deposit especially if the deposit was to be paid first before the conditions for the 100% financing were met. On the 1% deposit, IFL said that that was all that MKTV was prepared to put up and if IFL had refused to sell unless a higher deposit was paid, it would again be the Defendants who would complain.\n39. As regards the third complaint about IFL agreeing under the S&P Agreement to renovate the Properties between $1 million to $1.5 million, IFL said that because the Properties were dilapidated and the property market was depressed, the Defendants agreed to the condition about renovation but reduced the quantum to $1 million. I would add that the consent to the S&P Agreement signed by the Defendants did mention renovation works to be done by IFL estimated to be $1 million.\n40. As regards the fourth complaint, IFL said it did not refuse to appoint contractors selected by the Defendants but simply informed them that IFL would obtain various quotations and the Defendants' contractors would be free to submit their bid.\n41. As regards the fifth complaint about IFL failing to collect rent from MKTV pending completion of the purchase, Mr Lim said that IFL had sued Chua for the rent (Chua being the tenant and MKTV being the occupant) and had obtained judgment and a Writ of Seizure & Sale on one of his properties.\n42. As regards the sixth complaint about IFL allowing the tenant/occupant to damage the Properties, IFL said that MKTV was occupying the first floor of the Properties under the tenancy granted to Chua before IFL took legal possession. IFL was given physical possession only after the occupant had moved out by which time it was too late to stop the occupant from causing damage when it was moving out.\n43. As regards the seventh complaint about IFL not agreeing to rent out the first floor to a new tenant at the rent of $55,000 a month, IFL said that that amount was not sufficient to pay interest on the outstanding loan. IFL wanted renovations to be done for the first floors and the second floors as the latter was in a dilapidated condition. In any event, IFL had been taking active steps to sell the Properties including applying to sub-divide them.\n44. As regards the eighth complaint regarding the sale of 14 Lorong 15 Geylang, IFL gave its version as to why its agent did not accept an offer by Yeo Eng Tiong who did not have a cashier's order with him for the deposit. IFL also pointed out that Yeo was acquainted with Tan Hock Keng as both were co-directors in Pilecon Pte Ltd and Yeo was also a director in Five Star Book Binding Pte Ltd, which was Tan Hock Keng's company. Yeo was also one of two shareholders and directors of Rickson Building Construction Pte Ltd, one of the new interested purchasers with a paid up capital of $2 only. Accordingly, Yeo's evidence must be treated with caution.\n45. Mr Lim stressed that, aside from the alleged loss of $400,000 in respect of the sale of 14 Lorong 15 Geylang, the Defendants did not quantify their counterclaims although directed to do so by the Assistant Registrar. There were also other creditors who were pursuing their claims against the same Defendants or some of them. He submitted that it would be unfair to hold IFL back with a stay of execution.\n46. Mr Lim also relied on various contractual provisions to support the argument that there should be no stay:\n(a) Clause 13.3 of the Term Loan Agreement (found in Doreen Chia's first affidavit p 38) states:\n'all sums payable by the Mortgager and/or the Borrower under this Agreement shall be paid (i) ... (ii) ... (iii) without deduction or withholding (except to the extent required by law) on account of any other amount, whether by way of set-off counterclaim or otherwise.'\n(b) A similar provision is found in clause 11 of IFL's standard Memorandum of Mortgage (found in Doreen Chia's first affidavit p 60).\n(c) A similar provision is found in clause 16 of the guarantee of the Third to Fifth Defendants:\n'16 All payments ... shall be made without set-off or counterclaim and without any deduction or withholding whatsoever.'\n47. Mr Lim drew my attention to two cases. The first is P.H. Grace Pte Ltd & Ors v American Express International Banking Corporation\n[1987] 1 MLJ 437\n. In refusing to grant a stay of execution on a judgment against guarantors, Justice L P Thean, delivering the judgment of the Court of Appeal, cited the judgment of Parker LJ in Continental Illinois National Bank & Trust Company v Papanicolaou (The Times July 15, 1986). Parker LJ said:\n'... Irrevocable letters of credit and bank guarantees given in circumstances such that they are the equivalent of an irrevocable letter of credit have been said to be the life blood of commerce. Thrombosis will occur if, unless fraud is involved, the Courts intervene and thereby disturb the mercantile practice of treating rights thereunder as being the equivalent of cash in hand.\nWe can see no relevant distinction between the guarantee in that case and the guarantees presently under consideration. The purpose of both was to ensure immediate payment if the principal debtor did not pay. Indeed the present cases make it the more necessary that the court should not interfere, for here the parties have specifically provided both in the loan agreement and the guarantees that payment should be made free of any set-off or counterclaim. It would defeat the whole commercial purpose of the transaction, would be out of touch with business realities and would keep the bank waiting for a payment, which both the borrowers and the guarantors intended that it should have, whilst protracted proceedings on the alleged counterclaims were litigated. We do not doubt that the court has a discretion to grant a stay but it should in our view be \"rarely if ever\" exercised, as Lord Dilhorne said in relation to claims on bills of exchange. Guarantees such as this are the equivalent of letters of credit and only in exceptional circumstances should the court exercise its power to stay execution. The fact that a counterclaim which was likely to succeed existed would not by itself be enough, as Lord Justice Buckley pointed out. It might be that the existence of such a counterclaim coupled with cogent evidence that the bank would, if paid, be unable to meet a judgment on the counterclaim would suffice, but nothing of that nature arises here. This is a simple case where no ground for granting a stay can be shown.'\n[Emphasis added.]\n48. Thean J then added (at p 442):\n'True it is that in the instant case, there is no such clause specifically providing that the payment should be made free of any set-off or counterclaim, but if one examines the passage quoted above, it would be apparent that that does not form an essential part of the ratio decidendi of that case. That it serves only to strengthen the Court of Appeal's view is clear from the preceding words on which it is predicated: \"Indeed the present cases make it the more necessary ...\". Were a stay to be granted in these circumstances, it would, in our view, make nonsense of the \"whole commercial purpose of the suretyship\" - \"you would lose your guarantor at the very moment you most need him\" (per Lord Simon in Lep Air Services Ltd. V. Rolloswin Investment Ltd at page 355). This is more so when, as in the instant case, it was not contended that the amount for which summary judgment was granted was not due.'\n49. Mr Kumar submitted that in that case our Court of Appeal was of the view that there was still a discretion whether to grant a stay of execution or not even if there was a contractual clause providing that payment should be made free of any set-off or counterclaim. However, it seemed to me that even if this were so, Parker LJ had said that the fact that a counterclaim was likely to succeed would not by itself be enough to justify a stay vis--vis guarantors and this view was implicitly adopted by our Court of Appeal. I would add that, on the facts in that case, our Court of Appeal was inclined to granting a stay vis--vis the mortgagor but the mortgagor had been wound up.\n50. The second case which Mr Lim referred to was Citibank NA v Lee Hooi Lian & Anor\n[1999] 4 SLR 469\n. In that case, Justice Goh Joon Seng dismissed a mortgagor's application for a stay of execution based on her counterclaim in view of contractual provisions similar to the ones before me. Goh J relied on Hong Kong and Shanghai Banking Corp v Kloeckner & Co AG [1990] 2 QB 514 and Coca Cola Financial Corp v Finsat International Ltd [1996] 2 Lloyd's Rep 274 and he did not seem to think that there was a discretion to grant a stay in view of the contractual provisions although he did not say so specifically. On the other hand, it appears that the American Express case might not have been cited to him.\n51. In the case before me, I was of the view that even if I still had a discretion to grant a stay of execution, notwithstanding the contractual provisions, I should not do so. As Parker LJ had said, the existence of a counterclaim would not by itself be enough where guarantors seek a stay. Moreover, as Mr Lim had submitted, the Defendants had not quantified the rest of their counterclaims. It seemed to me that the reason they did not do so was because the quantum of all their counterclaims would still be substantially less than IFL's claim. Thirdly, while I do not go so far as to say that there is no merit whatsoever in all of the counterclaims, the nature of many of the allegations made by the Defendants did not engender confidence in their bona fides. For example, the Defendants had complained about IFL dealing with Chua when it was Tan Hock Keng who introduced Chua to IFL. They had complained about IFL selling the Properties to MKTV when the Defendants had consented to an extension of time to complete knowing that MKTV was the purchaser. They had complained about MKTV allegedly being a $2 paid-up company when the new purchasers they had introduced were also $2 paid-up companies.\n52. As for Mr Kumar's submission that IFL still had a mortgage on the Properties and perhaps on another property as well, I was of the view that this was not a strong factor in favour of a stay of execution. It would be almost tantamount to compelling IFL to sell any property which was mortgaged to it before taking enforcement proceedings.\n53. Mr Kumar also submitted that if there was no stay, the Defendants would be made bankrupt or wound up and they would not be in a position to pursue the counterclaims. This would effectively shut out the Defendants and/or hinder the fair prosecution of their counterclaims. Mr Kumar relied on the judgment of Justice Yong Pung How (as he then was) in Invar Realty Pte Ltd v Kenzo Tange Urtec Inc & Anor\n[1990] 3 MLJ 388\nwhere Yong J said, at p 391:\n'The Court of Appeal in Sheppards v Wilkinson recognized that a counterclaim may be used by a party as a defence to a claim in certain instances. The court stated that a defendant ought not to be shut out from defending unless it was very clear indeed that he had no case in the action under discussion. There might be either a defence to the claim which was plausible or there might be a counterclaim pure and simple. To shut out such a counterclaim would be an autocratic and violent use of O 14. The court had no power to try such a counterclaim on such an application, but, if they thought it so far plausible that it was not unreasonably possible for it to succeed if brought to trial, it ought not to be excluded. If the counterclaim was for a less sum than that claimed, then judgment might be signed, if there was no real defence, for so much of the amount of the claim as was not covered by the counterclaim. But if the counterclaim overtopped the claim and was really plausible, then the rule which had been often acted upon at chambers, of allowing the defendants to defend without conditions, was the right one. There were however circumstances which might call on the court to act differently. If it was clear that the claim must succeed and there was really no defence to it, and the plaintiffs would only be put to expense in proving their claim, then there ought to be judgment on the claim, but the matter must be so dealt with that the defendants who had a plausible counterclaim must not be injured; and that would be done by staying execution on the judgment until the counterclaim had been tried.\nThe Court of Appeal was unanimous in endorsing that the proper order must be for judgment to be entered for the plaintiffs, with a stay of execution pending trial of the counterclaim or further order. The reasoning seems clear that the claim by the plaintiffs and the counterclaim by the defendants must be taken separately. If there is no defence to a claim other than a plausible counterclaim, then judgment must be entered on the claim. To prevent injury to the defendants and to prevent an autocratic and violent use of O 14 by shutting out the defendants, a stay of execution on the judgment must be granted, pending the trial of the counterclaim or until further order. The overriding consideration is that if the claim is undisputed other than by means of a counterclaim, the claimant must not be put to the expense of proving his claim, even if no great expense would be incurred in proving that claim at a trial.'\n54. However, after that passage, Yong J also said that the principles cited in Sheppards v Wilkinson have been applied with approval in several cases, which he mentioned. One of these cases was the American Express case which I have dealt with above. As I have said, in the American Express case, the Court of Appeal was of the view that, generally speaking, a stay of execution should not be granted at least vis--vis guarantors. I did not think that the judgment of Yong J meant that, as a general rule, a stay of execution should be granted once there was a counterclaim so as to prevent an abuse of the summary judgment procedure or to avoid shutting out the counterclaim.\n55. Besides, the facts in Invar Realty were different from those before me. There, the plaintiff was a developer and the first and second defendants were the architect and civil and structural engineer respectively. There were defects in the building concerned but the second defendant had a counterclaim for its fees of about $179,000. The plaintiff admitted about $116,000 was due to the second defendant and on that basis, the second defendant sought summary judgment for the lower figure. As Yong J said, at p 389:\n'The issues on these two appeals are (1) whether the registrar was right in giving the second defendants summary judgment for $116,585.07 on their counterclaim and (2) whether the registrar was right in dismissing the plaintiffs' application to amend their defence to the counterclaim.'\n56. The argument on the first issue was whether summary judgment should be entered against the plaintiff at all in view of the plaintiff's claim and not whether there should be a stay of execution, if summary judgment was granted against the plaintiff.\n57. Each case must depend on its facts and in view of the facts before me, I declined to order a stay.\nSgd:\nWOO BIH LI\nJUDICIAL COMMISSIONER\nCopyright (c) Government of Singapore.\n", "label": [[2, 110, "PRECEDENT"], [235, 248, "JUDGE"], [267, 275, "LAWYER"], [280, 291, "LAWYER"], [336, 354, "LAWYER"], [759, 806, "PETITIONER"], [862, 874, "RESPONDENT"], [890, 908, "ORG"], [1004, 1017, "RESPONDENT"], [1019, 1034, "OTHER_PERSON"], [1039, 1050, "OTHER_PERSON"], [1186, 1189, "RESPONDENT"], [1996, 1999, "ORG"], [2102, 2105, "ORG"], [2302, 2305, "ORG"], [2431, 2456, "COURT"], [2465, 2526, "PRECEDENT"], [2567, 2570, "ORG"], [2700, 2703, "ORG"], [2708, 2711, "PETITIONER"], [2801, 2814, "DATE"], [2948, 2960, "DATE"], [2965, 2982, "DATE"], [3369, 3379, "PROVISION"], [3415, 3427, "OTHER_PERSON"], [3432, 3442, "ORG"], [3687, 3692, "OTHER_PERSON"], [3832, 3835, "ORG"], [3922, 3925, "ORG"], [4049, 4052, "ORG"], [4094, 4097, "ORG"], [4156, 4164, "OTHER_PERSON"], [4178, 4181, "ORG"], [4396, 4399, "ORG"], [4450, 4470, "OTHER_PERSON"], [4503, 4506, "ORG"], [4661, 4664, "ORG"], [4685, 4690, "OTHER_PERSON"], [4752, 4755, "ORG"], [4879, 4890, "OTHER_PERSON"], [4963, 4968, "OTHER_PERSON"], [5000, 5003, "ORG"], [5082, 5087, "OTHER_PERSON"], [5165, 5170, "OTHER_PERSON"], [5199, 5202, "ORG"], [5284, 5289, "OTHER_PERSON"], [5373, 5376, "ORG"], [5449, 5461, "DATE"], [5671, 5674, "COURT"], [5935, 5947, "DATE"], [5952, 5957, "OTHER_PERSON"], [6161, 6164, "ORG"], [6221, 6224, "ORG"], [6489, 6492, "OTHER_PERSON"], [6728, 6731, "COURT"], [7275, 7280, "OTHER_PERSON"], [7460, 7463, "OTHER_PERSON"], [7515, 7520, "OTHER_PERSON"], [7955, 7960, "OTHER_PERSON"], [8189, 8192, "ORG"], [8338, 8343, "OTHER_PERSON"], [8941, 8944, "COURT"], [9062, 9065, "COURT"], [9309, 9312, "ORG"], [9490, 9493, "ORG"], [9673, 9676, "ORG"], [9764, 9776, "RESPONDENT"], [9850, 9859, "GPE"], [9882, 9885, "ORG"], [9946, 9959, "OTHER_PERSON"], [9973, 9989, "OTHER_PERSON"], [10062, 10066, "OTHER_PERSON"], [10071, 10075, "OTHER_PERSON"], [10164, 10176, "DATE"], [10182, 10185, "ORG"], [10324, 10327, "ORG"], [10377, 10389, "DATE"], [10438, 10465, "ORG"], [10492, 10496, "ORG"], [10534, 10538, "OTHER_PERSON"], [10540, 10544, "OTHER_PERSON"], [10563, 10574, "OTHER_PERSON"], [10623, 10630, "GPE"], [10717, 10739, "ORG"], [10778, 10781, "ORG"], [10834, 10838, "ORG"], [10864, 10877, "RESPONDENT"], [11060, 11072, "DATE"], [11097, 11126, "ORG"], [11130, 11143, "OTHER_PERSON"], [11376, 11388, "RESPONDENT"], [11425, 11428, "ORG"], [11604, 11608, "GPE"], [11614, 11618, "ORG"], [11652, 11656, "ORG"], [11767, 11771, "ORG"], [11915, 11931, "DATE"], [12160, 12163, "ORG"], [12181, 12194, "STATUTE"], [12279, 12282, "ORG"], [12291, 12294, "ORG"], [12340, 12344, "ORG"], [12353, 12368, "DATE"], [12370, 12374, "ORG"], [12384, 12387, "ORG"], [12454, 12464, "OTHER_PERSON"], [12473, 12486, "OTHER_PERSON"], [12520, 12528, "OTHER_PERSON"], [12532, 12535, "ORG"], [12540, 12543, "ORG"], [12580, 12584, "ORG"], [12613, 12617, "ORG"], [12684, 12692, "OTHER_PERSON"], [12719, 12723, "ORG"], [12966, 12969, "ORG"], [13119, 13122, "ORG"], [13314, 13317, "ORG"], [13358, 13368, "ORG"], [13469, 13472, "ORG"], [13505, 13509, "ORG"], [13630, 13633, "ORG"], [13698, 13702, "ORG"], [13738, 13753, "DATE"], [13755, 13759, "ORG"], [13920, 13923, "ORG"], [14214, 14217, "ORG"], [14282, 14285, "ORG"], [14458, 14461, "ORG"], [14515, 14518, "ORG"], [14645, 14658, "OTHER_PERSON"], [14875, 14878, "ORG"], [14923, 14936, "RESPONDENT"], [14958, 14961, "ORG"], [14967, 14971, "OTHER_PERSON"], [15043, 15047, "OTHER_PERSON"], [15105, 15109, "OTHER_PERSON"], [15159, 15162, "ORG"], [15295, 15298, "ORG"], [15360, 15364, "OTHER_PERSON"], [15597, 15600, "ORG"], [15691, 15695, "OTHER_PERSON"], [15803, 15807, "OTHER_PERSON"], [15852, 15881, "ORG"], [15928, 15931, "ORG"], [15949, 15962, "OTHER_PERSON"], [16056, 16059, "ORG"], [16096, 16100, "ORG"], [16124, 16127, "ORG"], [16238, 16275, "ORG"], [16280, 16294, "ORG"], [16326, 16329, "ORG"], [16350, 16353, "ORG"], [16403, 16407, "ORG"], [16463, 16466, "ORG"], [16722, 16726, "ORG"], [16789, 16793, "ORG"], [16863, 16867, "ORG"], [17004, 17007, "ORG"], [17022, 17026, "ORG"], [17042, 17045, "OTHER_PERSON"], [17063, 17076, "OTHER_PERSON"], [17130, 17133, "ORG"], [17148, 17152, "ORG"], [17168, 17171, "OTHER_PERSON"], [17217, 17220, "ORG"], [17313, 17316, "OTHER_PERSON"], [17359, 17362, "ORG"], [17377, 17381, "ORG"], [17397, 17402, "OTHER_PERSON"], [17471, 17474, "ORG"], [17683, 17686, "OTHER_PERSON"], [17707, 17720, "OTHER_PERSON"], [17783, 17786, "ORG"], [17946, 17950, "ORG"], [18111, 18114, "ORG"], [18143, 18147, "ORG"], [18178, 18181, "ORG"], [18330, 18333, "ORG"], [18430, 18433, "ORG"], [18736, 18739, "ORG"], [18805, 18808, "ORG"], [18912, 18915, "ORG"], [19056, 19059, "ORG"], [19089, 19093, "ORG"], [19133, 19136, "OTHER_PERSON"], [19147, 19150, "ORG"], [19160, 19164, "OTHER_PERSON"], [19179, 19183, "OTHER_PERSON"], [19205, 19209, "ORG"], [19352, 19355, "ORG"], [19411, 19414, "ORG"], [19425, 19429, "ORG"], [19507, 19511, "OTHER_PERSON"], [19519, 19522, "ORG"], [19546, 19549, "ORG"], [19756, 19759, "ORG"], [19849, 19852, "ORG"], [19935, 19938, "ORG"], [20072, 20075, "ORG"], [20247, 20250, "ORG"], [20315, 20328, "OTHER_PERSON"], [20390, 20393, "ORG"], [20416, 20419, "OTHER_PERSON"], [20440, 20453, "OTHER_PERSON"], [20483, 20498, "ORG"], [20503, 20506, "OTHER_PERSON"], [20530, 20560, "ORG"], [20572, 20585, "OTHER_PERSON"], [20597, 20600, "OTHER_PERSON"], [20651, 20688, "ORG"], [20775, 20778, "OTHER_PERSON"], [20827, 20830, "OTHER_PERSON"], [21194, 21197, "ORG"], [21236, 21239, "OTHER_PERSON"], [21393, 21404, "OTHER_PERSON"], [21744, 21753, "PROVISION"], [21757, 21760, "STATUTE"], [21805, 21816, "OTHER_PERSON"], [21878, 21887, "PROVISION"], [22067, 22070, "OTHER_PERSON"], [22116, 22210, "PRECEDENT"], [22296, 22305, "JUDGE"], [22377, 22383, "JUDGE"], [22390, 22481, "PRECEDENT"], [22483, 22489, "JUDGE"], [23776, 23784, "OTHER_PERSON"], [24103, 24110, "OTHER_PERSON"], [24436, 24441, "JUDGE"], [25168, 25173, "OTHER_PERSON"], [25177, 25226, "PRECEDENT"], [25384, 25389, "OTHER_PERSON"], [25698, 25704, "JUDGE"], [26088, 26091, "OTHER_PERSON"], [26108, 26159, "PRECEDENT"], [26184, 26197, "JUDGE"], [26349, 26352, "JUDGE"], [26365, 26436, "PRECEDENT"], [26441, 26517, "PRECEDENT"], [26945, 26951, "JUDGE"], [27073, 27076, "OTHER_PERSON"], [27300, 27303, "ORG"], [27579, 27582, "ORG"], [27596, 27600, "OTHER_PERSON"], [27613, 27626, "OTHER_PERSON"], [27642, 27646, "OTHER_PERSON"], [27650, 27653, "ORG"], [27681, 27684, "ORG"], [27711, 27715, "ORG"], [27799, 27803, "ORG"], [27849, 27853, "ORG"], [27981, 27986, "OTHER_PERSON"], [28005, 28008, "ORG"], [28219, 28222, "ORG"], [28316, 28321, "OTHER_PERSON"], [28588, 28593, "OTHER_PERSON"], [28628, 28641, "JUDGE"], [28662, 28730, "PRECEDENT"], [28737, 28741, "JUDGE"], [28784, 28805, "PRECEDENT"], [29253, 29257, "PROVISION"], [30902, 30906, "PROVISION"], [31334, 31338, "JUDGE"], [31380, 31389, "OTHER_PERSON"], [32004, 32016, "ORG"], [32474, 32478, "JUDGE"], [33192, 33215, "ORG"]]}
