{"text": "\n\nIN THE GENERAL DIVISION OF THE HIGH COURT OF THE REPUBLIC OF SINGAPORE\n[2022] SGHC 230\n\nOriginating Summons No 784 of 2021 (Summons No 4487 of 2021)\nBetween\nLJH Construction & Engineering Co Pte Ltd\n... Plaintiff\nAnd\nGracie Chan Bee Cheng\n... Defendant\nJUDGMENT\n\n[Building and Construction Law -- Dispute resolution -- Setting aside adjudication determination on ground of invalid service of payment claim]\n[Building and Construction Law -- Dispute resolution -- Setting aside adjudication determination on ground of fraud]\n[Building and Construction Law -- Dispute resolution -- Setting aside adjudication determination on ground of adjudicator's failure to recognise patent errors]\n[Building and Construction Law -- Dispute resolution -- Setting aside adjudication determination on ground of breach of natural justice]\n[Building and Construction Law -- Dispute resolution -- Severance of adjudication determination]\n[Building and Construction Law -- Statutes and regulations -- Relationship between section 29B(4) of the Building Control Act 1989 (2020 Rev Ed) and the Building and Construction Industry Security of Payment Act 2004 (2020 Rev Ed)]\nLJH Construction & Engineering Co Pte Ltd\nv\nChan Bee Cheng Gracie\n[2022] SGHC 230\n\nGeneral Division of the High Court -- Originating Summons No 784 of 2021 (Summons No 4487 of 2021)\nAng Cheng Hock J\n7 July, 16, 25 August 2022\n20 September 2022 Judgment reserved.\nAng Cheng Hock J:\nIntroduction\n\n1 It cannot be gainsaid that payment and cash form the life blood of the construction industry. To that end, the Building and Construction Industry Security of Payment Act 2004 (2020 Rev Ed) (the \"SOPA\") provides a mechanism for the quick and efficient resolution of payment claim disputes in order to facilitate cash flow.\n2 Be that as it may, the need for expedience in the resolution of construction disputes cannot supersede the need for probity on the part of litigants, or the need for propriety on the part of adjudicators. Parties seeking to rely on the SOPA to obtain remuneration must do so with due honesty. Likewise, in adjudicating disputes under the SOPA, adjudicators must adhere to minimum standards of procedural fairness. It is for this reason that where an adjudication determination has been obtained under improper circumstances which have prejudiced the respondent, it may be liable to be set aside.\n3 The present case is one where the adjudication determination, and the proceedings culminating in it, are alleged to be vitiated by: (a) invalid service of the payment claim; (b) fraud; (c) the adjudicator's failure to detect patent errors in relation to the claim; and (d) breaches of the rules of natural justice. It also raises an interesting question pertaining to the relationship between the SOPA and the Building Control Act 1989 (2020 Rev Ed) (the \"BCA\").\n4 At the outset, I note that the HC/SUM 4487/2021 (\"SUM 4487\") was filed on 27 September 2021, while the Adjudication Determination was issued on 18 April 2021, when the Building and Construction Industry Security of Payment Act (Cap 30B, 2006 Rev Ed) (the \"2006 SOPA\") was in still in force. That piece of legislation was replaced by the SOPA which came into force on 31 December 2021. However, s 4(1) of the SOPA provides that the SOPA applies to any contract that is made in writing on or after 1 April 2015. Moreover, there are no substantive differences between the relevant provisions of the SOPA currently in force and the 2006 SOPA. I will therefore refer to the provisions of the SOPA in this judgment.\nBackground\nThe Parties\n\n5 The plaintiff, LJH Construction & Engineering Co Pte Ltd (\"LJH\") is a renovation contractor incorporated in Singapore in October 2008. The General Manager of LJH is one Li Dan, (\"Mr Li\"). The defendant, Gracie Chan Bee Cheng, is the owner of 4 Dalkeith Road (the \"Property\"). She was 81 years old at the time of her first affidavit. As the defendant has referred to herself as Gracie Wee Bee Cheng in her affidavits, I will refer to her as \"Mdm Wee\" in this judgment.\n6 In 2015, Mdm Wee engaged LJH as the main contractor of a project to construct a two-story detached dwelling house at 4 Dalkeith Road (the \"Project\"). By a letter dated 23 February 2015, Mdm Wee's architects, Lua Architects Associates Pte Ltd (\"Lua Architects\"), accepted an offer by LJH to carry out the project on Mdm Wee's behalf (the \"Letter of Acceptance\"). The acceptance was subject to, among others, the following conditions:\n(a) The Contract Sum was $2,059,940, which included $580,000 for prime cost and provisional sums (clause 2.1) but excluded any Goods and Services Tax (\"GST\") chargeable by the Comptroller of GST under the Goods and Services Tax Act (Cap 117A, 2005 Rev Ed) (clause 2.2).\n(b) The Project was to be completed within ten calendar months from the contract commencement date (clause 4.1), whereby the contract commencement date would be the date of issue of the \"Permit to Carry Out Demolition Works\" by the Building and Construction Authority or \"30 days from the date of Possession of Site\", whichever was earlier (clause 3.2).\n(c) The Singapore Institute of Architects, Articles and Conditions of Building Contract (Lump Sum Contract, 9th Ed, Re-Print August 2011) (the \"SIA Conditions\") was \"the Form of Contract used\" (clause 5.1).\n(d) LJH was entitled to progress payments based on a monthly periodical valuation of the works (clause 6.1). The progress payments were \"subject to 10% retention for value of work done and 20% for properly protected unfixed materials and goods delivered to the Site, but subject to a Limit of Retention equivalent to 5% of [the] Contract Sum\" (clause 6.2).\n7 The Letter of Acceptance was signed by one Lim Hwee Meng (\"Mr Lim\"), who was then a director of LJH, on behalf of the company. I shall hereafter refer to the terms and conditions mutually agreed upon by the parties as the \"Contract\".\nThe construction of the Project\n\n8 Work commenced at the site but progressed slowly. The house was still not completed after ten months had elapsed from the commencement date of 23 March 2015. Mdm Wee says that Mr Lim informed her in 2016 that LJH \"did not have any workers and resources to complete the works\". This is not challenged by LJH. Mdm Wee and LJH agreed that she should make payment directly to LJH's subcontractor, one Dong Cheng Construction Pte Ltd (\"Dong Cheng\"), who would complete the Project. This is evidenced by a letter dated 5 May 2016 sent by Mr Lim (on behalf of LJH) to Mdm Wee, wherein Mr Lim confirmed that: (i) the parties agreed for Mdm Wee to make payments directly to Dong Cheng for \"all sums due on Interim Payment Valuation Certificate No. 13 onwards\"; (ii) Dong Cheng had been authorised and instructed to complete the construction works on the Property on LJH's behalf and to receive all payments for the works carried out; and (iii) LJH had \"received all sums due from [Mdm Wee] in respect of the construction works carried out on [the Property] and ... [had] no further claim (excluding Variations) against [Mdm Wee]\". Based on that agreement, Mdm Wee made payments in respect of Payment Certificate No 13 amounting to $75,414.62 (inclusive of GST) and Payment Certificate No 14 amounting to $32,662.38 (inclusive of GST) directly to Dong Cheng.\n9 Mdm Wee's evidence is that, despite making the payments in respect of Payment Certificates No 13 and No 14, no further works were done in respect of the Project. Eventually, Mdm Wee had to engage other contractors to carry out works to complete the Project. In particular, Mdm Wee engaged one Yong Chow Construction Pte Ltd (\"Yong Chow\") and made payments to Yong Chow directly. This is largely consistent with LJH's evidence that it had substantially completed two out of three sections of works under the Contract by late 2016 or early 2017, and that Mdm Wee only engaged Yong Chow sometime in or around February 2017.\n10 However, LJH disputes Mdm Wee's evidence that LJH had stopped all works on the Property after 2016. In his affidavit, Mr Li claimed that LJH and Dong Cheng continued to remain on the site of the Project and carried out various works, and that it would not have been possible for the Temporary Occupation Permit (the \"TOP\") to be obtained on 22 May 2019 if LJH and Dong Cheng had stopped all works in late 2016. In particular, Mr Li stated that, in December 2017, Lua Architects informed LJH that the existing tempered glass roof for the Property's car porch was not approved by the Building Construction Authority, and asked LJH to collect revised car porch drawings from them. Subsequently, over a few months in 2018, LJH carried out works to dismantle the tempered glass roof and to install a metal roof. Mdm Wee disputes this - she says that the metal car porch roof was constructed by one Builders Alliance Pte Ltd (\"Builders Alliance\"), and not LJH.\n11 Mdm Wee claims that, in 2019, AXA Insurance (\"AXA\") inquired with her whether she had any claims to make on a performance bond (which LJH had procured pursuant to clause 7.5 of the Letter of Acceptance). She informed AXA of her desire to claim liquidated damages for the delay in the completion of the Project. Shortly after that, Mr Lua Kok Leong (\"Mr Lua\") of Lua Architects arranged for Mdm Wee to meet with Mr Li and one Jason Lum (\"Mr Lum\") of LJH. Mdm Wee's evidence is that:\n(a) during the meeting, Mdm Wee asked Mr Li to complete specified works in relation to the Project, which included the rectification of certain defects;\n(b) Mr Li and Mr Lum assured Mdm Wee that, if she did not call on the performance bond, LJH would complete the specified works and assist Mdm Wee in obtaining the TOP for the Property; and\n(c) although Mdm Wee acceded to their request not to call on the performance bond, neither LJH nor Dong Cheng carried out any of the specified works thereafter.\n12 In this regard, Mr Li's evidence is that, sometime in 2019, when he learnt that the TOP could not be obtained because Mdm Wee had not paid the Professional Engineer for certain external cladding works, he offered to pay (and did pay) for the cladding works on a goodwill basis to expedite obtaining the TOP (even though the cladding works did not fall within LJH's scope of work under the Contract). These works were allegedly completed by 18 April 2019. This is disputed by Mdm Wee, who says that the cladding works fell within LJH's scope of works under the Contract, and that LJH was responsible for making payment to the Professional Engineer for the cladding works.\n13 On 7 June 2019, some two weeks after the issuance of the TOP, Lua Architects wrote to LJH by email with a list of outstanding defective works which needed to be completed. LJH does not dispute that it did not rectify the allegedly defective works.\nPayment claim 21 and the adjudication proceedings\n\n14 Almost two years later, on 30 April 2021, LJH sent an email containing Payment Claim No 21 (\"PC 21\") to Lua Architects' email address (luaarch@singnet.com.sg), with Mdm Wee copied in the email via two email addresses: gw.bc@hotmail.com and gw.bc@gmail.com. In PC 21, LJH made a claim for a sum of $686,380.21 with the following breakdown:\n(a) LJH claimed $1,479,940.26 in respect of the works under the Contract (the \"Contract Sum\") which comprised:\n(i) $108,550 claimed in respect of \"Section I General & Preliminaries\" which pertained to preliminary items such as the erection of temporary works, pre-construction survey, mobilisation costs, etc (the \"Section I Works\");\n(ii) $1,344,390.26 claimed in respect of \"Section II Builder's and Other Works\" which pertained to the demolition of the existing building, piling and construction of the structural works, the architectural and external works, and the mechanical and electrical works (the \"Section II Works\"); and\n(iii) $27,000 claimed in respect of \"Section III Provisional Sum (Include [Profit and Attendance])\" which pertained mainly to interior design works (the \"Provisional Sum Works\").\n(b) LJH claimed $136,217.90 in respect of works done for variation orders (the \"Variation Works\").\n(c) LJH deducted $929,777.95 from the total amount purportedly on account of:\n(i) payments previously made by Mdm Wee; and\n(ii) a retention sum of $102,997.00 (the \"Retention Sum\").\n15 Mdm Wee failed to issue a payment response within 21 days from the date when PC 21 was emailed to Mdm Wee (as mandated by clause 31.(15)(a) of the SIA Conditions, if the emails are regarded as proper service on her). On 3 June 2021, LJH thus proceeded to send a \"Notice of Intention to Apply for Adjudication\" to Mdm Wee via her two email addresses. LJH also lodged an adjudication application on 3 June 2021, SOP/AA141 of 2021, against Mdm Wee for the sum of $686,380.21 claimed in PC 21 (the \"Adjudication Application\"). The Singapore Mediation Centre (\"SMC\") then sent the Adjudication Application on Mdm Wee on 4 June 2021 by email via the two same email addresses. In this regard, I note that, by an email dated 16 June 2021, the adjudicator appointed by the SMC (the \"Adjudicator\") asked Mdm Wee's former solicitors, Lee & Lee, to indicate if Mdm Wee had received (i) SMC's email dated 4 June 2021 attaching the Adjudication Application; and (ii) SMC's email dated 8 June 2021 notifying Mdm Wee of the Adjudicator's appointment. On the same day, Lee & Lee responded to confirm that Mdm Wee did receive both of SMC's emails at her email address, gw.bc@hotmail.com.\n16 Mdm Wee did not lodge an adjudication response after receipt of the Adjudication Application within seven days of the email from the SMC of 4 June 2021, as required under s 15(1) of the SOPA (if she is regarded as having received that email). Mdm Wee's evidence is that an employee of Lua Architects sent her a text message on 14 June 2021 informing her that Mr Lua had received an email from an adjudicator, and that Mr Lua wished to meet her on 15 June 2021. Mdm Wee says that it was only during the meeting on 15 June 2021 that she learnt of the adjudication proceedings, following which she engaged solicitors to act for her. While LJH does not dispute Mdm Wee's evidence that she did not know about the adjudication proceedings until 15 June 2021, it contends that PC 21 was properly served on Mdm Wee by email on 30 April 2021. I emphasise at this juncture that the question of when Mdm Wee subjectively learnt of the adjudication proceedings (including the emails to her, and contents of PC 21 and the Adjudication Application) is distinct from the question of whether PC 21 was validly served on her in accordance with the provisions of the SOPA.\n17 On 16 June 2021, Lee & Lee wrote to the Adjudicator contending that PC 21 was not served on Mdm Wee. On the same day, they also wrote to LJH requesting a copy of the Adjudication Application.\n18 On 18 June 2021, the Adjudicator rendered his decision in SOP/AA141 of 2021 (the \"Adjudication Determination\"), finding in favour of LJH and awarding $694,696.76 (inclusive of GST) to LJH (the \"Adjudicated Amount\"). A breakdown of LJH's various claims and the Adjudicator's decision in relation to each claim is set out in the table below:\nS/N\nWork Item\nLJH's Claim\nAdjudicator's award\n\n1\nSection I Works\n$108,550\n$108,550\n2\nSection II Works\n$1,344,390.26\n$1,344,390.26\n3\nProvisional Sum Works\n$27,000\n$27,000\n4\nVariation Works\n$136,217.90\n$99,087\n5\nDeductions of payments previously made by Mdm Wee and the Retention Sum\n$929,777.95\n$929,777.95\nTotal\n$686,380.21\n$649.249.31\n($694,696.76 with 7% GST)\nProcedural history\n\n19 On 5 August 2021, LJH filed HC/OS 784/2021 seeking leave to enforce the Adjudication Determination in the same manner as a judgment or an order of the court pursuant to s 27 of the SOPA.\n20 On 27 September 2021, Mdm Wee filed the present summons applying to set aside the Adjudication Determination. Mdm Wee also filed HC/SUM 881/2022 on 8 March 2022 (\"SUM 881\"), which is an application for a stay of enforcement of the Adjudication Determination pending the final determination of all disputes between the parties at arbitration. Mdm Wee commenced arbitration proceedings on 15 February 2022, pursuant to the parties' agreement to refer disputes to arbitration under clause 37.(1)(a) of the SIA Conditions (which are incorporated into the Contract by virtue of Clause 5.1 of the Contract (see [6(c)] above)). As there would be no need for a stay of enforcement of the Adjudication Determination should it be set aside, I adjourned the hearing of the SUM 881 pending the resolution of the present Summons.\nThe parties' cases and issues\nMdm Wee's case\n\n21 Mdm Wee contends that the Adjudication Determination should be set aside on the following grounds:\n(a) First, she argues that the Adjudication Determination is tainted by fraud, and the portions affected by fraud cannot be severed from the rest of the decision as they are not de minimis.\n(b) Second, she submits that there were patent errors in PC 21, specifically in relation to LJH's claims for (i) alleged Variation Works on the Property; and (ii) the release of the Retention Sum, and that the Adjudicator's failure to recognise these errors constituted a breach of his duties under the SOPA.\n(c) Third, she submits that the rules of natural justice, specifically the fair hearing rule and no bias rule, have been breached in the course of the adjudication proceedings.\n(d) Fourth, she contends that PC 21, which formed the subject matter of the Adjudication Determination, was not properly served on her.\n22 Mdm Wee also argues that LJH should not be allowed enforce the Adjudication Determination in court as it does not possess the requisite licence under the BCA, and is thus prohibited by s 29B(4) of the BCA from recovering money through any court proceedings. Section 29B(4) of the BCA provides:\nProhibition against unlicensed builders\n...\n(4) ... a person who carries out any general building works or specialist building works in contravention of [s 29B(2)] is not entitled to recover in any court any charge, fee or remuneration for the general building works or specialist building works so carried out.\n23 Specifically, Mdm Wee alleges that there has been a contravention of s 29B(2)(a) of the BCA which provides that a person must not \"carry on the business of a general builder in Singapore unless the person is in possession of a general builder's licence\".\nLJH's case\n\n24 LJH makes the following submissions:\n(a) The Adjudication Determination was not tainted by fraud because no fraudulent representations were made by LJH, and even if there were, they were not material to the Adjudication Determination.\n(b) The absence of sufficient evidence behind the Adjudicator's decision to allow LJH's claim for the Variation Works does not constitute a patent error. Moreover, although the Adjudicator did not decide to release the Retention Sum, but had awarded to LJH an amount which included the Retention Sum, Mdm Wee could have raised her objections earlier, but failed to do so.\n(c) Even if the court finds that the Adjudication Determination is affected by fraud and/or patent errors, the impugned parts of the Adjudication Determination are de minimis and can be severed from the unobjectionable parts.\n(d) There were no breaches of the rules of natural justice. There was no suggestion of any bias on the Adjudicator's part, nor was Mdm Wee deprived of an opportunity to be heard in the proceedings before the Adjudicator.\n(e) PC 21 was validly served on Mdm Wee by email on her email addresses, gw.bc@hotmail.com and gw.bc@gmail.com. In particular, gw.bc@hotmail.com was an email address that had been copied in email correspondence pertaining to the Project, and there was thus evidence suggesting that Mdm Wee could retrieve and receive emails at that email address.\n(f) There was no contravention of s 29B(2) of the BCA as LJH was in possession of the requisite builder's licence at the time when it was carrying out construction works, and LJH is thus not barred by s 29B(4) of the BCA from recovering money under the SOPA.\n25 I will elaborate on the submissions of both parties in the course of my analysis.\nIssues\n\n26 The first issue is whether PC 21 was properly served on Mdm Wee by email on 30 April 2021, and relatedly, if PC 21 was not properly served on Mdm Wee, whether the Adjudicator was deprived of jurisdiction to adjudicate LJH's Adjudication Application under the SOPA.\n27 Assuming that PC 21 was properly served on Mdm Wee, and the Adjudicator had jurisdiction to adjudicate LJH's Adjudication Application, the following three issues then arise for my determination:\n(a) whether the Adjudication Determination should be set aside because it is tainted by fraud;\n(b) whether the Adjudication Determination should be set aside because the Adjudicator failed to recognise patent errors; and\n(c) the related issue of whether the parts of the Adjudication Determination impugned by fraud or patent errors (should I find that there are any) may be severed from the rest of the Adjudication Determination, or whether the Adjudication Determination should be set aside entirely.\n28 The next issue is whether the Adjudication Determination should be set aside for breaches of the rules of natural justice.\n29 The final issue is whether the leave granted to LJH to enforce the Adjudication Determination under the SOPA should be set aside because LJH did not have the requisite builder's licence under the BCA at the time the works were carried out.\nIssue 1: Whether PC 21 was validly served on Mdm Wee\n\n30 I deal first with the issue of whether PC 21 was validly served on Mdm Wee. In this regard, s 27(6)(a) of the SOPA provides that a party to an adjudication may commence proceedings to set aside an adjudication determination on the ground that the payment claim was not served in accordance with s 10 of the SOPA.\nPrinciples applicable to service of documents\n\n31 I begin by setting out the provisions governing LJH's right to make an adjudication application. Section 10(1)(a) of the SOPA provides that a claimant may serve one payment claim in respect of a progress payment on a person who is liable to make payment under the contract concerned.\n32 Section 11(1) of the SOPA in turn provides that:\nPayment responses, etc.\n11.--(1) A respondent named in a payment claim served in relation to a construction contract must respond to the payment claim by providing, or causing to be provided, a payment response to the claimant --\n(a) by the date as specified in or determined in accordance with the terms of the construction contract, or within 21 days after the payment claim is served under section 10, whichever is the earlier; or\n(b) where the construction contract does not contain such provision, within 14 days after the payment claim is served under section 10.\n33 Under s 12(2) of the SOPA, a claimant would be entitled to make an adjudication application under s 13 of the SOPA in relation to the relevant payment claim where either (i) any dispute as to the amount claimed is not settled, or (ii) the respondent does not provide the payment response, by the end of the dispute settlement period (which is defined under s 12(6) of the SOPA as \"the period of 7 days after the date on which or the period within which the payment response is required to be provided under section 11(1)\").\n34 Section 13(1) of the SOPA states that \"[a] claimant who is entitled to make an adjudication application under section 12 may ... apply for the adjudication of a payment claim dispute by lodging the adjudication application with an authorised nominating body\" [emphasis added].\n35 Finally, s 14(1) of the SOPA, which governs the appointment of an adjudicator, provides that the authorised nominating body must, upon receiving an adjudication application, refer the adjudication application to a person who is on the register of adjudicators established under s 28(4)(a) of the SOPA and whom the authorised nominating body considers to be appropriate for appointment as the adjudicator to determine the adjudication application.\n36 Sections 11(1) and 12(2) of the SOPA presuppose that there has been valid and proper service of a payment claim under s 10 of the SOPA. In other words, where there has not been valid and proper service of a payment claim, the time for making a payment response under s 11(1) of the SOPA would not begin to run, and a claimant would not be entitled to make an adjudication application under s 13 of the SOPA. It also follows that the appointment of an adjudicator under s 14(1) of the SOPA pursuant to such an adjudication application would be invalid. As the Court of Appeal observed in Lee Wee Lick Terence (alias Li Weili Terence) v Chua Say Eng (formerly trading as Weng Fatt Construction Engineering) and another appeal [2013] 1 SLR 401 (\"Terence Lee\") at [66]:\n... If there is no ... service of a payment claim, the appointment of an adjudicator will be invalid, and the resulting adjudication determination would be null and void.\n37 However, whether the appointment of an adjudicator is invalid by virtue of improper service depends on the nature of the impropriety. The Court of Appeal in Terence Lee drew a distinction between the situations where (i) a payment claim is in fact served but did not comply with all the requirements of the SOPA; and (ii) a payment claim is not served. It was observed at [30]-[32]:\n30 ... If there is no payment claim or if a payment claim is not served on the respondent, then the power of the [authorised nominating body] to nominate an adjudicator would not have arisen, and an appointment made in such circumstances would not be valid. The power of nomination under s 14(1) of the Act is predicated on the existence of a payment claim and the service thereof on the respondent. An acceptance of an invalid nomination would not clothe the acceptor with the office of adjudicator. It is in this sense that an adjudicator appointed in such circumstances is said to have no jurisdiction in the matter because he has not been validly appointed under the Act. ...\n31 ... The distinction between Lee J's proposition in Sungdo and that of Prakash J in Chip Hup Hup Kee is that the former proposition was made in relation to a payment claim which was in form a payment claim but not intended to be such, and therefore did not have the effect of a payment claim, and the latter proposition was made in relation to a payment claim which was in form a payment claim and was intended to be such, but which did not satisfy all the requirements of the Act. In the first situation, a payment claim has not come into operation as a payment claim. In the second situation, a payment claim operates as a payment claim but it is defective for non-compliance with the requirements of the Act. The first situation goes to the validity of the appointment of the adjudicator. The second situation goes to the validity of the adjudication determination.\n32 The same reasoning can be applied to the service or non-service of a payment claim that complies with the requirements of the Act. If a payment claim is not served on the respondent, the claimant will not receive payment or a response from the respondent, and such an omission cannot be the basis of a valid request by the claimant for the appointment of an adjudicator. Any appointment of the adjudicator made on that basis would be invalid. However, if the payment claim is served on the respondent by a mode of service which reaches the respondent, but which does not comply with the agreed or applicable mode of service, it should not affect the validity of the appointment of the adjudicator. An adjudicator may still be appointed, but he may reject a payment claim which has not been properly served on the respondent, especially when the respondent has been prejudiced.\n[emphasis added]\n38 The following propositions may be gleaned from the authorities:\n(a) Where a payment claim is either (i) not intended as a payment claim; or (ii) not served on the respondent, the appointment of an adjudicator on the basis of that payment claim would be invalid.\n(b) However, where a payment claim is intended as a payment claim and in fact reaches the respondent through service, but the mode of service does not comply with the agreed or applicable mode of service, it does not affect the validity of the adjudicator's appointment.\nWhat does valid service of a payment claim by email entail?\n\n39 In the present case, Mdm Wee cites Progressive Builders Pte Ltd v Long Rise Pte Ltd [2015] 5 SLR 689 (\"Progressive Builders\") for the proposition that valid service of a payment claim requires it to be brought to the attention of the addressee. Therefore, should LJH elect to effect service of PC 21 by email, Mdm Wee argues that the email address to which PC 21 is sent must be one which LJH knows is operated by Mdm Wee. However, there was no evidence that she had operated the email account(s) to which PC 21 was sent. Mdm Wee further contends that service of PC 21 was improper because:\n(a) LJH had never previously served any payment claims to Mdm Wee by email;\n(b) Mdm Wee had never given her email address to LJH, nor had she ever used her email to communicate or respond to any project matters;\n(c) the email was sent in a deceptive manner because it was addressed to the architect and not Mdm Wee (who was only copied) and the sender of the email appeared as \"Sweethome\" in Mdm Wee's email inbox;\n(d) LJH knew Mdm Wee resided at 16A Jervois Lane and could have served PC 21 physically on her at her address but chose to surreptitiously serve PC 21 by email instead; and\n(e) LJH had earlier confirmed by letter that it had received all sums due from Mdm Wee for the construction works and that payments for the balance works completed by Dong Cheng would be paid to Dong Cheng directly, and thus, she was not expecting to receive any further payment claims from LJH.\n40 LJH, however, argues that its service of PC 21 on Mdm Wee by email was proper and in accordance with the provisions of the SOPA. To that end, LJH claims that there is evidence to show that Mdm Wee had received other adjudication documents at her email address, gw.bc@hotmail.com. Moreover, that email address had also been copied on correspondences relating to the Project. I should add that LJH made no submissions regarding the validity of the service of PC 21 on the email address gw.bc@gmail.com.\n41 The central question that arises here is what is required of a party who wishes to effect service of a payment claim by email. In this regard, s 37 of the SOPA provides:\nService of documents\n37.--(1) Where this Act authorises or requires a document to be served on a person, whether the expression \"serve\", \"lodge\", \"provide\" or \"submit\" or any other expression is used, the document must be served on the person --\n...\n(d) by sending it by email to the person's email address; or\n(e) by sending it by any other electronic method authorised by regulations made under section 41(1) for the service of documents of that kind if the person consents to service of a document of that kind in that way.\n...\n(2) Service of a document on a person under this section takes effect --\n...\n(b) if the document is sent by email -- at the time that the email becomes capable of being retrieved by the person;\n...\n(3) In this section, \"email address\" means --\n(a) the last email address given by the addressee concerned to the person serving the document as the email address for the service of documents; or\n(b) the last email address of the addressee concerned known to the person serving the document.\n...\n42 It is clear from s 37(1)(d) of the SOPA that a payment claim may be served on a respondent by email. Section 37(3) of the SOPA further provides that, for documents to be served by email, they must be sent either to the last email address given by the addressee to the sender (s 37(3)(a)), or the last email address of the addressee concerned known to the person serving the document (s 37(3)(b)). In this case, s 37(3)(a) of the SOPA is inapplicable since Mdm Wee never gave her email address to LJH for the service of documents. That much is accepted by LJH. Rather, the issue is whether the \"the last email address of the addressee ... known to the [sender]\" contemplated in s 37(3)(b) of the SOPA must be one which the sender has reason to believe that the addressee uses and/or checks regularly, such that emails sent to that email address will be, or are likely to be, brought reasonably promptly to the attention of the addressee.\n43 In Progressive Builders, the defendant, the contractor of the plaintiff, sent a progress claim to the plaintiff by email. In finding that the service of payment claims by email was valid, Lee Seiu Kin J (\"Lee J\") observed that the legislative purpose of s 37 of the SOPA was \"to assist parties in bringing notices and documents required under the [SOPA], not to shut out other modes of service\" (Progressive Builders at [39]). However, Lee J further observed that \"[i]n view of the strict timelines imposed by the SOPA and the serious consequences flowing from a failure to comply with the timelines ... the party alleging good service bears the onus of proving to the court's satisfaction that the document had indeed been brought to the attention of the other party and, where time is relevant, the date on which this was achieved\" [emphasis added] (Progressive Builders at [40]).\n44 Progressive Builders was decided in the context of the SOPA in force prior to the amendments introduced by the Building and Construction Industry Security of Payment (Amendment) Act 2018 (Act No 47/2018) (the \"SOP Amendment Act\"). It bears noting that the earlier version of s 37 permissively provided that service may be effected by several methods, which did not include service by email. Conversely, the present s 37 specifically provides that documents must be served by one of five methods, of which service by email is one of them.\n45 However, there is nothing in the secondary legislative material to suggest that Parliament, by the legislative amendments to s 37, intended to amend the statute in a manner that is inconsistent with Lee J's observations in Progressive Builders about how payment claims should be served in a manner which brings them to the attention of the respondent. The Explanatory Statement in the Building and Construction Industry Security of Payment (Amendment) Bill (Bill No 38/2018) states at page 33 that clause 23 of the SOP Amendment Act amends s 37(1) of the SOPA to: (i) clarify that the modes of service prescribed in that section are mandatory; and (ii) to enable documents to be served on a person by email, or by any other electronic method authorised by regulations made under s 41(1) of the SOPA for the service of documents of that kind if the person consents to service of a document of that kind in that way. It further states that clause 23 also deletes and substitutes s 37(2) of the SOPA to provide for service of documents by email, whereby service takes effect at the time the email transmitting the document becomes capable of being retrieved by the recipient. Indeed, regardless of whether the SOPA permissively or mandatorily prescribes the acceptable modes of service, it stands to reason that for service of a document to be valid, the document must be served in a manner sufficient or likely to bring it reasonably promptly to the attention of the addressee.\n46 The SOPA imposes strict timelines and serious consequences in relation to payment claims, which makes it all the more important that payment claims are served in a manner which effectively and expeditiously notifies the addressee of the claim. In the absence of a contractually stipulated date, a respondent to a payment claim only has 14 days to provide a payment response (s 11(1)(b) of the SOPA). A respondent is also generally precluded from raising, in its adjudication response under s 15 of the SOPA, objections to the amounts claimed which it fails to raise in its payment response (s 15(3)(a) of the SOPA). In the context of the SOPA where timings are \"tight yet crucial\", I agree with the view expressed that it is \"of utmost importance that service [of documents] be properly and timeously effected\" (WongPartnership, Annotated Guide to the Building and Construction Industry Security of Payment Act 2004 (Sweet & Maxwell Asia, 2004) at para 37.1).\n47 Accordingly, in my judgment, service of a payment claim by email would only be valid if it is likely to be effective in bringing the claim to the attention of the addressee in a reasonably prompt manner, and the sender has the onus of proving this. To that end, where a sender wishes to serve a payment claim on a recipient via the last email address of the addressee known to the sender under s 37(3)(b) of the SOPA, the sender must have some basis, which is objectively ascertainable, to believe that the last known email address is one which the addressee currently uses, or at least checks, regularly. It is insufficient that the sender has some subjective belief, without any proper basis, that the last known email address would be one that the addressee would check regularly. While I do not propose to exhaustively define what would amount to such an objectively ascertainable basis, an example would be where the sender has, in the recent past, sent emails to the addressee via a particular email address, and the addressee has replied using that email address.\n48 This requirement is consistent with a contextual reading of s 37 of the SOPA. Section 37(1)(e) of the SOPA provides that a sender may serve documents on an addressee via any electronic method authorised by regulations made under s 41(1) of the SOPA only if the recipient consents to service via that method. In the same vein, where a sender wishes to serve payment claims on an addressee through a particular email address, it is reasonable to expect that the addressee has in some way consented to being served via that email address. An addressee may expressly consent to the service of documents via a particular email address by giving the sender that email address for the service of documents (s 37(3)(a) of the SOPA). In that situation, it is reasonable to expect that the addressee would check his email regularly for documents being served on him. Alternatively, an addressee may impliedly consent to the service of documents via the last email address known to the sender by behaving in a manner which gives the sender grounds to believe that the addressee regularly uses and checks that email account (s 37(3)(b) of the SOPA). In that latter situation, it would be reasonable to expect that documents served via that email address would be likely to be brought to the addressee's attention in a reasonably prompt manner. In both cases, the service of documents by email would be regarded as effective in bringing the addressee's attention to the payment claim.\n49 The requirement that a sender must have an objectively ascertainable basis to believe that the addressee regularly uses and checks a particular email account is also sensible as a matter of practicality. In this day and age, it is commonplace for individuals to have multiple email accounts, some of which may have been created some time ago and may no longer be in use. Senders may learn of these unused email addresses with relative ease, for instance, by searching the internet for the contact information or the social media profile(s) of the intended recipient, some of which may not have been updated for some time. It would be grossly unfair if a claimant were allowed to serve payment claims via email addresses which are no longer in regular use, on the basis that those email addresses were the last email addresses \"known\" to the claimant under s 37(3)(b) of the SOPA, especially in light of the draconian consequences that flow from a failure to respond to a payment claim (explained above at [46]). That would open the adjudication procedure under the SOPA to sharp practice and possible abuse.\nWas PC 21 validly served on Mdm Wee?\n\n50 Whether PC 21 was validly served on Mdm Wee would depend on whether it was sent in a manner that was likely to be sufficient to bring it to Mdm Wee's attention in a reasonably prompt manner. In the present case, the relevant payment claim, PC 21, was sent by LJH to Mdm Wee by email on 30 April 2021. Specifically, PC 21 was sent by an email addressed to Mdm Wee's architects at their email address (luaarch@singnet.com.sg), with Mdm Wee copied via two email addresses: gw.bc@hotmail.com and gw.bc@gmail.com (see [14] above). As a preliminary point, I do not regard it as significant that PC 21 was sent to Lua Architects, with Mdm Wee only being copied in the email. Whether PC 21 was sent to Mdm Wee directly, or with her copied therein, the email would appear in her inbox and would be visible to her if she had checked her emails regularly. Rather, the issue is whether LJH can prove that it had an objectively ascertainable basis to believe that either of these email addresses were used and checked by Mdm Wee regularly in 2021, such that sending PC 21 to these email addresses would be likely to bring it to her attention in a reasonably prompt manner. If so, that would be sufficient to constitute proper service of PC 21 by email in this case.\n51 Mdm Wee does not dispute that gw.bc@hotmail.com is an email address belonging to her, nor that LJH's email was in fact received in her inbox. However, Mdm Wee says that LJH's service of PC 21 in this case was invalid as it did not bring LJH's claim to her attention. In particular, Mdm Wee contends that:\n(a) as she is not technology savvy, she does not use her email accounts to communicate with others or to respond to any matters relating to the Project, and therefore did not check her email accounts regularly;\n(b) she did not give any email address to LJH for service of documents to her, and correspondences from LJH were previously sent to her in the form of hardcopies;\n(c) the past 20 payment claims prior to PC 21 were not served by email; and\n(d) the first time she learnt of PC 21 was on 15 June 2021 during a meeting with Mr Lua.\n52 LJH contends that there is clear evidence that Mdm Wee was able to receive, retrieve and view her emails at gw.bc@hotmail.com. In particular, it points out that:\n(a) that email address had previously been copied in various email communications relating to the Project which were sent from March 2018 to May 2019; and\n(b) Mdm Wee's own architects, Lua Architects, used that email address to update her and seek her instructions on specific matters, to get her to sign certain documents, and to inform her of site meetings (as evidenced by various emails sent from February 2016 to December 2017).\nTherefore, LJH argues that there was no reason for it to think that Mdm Wee did not use gw.bc@hotmail.com to communicate on matters pertaining to the Project, or that she did not check that account regularly.\n53 By a letter dated 16 August 2022, which was after I heard oral arguments for the matter, counsel for LJH produced copies of two emails sent by Mdm Wee from gw.bc@hotmail.com. I subsequently granted leave for LJH to file a further affidavit to exhibit the two emails. LJH contends that these emails constitute clear evidence that Mdm Wee, contrary to her stated position in her affidavits, did use her email account gw.bc@hotmail.com:\n(a) On 22 March 2016, Mdm Wee sent an email from gw.bc@hotmail.com to one Mark Lim of Luxe Studio, Lua Architects, LJH's email address (ljh@ljhgroup.com.sg), Mr Lum and one \"Willie\" of LJH. In that email, among other things, Mdm Wee requested to see sketches of proposed amendments to the bathrooms in the Property.\n(b) On 2 August 2016, Mdm Wee sent an email from gw.bc@hotmail.com to Lua Architects, with \"Willie\", one Yeo Jinkow, Mr Lim, Mr Lum and \"ds.zhu@prostruct.com.sg\" copied. In that email, she informed one HanChee of Lua Architects that Mr Lua had told her it was not necessary to have a lift installed for the purposes of obtaining a TOP as an application may be made to the authorities to expedite the process, and instructed HanChee to make the necessary application.\n54 By a letter dated 25 August 2022, counsel for Mdm Wee responded, contending that, although the two emails which she sent in 2016 exhibited in LJH's further affidavit show that she did use gw.bc@hotmail.com to communicate about the Project, they do not undermine her arguments about invalid service because:\n(a) there remains no evidence that she had ever corresponded with LJH by email;\n(b) the fact remains that she had not received any payment claims from LJH by email before; and\n(c) the two emails sent in 2016 were sent some 5 years prior to LJH's email submission of PC 21 on 30 April 2021, and do not show that she was still operating gw.bc@hotmail.com in 2021.\n55 After reviewing the parties' submissions, I am of the view that the sending of PC 21 to gw.bc@hotmail.com on 30 April 2021 in this case was unlikely to have been effective in bringing it to Mdm Wee's attention in a reasonably prompt manner. On the available evidence before me, LJH could not have had an objectively ascertainable basis to believe that Mdm Wee used or checked that email account regularly in 2021, in the months leading to 30 April 2021 when PC 21 was sent to her.\n56 First, prior to PC 21, LJH had never served any payment claims to Mdm Wee by email. Indeed, LJH itself clarified with the Adjudicator in the adjudication proceedings that payment claims were previously served only on Lua Architects by email, who would then forward the payment claims to Mdm Wee. As such, Mdm Wee would likely have been operating under the assumption that any payment claims would not be served on her directly, and in any case, that they would not be served on her via email. There was thus no reason for her to check her emails regularly to look out for any payment claims from LJH.\n57 Secondly, it is clear that, apart from the two emails sent by Mdm Wee in 2016 mentioned at [53] above, there is no evidence of Mdm Wee using gw.bc@hotmail.com regularly after 2016, let alone in 2021. On the face of the other emails adduced by LJH as evidence, Mdm Wee has not responded or replied to any of the emails sent by Lua Architects to her (which were sent in 2016 and 2017), nor has she replied to the emails sent by Lua Architects to LJH or other addressees with her copied therein (which were sent in 2018 and 2019). In any event, leaving aside the fact that the two emails mentioned at [53] above did not pertain to payment matters, they were sent by Mdm Wee in 2016, almost five years before PC 21 was served on her via gw.bc@hotmail.com on 30 April 2021. Therefore, they do not constitute evidence that Mdm Wee used or regularly checked gw.bc@hotmail.com in 2021, when PC 21 was sent to that email address. Moreover, Mdm Wee's evidence is that Lua Architects had updated her about the Project through telephone or in-person meetings, and would provide her with hardcopies of documents to be shown to her. This has not been challenged by LJH. That being the case, Mdm Wee would have no reason to check her emails in 2021 to retrieve correspondences about the Project.\n58 I note that Mdm Wee has not explained why her email address, gw.bc@hotmail.com, was copied in the emails between LJH and Lua Architects, other than saying that: (i) she had seen the emails for the first time after they were exhibited in Mr Li's affidavit; and (ii) she had not asked for her email address to be copied in those emails and could not stop LJH or Lua Architects from doing so. Nevertheless, I am of the view that her being copied in those emails, without more, does not constitute positive evidence that she has read them or that she used her email account regularly in 2021.\n59 LJH argues that Mdm Wee's ability to receive, retrieve and read emails from gw.bc@hotmail.com is evidenced by Lee & Lee's confirmation that she was able to and did receive LJH's Notice of Intention to Apply for Adjudication and two emails from the SMC at that email address. However, LJH's argument does not contradict Mdm Wee's account that she had only retrieved and read those emails after Lua Architects had alerted her to LJH's Adjudication Application sometime in June 2021. Mdm Wee's ability to retrieve and read those emails from gw.bc@hotmail.com in June 2021 after being told about the adjudication proceedings does not constitute an objectively ascertainable basis for LJH to believe that sending PC 21 to gw.bc@hotmail.com in April 2021 would have been likely to bring PC 21 reasonably promptly to Mdm Wee's attention. It remains the case that there is no evidence that Mdm Wee had checked her email account, or was in the habit of doing so, in the months leading to the sending of PC 21 on 30 April 2021.\n60 I also note that the Adjudicator found that there was \"evidence of consistency with the service of PC 21 [by email]\". This was based on a single email dated 17 June 2015 (which the Adjudicator mistakenly referred to as 15 June 2015), sent by LJH to gw.bc@hotmail.com with Lua Architects' email address being copied therein, relating to a previous payment claim. However, I do not regard this as evidence that LJH had an established practice of serving payment claims on Mdm Wee by email, nor that Mdm Wee regularly checked and read her emails. In the first place, the email of 17 June 2015 was from LJH to Mdm Wee which dealt with a query concerning a payment claim; that email was certainly not service of a payment claim, and it is unclear whether it was even Mdm Wee who raised that query. More fundamentally, there is no evidence that Mdm Wee had replied to, or even read that email. In my view, the Adjudicator did not consider the more relevant question of whether there was any evidence that Mdm Wee was regularly checking or using her email account gw.bc@hotmail.com in 2021, in the period leading up to the service of PC 21 on 30 April 2021.\n61 On the totality of the evidence, I find that LJH did not have an objectively ascertainable basis to believe that Mdm Wee used or regularly checked gw.bc@hotmail.com in 2021. In the circumstances, LJH has not shown that sending PC 21 to gw.bc@hotmail.com on 30 April 2021 was likely to have brought it to Mdm Wee's attention in a reasonably prompt manner.\n62 For completeness, and as already mentioned above at [40], I reiterate that LJH has not made any submissions or provided any evidence at all that the other email account gw.bc@gmail.com was ever used regularly by Mdm Wee, that any communications related to the Project were sent to that account, or that it was an email account that was regularly used or checked by her in 2021. The entire focus of LJH's submissions on service by email was on the gw.bc@hotmail.com account.\n63 For the reasons explained above, I find that LJH's service of PC 21 by email on 30 April 2021 was defective and, accordingly, that the service of PC 21 on Mdm Wee was not valid for the purposes of s 10(1)(a) of the SOPA. It follows that LJH was not entitled to make an application under s 13(1) read with s 12(2) of the SOPA. It also follows that the Adjudicator had no jurisdiction to determine LJH's Adjudication Application as the Adjudicator's appointment under s 14(1) of the SOPA was invalid (see [36]-[38] above). Therefore, the Adjudication Determination is invalid, and should be set aside under s 27(8)(a) of the SOPA.\n64 Given my conclusion that LJH's service of PC 21 was invalid, it is not necessary for me to deal with Mdm Wee's other contentions regarding email service, namely: (i) that LJH's email was sent in a surreptitious manner which would not attract her attention because of the sender's name being described as \"sweethome\" instead of LJH; and (ii) that LJH should have served PC 21 physically on Mdm Wee at her address at 16A Jervois Lane.\nIssue 2: Whether the Adjudication Determination should be set aside as it is tainted by fraud\n\n65 Assuming that I am wrong about the question of whether there has been valid service of PC 21 by email, I turn next to the issue of whether the Adjudication Determination should be set aside because it is tainted by fraud. Section 27(6)(h) of the SOPA provides that a party to an adjudication may commence proceedings to set aside an adjudication determination where the making of the adjudication determination was induced or affected by fraud or corruption.\nPrinciples applicable to fraud\n\n66 The Court of Appeal in Facade Solution Pte Ltd v Mero Asia Pacific Pte Ltd [2020] 2 SLR 1125 (\"Facade Solution\") set out a two-step test in determining when an adjudication determination should be set aside on the ground of fraud. The burden of satisfying both steps lies on the party seeking to set aside the adjudication determination (the \"innocent party\") (Facade Solution at [38]).\n67 In the first step, it must be shown that the adjudication determination was based on facts which the party putting forward the claim knew, or ought reasonably to have known, were untrue. Such knowledge is assessed objectively and encompasses both actual and constructive knowledge; it also applies to every stage of the adjudication proceedings (Facade Solution at [29]). To set aside an adjudication determination, the innocent party would thus have to establish (Facade Solution at [30]):\n(a) the facts which were relied on by the adjudicator in arriving at the adjudication determination;\n(b) that those facts were false;\n(c) that the claimant either knew or ought reasonably to have known them to be false; and\n(d) that the innocent party did not, in fact, subjectively know or have actual knowledge of the true position throughout the adjudication proceedings.\n68 Importantly, in relation to the last requirement mentioned at [67(d)] above, there is no need for the innocent party to show that the evidence of fraud could not have been obtained or discovered with reasonable diligence during the adjudication proceedings (Facade Solution at [31]). Parties dealing with an adjudicator are expected to act with utmost probity, and a fraudulent party should not be allowed to get away with fraud because he had not been found out earlier in the course of the adjudication proceedings (Facade Solution at [33]).\n69 In the second step, the innocent party must establish that the facts in question were material to the issuance of the adjudication determination. Facts would be material if there is a real prospect that the outcome of the adjudicator's determination might have been different had he known of the true state of affairs. In other words, the facts in question must have been an operative cause in the issuance of the adjudication determination based on the reasoning and arguments at the time the determination in question was made (Facade Solution at [35]).\nWhether the Adjudication Determination is tainted by fraud\n\n70 Mdm Wee argues that the Adjudication Determination should be set aside as it was procured by fraud. In particular, Mdm Wee contends that:\n(a) LJH had falsely represented that it was entitled to payment for parts of the Variation Works that were carried out by Yong Chow Construction, even though Mdm Wee had already paid those sums to Yong Chow directly;\n(b) LJH had fraudulently relied on forged documents from Dong Cheng to advance its claim for parts of the Variation Works which were done by Dong Cheng;\n(c) LJH had falsely represented the amounts which Mdm Wee had previously paid to LJH and Dong Cheng;\n(d) LJH had falsely represented that it was GST-registered and that GST was applicable to PC 21; and\n(e) LJH had falsely represented that it was entitled to the full Contract Sum and that it had completed all works in respect of the Project.\n71 LJH submits that the Adjudication Determination was not tainted by fraud because no false facts were relied upon by the Adjudicator in arriving at his decision, and even if some of the facts relied upon were untrue, they were not material to the Adjudication Determination and would not have led to a different outcome. While LJH accepts that it was not entitled to some of the sums awarded to it by the Adjudicator and has expressed its willingness to have those sums omitted from the Adjudicated Amount, it maintains that it had not acted fraudulently. LJH also takes the position that several of Mdm Wee's allegations of fraud involve legitimate and genuine disputes of fact between the parties, and that those matters should be referred to arbitration for resolution.\n72 Mdm Wee argues that the portions of the Adjudication Determination affected by fraud cannot be severed from the rest of the Adjudicator's decision because the fraud in this case is not de minimis. As LJH contended during the hearing before me that the parts of the Adjudication Determination impugned by both fraud and/or patent errors may be severed, I will deal with the issue of severance collectively below at [167]-[178].\n73 I proceed to consider whether each of the five instances of fraud alleged by Mdm Wee (listed at [70] above) are established.\nLJH's claim for the parts of the Variation Works done by Yong Chow\n\n74 LJH claimed the sum of $136,217.90 in PC 21 in respect of the Variation Works, comprising 34 items. Relying on various quotations and letters containing price quotes from subcontractors adduced by LJH, the Adjudicator awarded LJH $99,087 in respect of the Variation Works. It is common ground that out of the $99,087 awarded to LJH, $60,322 (in respect of 17 items of Variation Works) was awarded based on quotations from Yong Chow.\n75 Mdm Wee's position is that the Adjudicator had awarded the $60,322 (for 17 items of Variation Works) to LJH based on fraudulent claims by LJH. In particular, Mdm Wee submits that LJH had fraudulently relied on quotations from Yong Chow to substantiate its claim for those 17 items, even though Mdm Wee had already made payment directly to Yong Chow for those 17 items of Variation Works.\n76 In Mr Li's affidavit (which was affirmed on LJH's behalf), he accepted that of the 17 items of Variation Works, Mdm Wee had paid Yong Chow directly for 13 items (for which the Adjudicator awarded LJH $34,522). This was confirmed by counsel for LJH in the hearing before me on 7 July 2022. In other words, LJH concedes that the Adjudicator had awarded it at least $34,522 to which it was not entitled.\n77 As for the remaining four items of Variation Works (the \"disputed items\"), Mdm Wee maintains that she had paid Yong Chow directly for those works. In that regard, Mdm Wee has adduced copies of (i) invoices for several of the disputed items issued by Yong Chow addressed to her; and (ii) cheque payments made by her to Yong Chow in respect of some of those invoices.\n78 In making a claim under the SOPA, LJH as the claimant has the burden of establishing the basis of its claim - in this context, that it was entitled to be paid for the Variation Works done by Yong Chow. In light of Mdm Wee's evidence that (i) she had engaged Yong Chow to perform the Variation Works; (ii) Yong Chow had issued invoices to her for those works; and (iii) that she had paid Yong Chow directly for those works, the evidential burden has shifted to LJH to show that it was nevertheless entitled to be paid for those works. However, LJH has not, in my view, succeeded in proving such an entitlement - it has not produced any documentary evidence to show that it had paid, or was liable to pay, Yong Chow for those four disputed items.\n79 In the circumstances, I am satisfied that out of the $99,087 awarded by the Adjudicator to LJH for the Variation Works, $60,322 was awarded in respect of 17 items of Variation Works for which LJH has not proved that it had paid, or was liable to pay. Accordingly, I find that LJH was not entitled to claim for those 17 items of Variation Works, nor was it entitled to the $60,322 awarded by the Adjudicator.\n80 However, LJH argues that its claim for the items of Variation Works carried out by Yong Chow was not fraudulent, even if Mdm Wee had already paid Yong Chow for those works directly. In particular:\n(a) LJH refers to evidence of several quotations and invoices issued by Yong Chow to LJH as well as emails seeking payments, which it says showed that Yong Chow regarded itself as a subcontractor of LJH, but with payments to be made by Mdm Wee. Therefore, this placed LJH at risk of being held liable for quotations and/or invoices issued by Yong Chow, especially if Mdm Wee failed to make payment to Yong Chow.\n(b) LJH further says that Yong Chow had performed some of the Provisional Sum Works (which Mdm Wee denies). Under the terms of the Contract, payments for those works were to be made directly to LJH. Hence, it would not be unlikely for Yong Chow to regard itself as LJH's subcontractor in respect of those works, and seek compensation from LJH for them.\n(c) Finally, LJH says that it was not privy to arrangements between Mdm Wee and Yong Chow as it had \"no dealings with Yong Chow whatsoever\", and was also not notified that Mdm Wee had made direct payments to Yong Chow.\n81 I am unable to accept LJH's submissions. Before making a claim for those Variation Works, it was incumbent on LJH to ascertain that it was in fact liable to pay Yong Chow the sums claimed in Yong Chow's quotations and invoices addressed to LJH. As mentioned at [9] above, it is not disputed that Mdm Wee had engaged Yong Chow directly in or around February 2017 to carry out some of the works that were left uncompleted by LJH. However, LJH has produced no evidence to show that, while Mdm Wee had directly engaged Yong Chow, the arrangement was that she would continue to pay LJH such that LJH would be the one liable to pay Yong Chow. LJH has also not produced any evidence to show that Mdm Wee had failed to pay Yong Chow, such that it would somehow be held liable to pay Yong Chow for the invoices addressed to it by Yong Chow.\n82 I find the position taken by LJH in respect of Yong Chow's invoices to be completely untenable. In my judgment, LJH would surely know whether it had any contract with Yong Chow, and thus whether Yong Chow would have any claim against LJH for unpaid work. It is absurd for LJH to take the position that it might be liable to Yong Chow just because the latter sent invoices to LJH, especially when LJH's own evidence is that it had no dealings with Yong Chow whatsoever (see [80(c)] above). Indeed, LJH's concession at the hearing before me that it was not entitled to $34,522 awarded to it by the Adjudicator for 13 items of Variation Works is telling - LJH accepted that it had no basis to make a claim for that sum because it did not have any direct contractual relations with Yong Chow in relation to those works, nor was it under any contractual liability to pay Yong Chow for those works. In my view, the same can be said of the four disputed items.\n83 Moreover, LJH does not dispute that it had not paid Yong Chow for any of the invoices and quotations which the latter issued, or even informed Yong Chow that it would make payment. Indeed, LJH has not produced evidence of any letter of demand for payment from Yong Chow. As such, I find that LJH, as an experienced contractor, could not have genuinely believed that it was under any actual or potential liability to Yong Chow for those sums, or that it was entitled to claim these sums from Mdm Wee.\n84 LJH has not shown that it had any basis to believe it was entitled to make a claim for the 17 items of Variation Works done by Yong Chow, for which Mdm Wee had already paid. In the circumstances, I find that the first step of the two-step test in Facade Solution is satisfied - LJH knew, or ought reasonably to have known, that the facts relied on by the Adjudicator in making his determination (ie, that LJH was entitled to payment in respect of the 17 items of Variation Works done by Yong Chow) were false.\n85 Moreover, I accept Mdm Wee's evidence that she did not have subjective or actual knowledge of the true position throughout the adjudication proceedings, ie, that PC 21 included Variation Works which Yong Chow had performed and which she had already paid for. Mdm Wee's subjective knowledge must be assessed having regard to the unusual circumstances of the present case: (i) she was only informed of the adjudication proceedings on 15 June 2021; (ii) she only appointed solicitors on 16 June 2021 and received the Adjudication Determination thereafter; and (iii) the Adjudication Determination was rendered on 18 June 2021 (see [16]-[18] above). There would not have been enough time for her and her then solicitors to review LJH's Adjudication Application and the supporting documents, much less detect any fraud in the claims advanced by LJH.\n86 I also find that the second step of the Facade Solution test is satisfied. From the table set out in the Adjudication Determination at para 88, it is clear that the Adjudicator had awarded the sum of $60,322 claimed by LJH in respect of the 17 items of Variation Works solely on the strength of quotations from Yong Chow sent to LJH. The false fact in question (ie, that LJH was liable to pay Yong Chow) was therefore material to the Adjudicator's decision to allow LJH's claim for the Variation Works performed by Yong Chow for which Mdm Wee had already paid. Had the Adjudicator known the truth - that Mdm Wee had directly engaged Yong Chow and had already paid Yong Chow $60,322 for those items of Variation Works - the outcome of his determination would likely have been different.\nLJH's claim for the parts of the Variation Works done by Dong Cheng\n\n87 Mdm Wee submits that LJH had relied on forged documents from Dong Cheng to advance its claim for the parts of the Variation Works done by Dong Cheng, which were relied upon by the Adjudicator. In particular, Mdm Wee submits that LJH had claimed in PC 21, inter alia, $1,600 for a variation order titled \"Ground Beam\", for which the Adjudicator awarded LJH $1,600 in reliance on a purported progress claim from Dong Cheng dated 25 November 2015 (\"Progress Claim 8\").\n88 I accept that this was a representation by LJH that it was entitled to the sum claimed as it had paid that sum to Dong Cheng as its sub-contractor. In its Adjudication Application, LJH adduced Dong Cheng's Progress Claim 8 dated 25 November 2015 which was made to LJH, and this was expressly relied upon by the Adjudicator at para 88 of the Adjudication Determination.\n89 However, in separate legal proceedings, Dong Cheng had disclosed various documents which were inconsistent with Progress Claim 8. HC/OS 1412/2019 (\"OS 1412\") was commenced by one Orion-One Residential Pte Ltd (\"Orion-One\") against Dong Cheng to set aside an adjudication determination made pursuant to an adjudication application by Dong Cheng and alternatively, for an amount of $2,018,440.26 to be paid into court pending the disposal of arbitration proceedings commenced by Orion-One against Dong Cheng. The basis of Orion-One's alternative prayer was that it would be unable to recover any money from Dong Cheng even it was successful in the arbitration proceedings as Dong Cheng did not have any ongoing projects and was not a going concern. In order to prove that it was a going business concern and that it had ongoing construction contracts, Dong Cheng had produced a letter from LJH dated 26 March 2017 (\"the Letter\") (exhibited in the affidavit of one of Dong Cheng's Directors) wherein LJH purportedly accepted Dong Cheng as subcontractor in respect of the Project. Clause 3 of the Letter further states that the commencement date of the sub-contract was 23 March 2017, while Clause 4 provides that the works were to be completed within 12 months from the commencement date. Further, Dong Cheng also disclosed in OS 1412 a tax invoice that it had sent to LJH dated 25 January 2018 seeking payment of $77,115.77 for the \"8th Progress claim for the work done at [sic] November 2017\" (the \"Tax Invoice for Progress Claim 8\").\n90 As Mdm Wee rightly submits, the above documents disclosed by Dong Cheng in OS 1412 raise several troubling issues.\n(a) Dong Cheng could not possibly have submitted Progress Claim 8 on 25 November 2015 (as LJH represented in its Adjudication Application), if its sub-contract with LJH only commenced on 23 March 2017 (as reflected in Clause 3 of the Letter). The Tax Invoice for Progress Claim 8 adduced in OS 1412 for work done in November 2017 also contradicts Progress Claim 8, which was purportedly submitted on 25 November 2015. In other words, either the date indicated on Progress Claim 8 adduced in LJH's Adjudication Application, or the dates indicated in the Letter and Tax Invoice for Progress Claim 8 disclosed in OS 1412, must be incorrect.\n(b) Mr Li claimed in his affidavit in these proceedings that LJH had substantially completed the Section I Works and Section II Works by end 2016 or early 2017. However, the Letter purporting to accept Dong Cheng as subcontractor is dated 26 March 2017, apparently after the Section I and Section II works were completed.\n91 LJH admits to the existence of these discrepancies, but has attempted to explain them away by stating that LJH and Dong Cheng had retrospectively signed the subcontract in March 2017 to \"regularise matters\", and that Dong Cheng's tax invoices issued from May 2017 to October 2019 were part of an \"internal accounting exercise\".\n92 LJH further submits that the inconsistencies are not material to the Adjudication Determination. The issue before the Adjudicator was whether the works done by Dong Cheng and claimed by LJH had been carried out, and the value of those works, and not when the works were completed.\n93 Mdm Wee's case appears to be that LJH and Dong Cheng had produced forged or fraudulently altered documents in OS 1412. However, it is not immediately apparent to me how, even if that is true, it would taint the Adjudication Determination. Indeed, Mdm Wee has not shown that the version of Progress Claim 8 dated 25 November 2015, which the Adjudicator relied on, was forged or falsified. In fact, it appears to me that Mdm Wee does accept that, in 2015, Dong Cheng was LJH's subcontractor and was carrying out work on the construction of the house at Dalkeith Road. As such, if anything, it appears more likely to be the case that the Letter and Tax Invoice for Progress Claim 8 produced by Dong Cheng in OS 1412 are questionable, rather than the version LJH relied on in the adjudication proceedings.\n94 At this juncture, I make the observation that the fact that the same individuals were in control of both of LJH's and Dong Cheng's business through various capacities might have made it easier for them to manipulate or alter documents passing between the two companies. In particular, Mr Li had simultaneously acted as representative and General Manager of both LJH and Dong Cheng, whilst one Tan Sun Hua is the sole director of both LJH and Dong Cheng:\n(a) Mdm Wee's evidence is that Mr Li, the current General Manager of LJH, had communicated with her as a representative of Dong Cheng. Mr Li's role as a representative of Dong Cheng is also evidenced by the fact that LJH had written a letter to Dong Cheng dated 15 August 2016 which was addressed to Mr Li.\n(b) From 4 April 2021 to 29 September 2021, Mr Li had filed five affidavits in HC/CWU 43/2021 (Orion-One's winding up application against Dong Cheng) on behalf of Dong Cheng as Dong Cheng's General Manager. In April 2021, Mr Li had also filed an affidavit in the present proceedings as LJH's General Manager. In other words, Mr Li had likely acted as General Manager of both LJH and Dong Cheng simultaneously.\n(c) Based on a Questnet Enhanced Individual Search dated 17 February 2022, Mr Li was a director of Dong Cheng from 17 April 2015 to 20 April 2015 and Secretary of LJH from 30 January 2018 to 10 May 2018.\n(d) Tan Sun Hua, who is presently the sole director and shareholder of Dong Cheng, was appointed as the sole director of LJH on 10 May 2018 and as the sole director of Dong Cheng on 15 January 2021.\n95 In the circumstances, it cannot be said that the Adjudication Determination has been tainted by fraud simply because forged or fraudulently altered documents were tendered in separate proceedings by the same individuals. Mdm Wee has not pointed to any false fact in connection with Dong Cheng's Progress Claim 8 dated 25 November 2015 produced in the adjudication proceedings, which the Adjudicator had relied on in making his determination. This instance of alleged fraud premised on LJH's reliance on inconsistent documents in OS 1412 thus fails the first step of the Facade Solution test.\nLJH's representations of the amounts previously paid by Mdm Wee\n\n96 LJH represented in PC 21 that the total of (i) the sum Mdm Wee had previously paid to LJH and Dong Cheng; and (ii) the Retention Sum, was $929,777.95. However, Mdm Wee contends, and LJH does not appear to dispute, that she had paid a total of $1,207,405.35 to LJH and Dong Cheng pursuant to 16 certificates of payment issued under the Contract. In other words, there is a difference of $277,627.40 between the amount which LJH represented that Mdm Wee paid in PC 21, and the amount which Mdm Wee actually paid.\n97 In the proceedings before me, LJH accepts that it had omitted to include in PC 21 the following payments made by Mdm Wee totalling $212,542.94:\n(a) direct payments to Dong Cheng amounting to $108,077 for works certified under Payment Certificates Nos 13 and 14 (by cheques dated 1 June 2016 and 30 June 2016 which are for sums of $75,414.62 and $32,662.38 respectively); and\n(b) payments to LJH amounting to $104,465.94 for works certified under Payment Certificate No 15 (by cheques dated 19 September 2016 and 23 September 2016 which are for sums of $75,152.70 and $29,313.24 respectively).\n98 Therefore, added to the $929,777.95 which LJH represented in PC 21 that Mdm Wee had already paid, LJH accepts that Mdm Wee had paid to itself and Dong Cheng a total of $1,142,320.89. However, that still leaves unaccounted a difference of $65,084.46 between the amount which Mdm Wee actually paid, and the amount which LJH concedes that Mdm Wee paid. LJH has not attempted to resolve this discrepancy, and it has also provided no explanation as to how it computed the figure of $929,777.95 in PC 21, or why it represented that amount as being paid by Mdm Wee.\n99 It appears to me that LJH had arrived at this figure of $929,777.95 by adding the sums paid by Mdm Wee for Payment Certificates No 1 to No 12 and No 16 (which total $994,862.41), and then removing 7% GST from that sum (amounting to $65,084.46). It is unclear to me why LJH saw the need to exclude the 7% GST from the amount it represented as sums paid to it by Mdm Wee. However, I note that LJH was GST deregistered since 22 July 2017, and was thus not entitled to GST at the time it sent PC 21 to Mdm Wee on 30 April 2021 (see [109] below). As such, LJH could have removed the GST component from the amount it represented as having been paid by Mdm Wee, possibly in some misguided belief that it could not appear that it had claimed for GST payments from Mdm Wee in the past, having now been GST-deregistered.\n100 Whatever LJH's reasons were for doing so, I find that LJH was completely unjustified in understating the amount paid by Mdm Wee by $65,084.46, in addition to failing to account for the $212,542.94 already paid by Mdm Wee in PC 21 (see [97] above). In the circumstances, I accept that Mdm Wee had paid to LJH a total of $1,207,405.35, and that in representing in PC 21 that Mdm Wee had only paid $929,777.95, LJH had misrepresented that Mdm Wee had paid $277,627.40 less than she actually did. In other words, LJH had made a claim for $277,627.40 to which it was not entitled.\n101 LJH, however, says that its claim was not fraudulent because it had merely \"overlooked\" the fact that these payments had been made by Mdm Wee, and that it was an administrative oversight. Moreover, it says that it was open for Mdm Wee to raise these omissions to the Adjudicator during the adjudication proceedings.\n102 I am unable to accept that LJH's omissions are not fraudulent simply because they had \"overlooked\" these payments. Applying the approach set out Facade Solution, it suffices that Mdm Wee is able to show that the Adjudication Determination is based on facts which LJH ought reasonably to have known were untrue (see [67] above). Indeed, a statement made recklessly without care as to its truth is made fraudulently (Derry v Peek (1989) 14 App Cas 337 at 371, endorsed in Facade Solutions at [28] and Ser Kim Koi v GTMS Construction Pte Ltd [2016] 3 SLR 51 at [38]).\n103 In the present case, the evidence shows that LJH was fully aware of, and in fact acquiesced to, the direct payments of $108,077 from Mdm Wee to Dong Cheng. In a letter written by LJH to Dong Cheng dated 15 August 2016 (the \"15 August 2016 Letter\"), LJH had confirmed that (i) it had given \"written authority to [Mdm Wee] to pay the two ... sums amounting to S$108,077.00 (payment of which [was] due to [LJH]) to you\"; and (ii) that Mdm Wee had already paid the sum of $108,077 to Dong Cheng. I note further that the letter was addressed to Mr Li as representative of Dong Cheng, who is currently the General Manager of LJH. It is thus completely unbelievable that LJH and Mr Li would have \"overlooked\" Mdm Wee's payment of $108,077 to Dong Cheng when LJH made the Adjudication Application.\n104 Likewise in relation to the payments from Mdm Wee to LJH itself, LJH had informed Dong Cheng in the 15 August 2016 Letter that \"[a]s Invoice No. 15 for $102,465.94 is due for payment by 1/9/16[,] ... [LJH would] not authorise [Mdm Wee] to make payment directly to [Dong Cheng]\". LJH should therefore have been anticipating payment from Mdm Wee for Invoice No 15 (which Mdm Wee in fact made (see [97(b)] above)), given that it was due for payment in less than a month from the date of the letter.\n105 In these circumstances, I cannot accept LJH's contention that it had \"overlooked\" the payments made by Mdm Wee as a valid excuse. When a payment claim is submitted, the claimant must be diligent in setting out the payments under the contract that it has already received, and give credit for such payments. Even if one were to accept that LJH was grossly negligent and failed to check what payments it had received previously, I find that LJH clearly ought to have known about Mdm Wee's payments to Dong Cheng and itself when it was preparing PC 21. Indeed, LJH's admission in these proceedings that it had omitted to account for amounts previously paid by Mdm Wee in PC 21 shows that LJH could have discovered, with relative ease, that it was not entitled to this excess amount of $277,627.40 which it claimed for in PC 21.\n106 As such, I find that LJH had falsely represented that Mdm Wee had only paid $929,777.95 to itself and Dong Cheng when in truth, Mdm Wee had paid $1,207,405.35. It follows that LJH had falsely represented that it was entitled to an excess amount of $277,627.40. For the reasons explained above at [85], I find that Mdm Wee would not have had sufficient time to properly review LJH's Adjudication Application, and thus would not have had actual knowledge that LJH had falsely represented in PC 21 the sums previously paid by her to Dong Cheng and LJH.\n107 Notably, in the hearing before me on 7 July 2022, counsel for LJH did not take the position that Mdm Wee had actual knowledge of the true position during the adjudication proceedings. Instead, counsel submitted that LJH had exhibited the amounts which Mdm Wee had previously paid in PC 21, and that Mdm Wee and/or Lee & Lee could have pointed out that she had in fact paid more than that during the adjudication proceedings. This submission has no merit. As stated in Facade Solution at [31], it is not a defence for a fraudulent party to say that the innocent party could have discovered the fraud during the adjudication proceedings had the innocent party exercised reasonable diligence.\n108 It is also clear that LJH's false representation was material to the Adjudicator's determination. In reliance on the representation that Mdm Wee had only paid $929,777.95 to LJH and Dong Cheng, the Adjudicator only deducted $929,777.95 from the sum awarded to LJH in the Adjudication Determination. As both stages of the Facade Solution test are satisfied, I find that the Adjudication Determination has been tainted by fraud due to LJH's misrepresentation of the amounts previously paid by Mdm Wee.\nLJH's entitlement to GST\n\n109 It is undisputed that LJH was not GST-registered at the time it purported to serve PC 21 on Mdm Wee (30 April 2021), as it was deregistered since 22 July 2017. However, the Adjudicator had awarded LJH a total sum of $694,696.76 which was inclusive of 7% GST.\n110 Notably, LJH had indicated in the following documents submitted in the adjudication proceedings that its claim for payment of $686,380.21 from Mdm Wee under PC 21 was \"(before GST)\":\n(a) the document titled \"Notice of intention to apply for adjudication\" exhibited in the Adjudication Application and the \"Brief description of dispute\" section in the same document;\n(b) the Adjudication Application Form AA-1; and\n(c) its first set of submissions before the Adjudicator.\n111 Mdm Wee contends that adding the words \"before GST\" in parentheses in the various documents listed above \"naturally implied that the sum [in PC 21] attracted GST\", which amounted to a false representation that LJH was entitled to GST on its payment claim. She says that LJH was also fraudulent in (i) not seeking a correction of the Adjudication Determination to remove the GST component that was awarded, and (ii) affirming that the Adjudicator had determined that Mdm Wee was to pay LJH \"the amount of S$694.696.76 (with GST)\" (in Mr Li's affidavit).\n112 LJH's response to this is that it had not claimed GST in PC 21, and that the Adjudicator had committed a \"jurisdictional error\" by awarding LJH 7% GST on his own volition. This portion relating to the award of GST, LJH argues, is severable from the rest of the Adjudication Determination.\n113 I am unable to conclude that LJH had acted fraudulently when it indicated that the amount it was claiming was \"before GST\". I find that the words \"before GST\" do not amount to an unequivocal representation that LJH was entitled to claim GST, nor that it was GST-registered. The fact remains that, in PC 21 and the documents submitted by LJH in the course of the adjudication proceedings, LJH did not expressly claim for GST. In the circumstances, I find that there is no false fact that was presented by LJH to the Adjudicator in this regard. Ultimately, the hallmark of fraud is dishonesty (Facade Solution at [28]), which is a serious allegation to levy. In my judgment, it cannot be said that LJH's indication that the amount it was claiming was \"before GST\" was a dishonest attempt to claim GST.\nLJH's entitlement to the full Contract Sum\n\n114 LJH had indicated in PC 21 that it was claiming the sum of $1,479,940.26 in respect of works under the Contract (the \"Main Contract Works\"). Mdm Wee says that the sum claimed included claims for (i) works which were done by Yong Chow and for which Mdm Wee paid Yong Chow directly; and (ii) incomplete or defective works. In both categories, Mdm Wee says LJH had fraudulently made claims for sums to which it was not entitled.\n(1) LJH's claim for Main Contract Works done by other contractors\n\n115 Mdm Wee contends that LJH had fraudulently claimed for sums in respect of the balance of the Main Contract Works which it did not perform. In particular, she says:\n(a) LJH had unequivocally told her that it was unable to carry on with the Main Contract Works and that the balance of the works was to be carried out by Dong Cheng.\n(b) LJH had confirmed in its letter dated 5 May 2016 that (i) Dong Cheng had been authorised to complete the Main Contract Works and to receive payments from Mdm Wee directly; and (ii) Mdm Wee had paid all sums due to LJH in respect of the Main Contract Works.\n(c) Neither LJH nor Dong Cheng carried out any of the Main Contract Works after May 2016. Mdm Wee had to engage third-party contractors, including Yong Chow, to carry out the balance of the Main Contract Works which LJH and/or Dong Cheng were supposed to, but did not, perform.\n(d) Accordingly, LJH knew that there were no further payments due to it and that it was not entitled to any further payments in respect of the balance of the Main Contract Works.\n116 LJH's position is that:\n(a) It had completed all works which it was obliged to complete under the scope of the Contract. Save for one example raised by Mdm Wee, which LJH says fell outside of its obligations, she had not substantiated nor provided any examples of works under the Contract which LJH had not carried out. Accordingly, LJH claims that it should be entitled to the full sum for the Main Contract Works.\n(b) There are legitimate and genuine disputes between the parties about whether the works carried out by Yong Chow are (a) works that fell within the scope of the Contract which should have been done by LJH, or (b) Provisional Sum Works, or (c) Variation Works. The existence of such disputes precludes the conclusion that LJH had submitted fraudulent claims in relation to the works carried out by Yong Chow. Moreover, such disputes ought to be properly referred to arbitration for resolution.\n117 It appears that the issue here is whether LJH had in fact performed all the Main Contract Works which it claimed for in PC 21. In this regard, if LJH had done so, and there are sums due from Mdm Wee for the completed Main Contract Works, it appears to me quite odd that LJH had sent a letter to Mdm Wee on 5 May 2016 confirming that it had received all sums due under the Contract from Mdm Wee. In none of Mr Li's affidavits, nor in LJH's written submissions, has any attempt been made to explain why LJH had represented to Mdm Wee on 5 May 2016 that all sums owed to it had been paid.\n118 LJH claims that it continued to carry out Main Contract Works in 2018 to 2019 which allowed the TOP to be issued for the project. The Adjudicator appears to have accepted that this was the case, and thus awarded the balance of the sums due for the Main Contract Works.\n119 In my judgment, it remains a question of fact whether LJH had completed all the Main Contract Works, and so was entitled to the full Contract Sum. It could well be that LJH had mistakenly believed that all sums owed to it by Mdm Wee were paid in 2016, when it was in fact not the case. It also could be the case that LJH did carry out further Main Contract Works in 2018 to 2019, even though this is disputed by Mdm Wee. Absent sufficient evidence that LJH had not completed the works for which it claimed in PC 21, I cannot conclude that LJH's claim for the balance of the Contract Sum in PC 21 was one that was fraudulently made. This is an issue that has to be resolved in arbitration, as per the parties' agreement (see [20] above).\n(2) LJH's claim for incomplete or defective works\n\n120 Mdm Wee also claims that LJH had made fraudulent claims for works which it knew to be incomplete or defective. Mdm Wee submits that LJH was required to carry out plumbing, electrical and mechanical installation works. However, there was evidence that these works were incomplete and/or defective. Specifically, Mdm Wee relies on a report prepared by Crawford & Company (the \"Crawford Report\"), which was obtained on 24 June 2021 after the adjudication proceedings. The Crawford Report opined that the Property was not in a state ready for the TOP to be issued, despite one being issued on 22 May 2019. The major defects included water seepages and stains, failure to install water pipes and toilet accessories, and gaps in the floor tiles and steps. Mdm Wee further alleges that LJH had concealed the incomplete and/or defective works to obtain the TOP in 2019.\n121 Mdm Wee says that LJH knew or ought to have known that these works were incomplete because (i) the completion certificate under the Contract had not been issued by Lua Architects; and (ii) Lua Architects had confirmed that the completion certificate could not be issued to LJH because of the outstanding works which LJH did not complete.\n122 LJH, on the other hand, denies making a claim for the installation of water pipes. While it had made a claim in PC 21 for \"[l]abour, in taking delivery to site storage and install[ing] sanitarywares [sic], fitting and accessories\" under the \"Schedule 8 Mechanical and Electrical Works\", LJH says that the installation of sanitary wares does not include pipe works.\n123 LJH also denies responsibility for any defective works, pointing out that two years or more have passed since LJH had completed its works on the Property, and that other contractors who have since then performed work on the Property could have caused the damage. It reiterates that such factual disputes should be referred to arbitration for resolution.\n124 LJH also maintains that it had substantially completed the plumbing installation works which it claimed for in PC 21, and that this is evidenced by the Project Quantity Surveyor's Interim Valuation No 17 wherein the Project Quantity Surveyor had certified the plumbing installation works to be 95.83% complete as at 20 January 2017.\n125 Whether LJH has made a fraudulent claim for works which it knew to be incomplete and/or defective turns on the questions of (i) whether the allegedly incomplete works fell within the scope of LJH's contractual obligations and if so, whether LJH had in fact completed them; and (ii) whether the allegedly defective works were in fact defective and if so, whether the defects were caused by LJH or subsequent contractors.\n126 In alleging that LJH has made a fraudulent claim, the onus lies on Mdm Wee to establish on a balance of probabilities that (i) the works were in fact incomplete and/or defective; and (ii) LJH knew or ought to have known that but made a claim for those works. I find that Mdm Wee has not established either of these. Some aspects of these questions are intensely factual, and must be resolved in arbitration. On the affidavit evidence before me, I find it quite impossible to conclude that LJH had acted fraudulently in claiming for incomplete and/or defective works in PC 21.\nConclusion on whether the Adjudication Determination is tainted by fraud\n\n127 In conclusion, I find that fraud has been established in respect of (i) LJH's claim for payment for the Variation Works done by Yong Chow; and (ii) LJH's representations as to the amounts previously paid by Mdm Wee to LJH and Dong Cheng. Accordingly, I find that the Adjudication Determination has been tainted by fraud and is liable to be set aside under s 27(8)(a) of the SOPA.\n128 I will consider whether the portions of the Adjudication Determination tainted by fraud may be severed from the rest of the determination at [167]-[178] below.\nIssue 3: Whether the Adjudication Determination should be set aside for patent errors\nPrinciples applicable to patent errors\n\n129 Section 27(6)(e) of the SOPA provides that a party may apply to set aside an adjudication determination where an adjudicator has failed to comply with the provisions of the SOPA in making the adjudication determination.\n130 Section 17(2) of the SOPA provides:\nDetermination of adjudicator\n...\n(2) An adjudicator must, in relation to an adjudication application, determine --\n(a) the adjudicated amount (if any) to be paid by the respondent to the claimant;\n(b) the date on which the adjudicated amount is payable;\n(c) the interest payable on the adjudicated amount; and\n(d) the proportion of the costs of the adjudication payable by each party to the adjudication,\nand must include, in the determination, the reasons therefor.\n131 Section 17(4) of the SOPA further provides an exhaustive list of considerations that an adjudicator may only have regard to in determining an adjudication application.\n132 As held in Comfort Management Pte Ltd v OGSP Engineering Pte Ltd [2018] 1 SLR 979 (\"Comfort Management\") at [26], s 17(4) of the SOPA (formerly s 17(3) of the 2006 SOPA) imposes an obligation on the adjudicator to consider all matters listed in that provision. Although s 17(4) of the SOPA presently in force provides that an adjudicator \"may only have regard\" to those matters whereas s 17(3) of the 2006 SOPA provides that an adjudicator \"shall only have regard\" to those matters, I am of the view that the change in wording does not affect the observations made at [26] of Comfort Management - an adjudicator remains bound to consider all the matters listed, but is limited to considering only those matters. Further, s 17(2) of the SOPA imposes an obligation to determine the adjudicated amount (among other things) (Comfort Management at [26]). Collectively, these provisions give rise to an adjudicator's general and independent duty to adjudicate the payment claim dispute before him. The adjudicator discharges this duty by satisfying himself as to whether the claimant has established a prima facie case that the construction work forming the subject of the payment claim has been completed and, if so, what the value of that work is (Comfort Management at [26], [34] and [65]). Moreover, the adjudicator must have a positive basis for his determination in order to discharge his duty, and it is insufficient for the adjudicator to merely be satisfied that there are no patent errors (Comfort Management at [62]).\n133 Importantly, the adjudicator has an independent duty to address his mind to, and consider the true merits of a payment claim, regardless of whether a payment response has been filed and/or whether he is precluded from considering reasons for withholding payment which were not included in a duly filed payment response by virtue of s 15(3) of the SOPA (Comfort Management at [26] and [34]). Further, a respondent who has not filed a payment response is nonetheless entitled to highlight to the adjudicator patent errors in the material properly before the adjudicator (Comfort Management at [66]-[67]).\n134 The decisive test for whether the adjudicator has breached his duty under s 17(4) of the SOPA is whether there are patent errors which the Adjudicator has failed to recognise. Where a court sees that a payment claim which has been allowed, and/or its supporting materials, contain patent errors, the inexorable inference to be drawn is that the adjudicator failed to have regard to the matters under s 17(4) of the SOPA since he did not recognise these errors (Comfort Management at [71] and [81]). Similarly, the central analytical tool for ascertaining whether the adjudicator has breached his duty under s 17(2) of the SOPA is the question of whether there are patent errors (Comfort Management at [82]). In summary, the Adjudicator's failure to recognise patent errors when making his determination will lead to the conclusion that the adjudicator has breached his duty to adjudicate, ie, his duty to be satisfied on a prima facie basis of the completion and proper value of the construction work which forms the subject of the payment claim (Comfort Management at [83]).\n135 The Court of Appeal in Comfort Management at [22] and [24] defined patent errors narrowly as errors that (i) are \"obvious, manifest or otherwise easily recognisable\"; and (ii) are manifest from the material that is properly before an adjudicator for the purpose of his adjudication (ie, material that has been duly filed and is permitted to be placed before the adjudicator). Strictly speaking, they are not errors committed by adjudicators, but are instead errors in the material before an adjudicator (Comfort Management at [22]). Patent errors are therefore an exceptional and extremely narrow category of errors, which include situations where (Comfort Management at [23]):\n(a) the contract adduced by the claimant in support of the payment claim is not even the contract between the parties;\n(b) the documentary evidence submitted by the claimant contradicts the claimed amount; or\n(c) no supporting material or explanation whatsoever is adduced to support the payment claim.\nWhether there are patent errors which the Adjudicator overlooked\n\n136 Mdm Wee submits that the Adjudication Determination should be set aside as the Adjudicator had breached his duties prescribed by the SOPA by reason of his failure to recognise patent errors in:\n(a) LJH's claim for the alleged Variation Works on the Property; and\n(b) LJH's claim for release of the Retention Sum.\n137 As noted at [135] above, patent errors in this context refer to errors in the material before an adjudicator, and not errors made by an adjudicator. For this reason, the Adjudicator's decision to grant 7% GST on the sum awarded to LJH cannot, by definition, be a patent error. It was simply a mistake by the Adjudicator, which was no doubt caused by the various references to \"without GST\" in the documents submitted in the adjudication proceedings.\nLJH's claim for alleged Variation Works\n\n138 Mdm Wee's arguments in relation to LJH's claim for the Variation Works may be categorised into allegations of three separate patent errors:\n(a) LJH's claim was unsupported by evidence;\n(b) LJH relied on multiple inconsistent quotations in respect of the same works; and\n(c) clause 12.(5)(a) of the SIA Conditions was not satisfied.\n139 Let me consider each of these arguments in turn.\n(1) LJH's claim for Variation Works was unsupported by evidence\n\n140 Mdm Wee submits that the Adjudicator's decision to allow LJH's claim for the Variation Works was based only on quotations by other contractors. She suggests that this is a patent error because there is otherwise no evidence:\n(a) of work done by LJH or the quantity thereof; and\n(b) that the quotations from other contractors were even accepted by LJH.\n141 LJH submits that the absence of sufficient evidence for an adjudicator's decision does not constitute a patent error, and courts should be slow to examine the merits of an adjudicator's decision. It says that, in any case, the Adjudicator had gone through the documents and provided his reasons for allowing LJH's claim for the Variation Works.\n142 I accept that the Adjudicator had applied his mind to each of the claims made by LJH in respect of the Variation Works and determined their value based on quotations from other contractors. However, I agree with Mdm Wee that the fact that LJH has failed to produce any evidence that the works were completed constitutes a patent error in the sense contemplated in Comfort Management. It is evident from para 88 of the Adjudication Determination that, save for one item of Variation Works claimed for in PC 21, the sole basis for concluding that the Variation Works were completed (and their value) were various quotations or letters containing price quotes submitted by other contractors, which the Adjudicator considered to be \"prima facie evidence of work done\".\n143 Mere quotations unsubstantiated by any photos, plans, or other documentary proof of completion of work cannot possibly constitute satisfactory evidence of completion of the Variation Works which LJH claims payment for; the absence of any such evidence of completion amounts to a patent error in LJH's claim for the Variation Works. Leaving that aside, I also agree with Mdm Wee that there is no evidence that the quotations from the contractors relied upon by the Adjudicator were even accepted by LJH.\n144 Only LJH's claim for works done for the \"Ground Beam\" was supported by Progress Claim 8 dated 25 November 2015 from Dong Cheng. Even then, the progress claim did not contain any photographs, drawings, descriptions or any evidence evidencing the completion of the \"Ground Beam\". To compound matters, the progress claim was not even signed by Dong Cheng. I am of the view that Progress Claim 8 therefore does not constitute evidence of the completion of the \"Ground Beam\".\n145 In the circumstances, I find that the Adjudicator has not discharged his independent duty to satisfy himself that the works claimed for in PC 21 have been completed.\n146 It is apposite to highlight at this point that the court, which exercises a supervisory function over an adjudicator, should not review the merits of an adjudicator's decision (Terence Lee at [66], CMC Ravenna Singapore Branch v CGW Construction & Engineering (S) Pte Ltd [2018] 3 SLR 503 at [21]). As cautioned in Comfort Management at [94], to invite the court to set aside an adjudicator's determination for allowing a claim despite there being insufficient documentation in support of the claim is \"tantamount to asking the court to review his decision on the merits\", which the court should not do.\n147 Indeed, in Comfort Management, the court found that the adjudicator in that case had a \"positive reason for accepting\" a claim because he had applied his mind to the supporting documents for that claim and was satisfied that they were sufficient (at [91]). However, the situation in this case may be distinguished from Comfort Management. There, the adjudicator took note of a table setting out the location, quantities and prices of the works. There were also appendices containing a breakdown of the works with reference to relevant drawings, and those drawings were marked as \"as built\" and bore handwritten quantities and locations of work sketched in colour. It was against those facts, among others, that the court observed at [94] that the true substance of the appellant's argument was that there was insufficient (as opposed to no) documentation to support the respondent's claim, and thus declined to set aside the adjudicator's decision on the basis of a failure to recognise any patent error. In the present case, however, there was no such evidence that would permit the conclusion, even on a prima facie standard, that the Variation Works which LJH claimed for were actually carried out and completed.\n148 I am mindful that each case should be decided on its specific facts, and it would not be prudent to set out a generalised view on what would constitute sufficient evidence that works claimed for have been completed. Therefore, the extent of detail of the evidence presented in Comfort Management might not be necessary in every case. However, adjudicators cannot possibly be satisfied as to the completion of construction works, and the value of such works, by relying only on unaccepted and unsubstantiated quotations or progress claims from contractors or subcontractors.\n149 I thus find the dearth of evidence that the Variation Works were completed to be a patent error. By determining that the Variation Works had been completed, and the value of such works, solely on the strength of unaccepted and unsubstantiated quotations and a single unsigned progress claim, the Adjudicator had failed to recognise that patent error.\n(2) There were multiple inconsistent quotations for the same works\n\n150 Mdm Wee also argues that there were multiple inconsistent quotations for particular items of Variation Works which LJH claimed for, and that these inconsistent quotations constitute patent errors. In particular:\n(a) The Adjudicator relied on the Yong Chow quotation (for $12,800) dated 21 September 2016 in determining that LJH was entitled to $12,800 for Yong Chow's installation of the \"Entrance Porch Feature Walls\". However, there was a later accepted quotation by Yong Chow for the same work enclosed in LJH's Adjudication Application dated 28 September 2016. This later quotation indicated that Yong Chow had quoted a lower sum of $10,000 for the same works.\n(b) The Adjudicator relied on the Yong Chow quotation (for $12,674.15) dated 7 February 2017 in determining that LJH was entitled to $7,500 for Yong Chow's installation of the \"Additional Electrical Point\". However, there was a subsequent revised quotation dated 15 February 2017 for the same work which was likewise enclosed in LJH's Adjudication Application. This later quotation indicated that Yong Chow had quoted a lower sum of $6,543.05 for the same works.\n151 I accept that the multiple inconsistent quotations constitute patent errors in LJH's payment claim as they contradict the claimed amount (see Comfort Management at [23]). These errors are obvious, manifest or otherwise easily recognisable from documents that were properly filed and placed before the Adjudicator. Moreover, the Adjudicator had not indicated in the Adjudication Determination that he had applied his mind to these inconsistent quotations and made a judgment call as to which quotations to rely on. I therefore find that the Adjudicator had failed to recognise these patent errors in making his determination.\n(3) Clause 12.(5)(a) of the SIA Conditions was not satisfied\n\n152 Finally, Mdm Wee points out that clause 12.(5)(a) of the SIA Conditions, which are incorporated into the Contract by virtue of Clause 5.1 of the Contract (see [6(c)] above), provides that payment for variation works is contingent on the variation being ordered in writing by the architect or confirmed by or to the architect in accordance with the requirements of clause 1.(1) of the SIA Conditions. However, Mdm Wee contends that there was no evidence of any written instructions or requests for the alleged Variation Works, nor that the works even constituted variations. In response, LJH submits that it is untrue that there was no evidence of any instruction or request for the alleged Variation Works; it argues that Mdm Wee had signed quotations from third party contractors on two occasions.\n153 In this regard, the court in Comfort Management observed at [89]-[90] that:\n89 ... We recognise that standard form construction contracts, which may be said to reflect industry practice, generally require variations in the contract to provide for a change in the scope of construction work contemplated to be effected in writing. However, it is not invariably the case that the absence of writing, or more generally, the failure to follow the prescribed procedure, will disentitle the party who has performed the variation works from claiming payment for those works. Thus it is said in Chow Kok Fong, Law and Practice of Construction Contracts, vol 1 (Sweet & Maxwell, 4th Ed, 2012) at para 5.25:\nThe effect of contractual provisions such as those cited here is that, except for situations which have been specifically exempted, a written variation order serves as a condition precedent for payment of the variation work. If a contractor ignores the requirement for a written variation order, as a general principle, he cannot be found to complain subsequently if he is not paid for the varied work, nor can he contend that he should be paid a reasonable sum for the work merely on the premise that the employer had the benefit of the variation work. However, in a suitable situation, the employer may be estopped by his conduct from denying liability to pay notwithstanding the non-compliance with the formalities stipulated in the contract.\n90 This passage suggests that the absence of documents that demonstrate formal compliance with the contractually prescribed procedure for variation works is not necessarily fatal to a claim for variation works. That gives the impression that such absence does not inexorably translate into a patent error in the payment claim. All it means is that the contractor bears the risk of proving that the variation was ordered by the employer in the absence of a written variation order. ...\n[emphasis added]\n154 It is clear from the passage above that the absence of written instructions or requests for variations did not automatically disentitle LJH from being paid for work done under a variation order. Thus, even if LJH did not produce evidence of such written instructions or requests, I cannot conclude that such an omission constituted a patent error which the Adjudicator failed to recognise.\nLJH's claim for release of the Retention Sum\n\n155 The conditions for the release of the Retention Sum to LJH are contained in the following clauses of the SIA Conditions, which are incorporated into the Contract by virtue of Clause 5.1 of the Contract (see [6(c)] above):\n(a) Clause 31.(9) of the SIA Conditions provides that the first half of the Retention Sum is due only upon issuance of the Completion Certificate.\n(b) Clause 31.(10) of the SIA Conditions provides that the second half of the Retention Sum is due only upon the issuance of the Final Certificate at the expiry of the Maintenance Period or upon the issuance of the Maintenance Certificate.\n156 Mdm Wee's position is that, as the Completion Certificate and the Maintenance Certificate have not been issued, the Retention Sum should not be released. Conversely, LJH's position is that the Retention Sum should be released because the TOP certificate had been issued on 22 May 2019.\n157 On the face of PC 21, however, it appears to me that LJH had conceded that the Retention Sum should not be released. In a summary table enclosed in PC 21, the words \"Less 10% Retention (Limit 5% -$102,997.00)\" and \"Less Previous Payment (1 - 16)\" are included in the \"Description\" column, while the value of $929,777.95 is included in the \"Amount claimed ($)\" column. That summary table is produced below in Figure 1:\nFigure 1: Summary table of PC 21\n158 From the summary table of PC 21, it is apparent that LJH's position in PC 21 was that the Retention Sum should not be released, and LJH had purported to deduct from the amount claimed the sum of $929,777.95 representing both the sums previously paid by Mdm Wee and the Retention Sum of $102,997. However, the figure of $929,777.95 in the summary table did not in fact include the Retention Sum, but comprised only the sums previously paid by Mdm Wee. It appears to me that LJH's contradictory position in the present proceedings (ie, that the Retention Sum ought to be released) is an attempt to backpedal from its position taken in PC 21, given what transpired later (ie, the Adjudicator awarding an amount to LJH that included the retention sum).\n159 However, even though the amount which the Adjudicator awarded to LJH included the retention sum, it is clear that the Adjudicator did not decide that the Retention Sum should be released to LJH, and in fact intended to deduct both the Retention Sum and the amounts previously paid by Mdm Wee from the Adjudicated Amount. The Adjudicator stated in the Adjudication Determination that LJH was entitled to the Adjudicated Amount of $694,696.76, setting out the breakdown of the Adjudicated Amount in a table. In that table, the Adjudicator deducted a sum of $929,777.95 corresponding to the following description:\nLess 10% Retention (Limit 5%-$102,997.00\nLess Previous Payment (1-16).\n160 Before me, counsel for LJH accepted that the Adjudicator did not decide that the Retention Sum should be released, nor did he even consider the issue as to whether it should be released despite the fact that no Completion Certificate and Maintenance Certificate had been issued. What in fact happened was that the Adjudicator had simply assumed that the figure of $929,777.95 stated in PC 21 represented both the amounts previously paid by Mdm Wee and the Retention Sum. Counsel for LJH accepted at the hearing before me that the Adjudicator did make this assumption. As already mentioned (at [159] above), LJH did not in fact make any deductions to the sum claimed in PC 21 to account for the Retention Sum. In other words, its computations for the sum of $686,380.21 claimed by it in the adjudication proceedings included the Retention Sum.\n161 I find this to be a patent error which the Adjudicator has failed to recognise. It was an error that would have been fairly obvious on the face of the documents placed before the Adjudicator, if they were scrutinised properly. The summary of PC 21 (produced above at [157]) indicates that the total value of the works claimed by LJH was $1,616,158.16, from which prior payments of $929,777.95 and the Retention Sum of $102,997.00 were to be deducted. That would amount to a figure of $583,383.21. Yet, the amount stated to be due was $686,380.21. Moreover, a document titled \"Summary of Previous Payment\" enclosed in PC 21 also indicates that Mdm Wee had paid $929,777.95 by way of previous payments. Had the Adjudicator paid closer attention to the documents before him, he would have detected the patent error, namely, that the sum of $929,77.95 stated in PC 21 did not include the Retention Sum which ought to have been deducted from LJH's claim. Indeed, it is evident from the Adjudication Determination that the Adjudicator had not detected the patent error. He simply deducted the sum of $929,777.95 from the amount to be awarded to LJH on the assumption that that sum comprised both the sums previously paid by Mdm Wee and the Retention Sum (see above at [160]).\n162 LJH contends that Mdm Wee should have raised her objections in relation to the Retention Sum either in her adjudication response or during the adjudication proceedings. I make two observations in this regard.\n163 First, although it was open to Mdm Wee to raise patent errors to the Adjudicator during the Adjudication Proceedings notwithstanding her omission to file a payment response (see above at [133]), the point remains that it is the Adjudicator's independent duty to address his mind to and consider the true merits of a payment claim, regardless of whether any payment response has been filed (Comfort Management at [34]). The purpose of allowing a respondent to raise patent errors despite the failure to file a payment response is to strike \"the proper balance\" between two competing sets of principles: (i) the respondent's disentitlement from relying on reasons for withholding payments he could have included in a payment response but did not by virtue of s 15(3)(a) of the SOPA and under a waiver or promissory estoppel analysis; and (ii) the right of the respondent to the proper conduct of adjudication proceedings (see Comfort Management at [67]-[68]). The purpose is not to ameliorate a breach of the adjudicator's duties under the SOPA.\n164 Second, Mdm Wee's failure to issue a payment response is a result of her having learnt of PC 21 and the Adjudication Application on 15 June 2021 (as I found above at [85]). It is unrealistic to expect Mdm Wee to have had time to go through LJH's Adjudication Application, detect the patent errors and bring them to the Adjudicator's attention on such short notice before the Adjudication Determination was issued on 18 June 2021.\nConclusion on whether the Adjudicator had breached his duties under the SOPA in failing to recognise patent errors\n\n165 In conclusion, I find that the following constitute patent errors:\n(a) the absence of any evidence that the Variation Works which LJH claimed for in PC 21 were carried out and completed;\n(b) the multiple inconsistent quotations for particular items of Variation Works which LJH claimed for; and\n(c) LJH's failure to deduct the Retention Sum from the claimed sum.\n166 I find that the Adjudicator failed to recognise the abovementioned patent errors in rendering his Adjudication Determination (see [149], [151] and [161] above). It follows that the Adjudicator breached his duty prescribed by ss 17(2) and 17(4) of the SOPA to adjudicate the payment claim, ie, his duty to be satisfied on a prima facie basis of the completion and proper value of the construction work which formed the subject of the payment claim (see Comfort Management at [83]). Accordingly, I find that the Adjudication Determination may be set aside by the court under s 27(8)(a) of the SOPA.\nIssue 4: Whether the impugned parts of the Adjudication Determination may be severed\n\n167 I next consider whether the portions of the Adjudication Determination which I have found to be tainted by fraud or patent errors may nevertheless be severed from the remainder of the Adjudication Determination, so as to permit the claimant to retain the balance of the adjudicated sum that is unaffected by fraud or patent errors.\nPrinciples applicable to severance\n\n168 Section 27(8)(a) of the SOPA provides that a court may, in any proceedings commenced by a respondent to set aside an adjudication determination, set aside an adjudication in whole or in part. Under the common law as well, the court has the power to sever an adjudication determination in part (Rong Shun Engineering & Construction Pte Ltd v CP Ong Construction Pte Ltd [2017] 4 SLR 359 (\"Rong Shun\") at [157]).\n169 The test for determining the severability of an adjudication determination was stated in the following terms by the court in Rong Shun at [155]:\n(a) A part of an adjudication determination is severable if it is both textually severable and substantially severable from the remainder of the determination.\n(b) A part of a determination is textually severable if, after disregarding the textual elements of the adjudicator's determination on that part (including his reasons in writing supporting that part given under s 17(2) of the SOPA read with s 16(10) of the SOPA (formerly s 16(8) of the 2006 SOPA)), what remains of the adjudicator's determinations is still grammatical and coherent.\n(c) A part of a determination is substantially severable if the remainder of the determination which is to be upheld as valid, and which is to carry interim finality and be enforced, may be identified in terms of liability and quantum, without the need for adjustment or contribution to the content of the remainder by the court.\n(d) The court may modify the text of the adjudicator's determination to achieve severance if the court is satisfied that it is effecting no change in the substantial effect of the adjudication determination after accounting for the jurisdictional error and its necessary editorial consequences.\nSeverance of an adjudication determination tainted by fraud\n\n170 Where an adjudication determination has been obtained by fraud, the court must additionally weigh the policy consideration of upholding public confidence in the administration of justice against that of facilitating cash flow under the SOPA. Therefore, the starting point is that an adjudication determination that has been corrupted by fraudulent conduct would be tainted in its entirety, and the whole must fail. Such a determination would only be severed in exceptional and extremely limited circumstances where the fraud is de minimis both in nature and quantum. Factors that the court may consider include (i) the nature of the fraud; (ii) the quantum of the claim affected by the fraud; and (iii) the requirements of textual and substantial severability: see Facade Solution at [61].\n171 In the present case, I have found that the Adjudication Determination was tainted by fraud by virtue of (see above at [127]):\n(a) LJH's claim for payment for the Variation Works done by Yong Chow which it knew or ought reasonably to have known that it was not entitled to; and\n(b) LJH's representations as to the amounts previously paid by Mdm Wee to LJH and Dong Cheng which it knew or ought reasonably to have known were false.\n172 The Court of Appeal in Facade Solution cited the Queensland Supreme Court decision of Hansen Yuncken Pty Ltd v Ian James Ericson Trading as Flea's Concreting [2011] QSC 327 (\"Hansen Yuncken\") as an example of de minimis fraud. In that case, the claimant had fraudulently inflated his actual labour costs incurred by adding a profit margin and overhead of 12% to his labour rates. The court found that the fraud was de minimis as it related to a discrete component of the claim and the impact of the fraud had been precisely proved (Hansen Yuncken at [146]).\n173 In relation to LJH's claim for payment for the Variation Works done by Yong Chow, I have found that $60,322 was awarded to LJH by the Adjudicator pursuant to fraudulent claims by LJH for sums to which it was not entitled (see [79]-[86] above). In relation to LJH's representations as to the amounts previously paid by Mdm Wee to LJH and Dong Cheng, LJH had falsely represented that Mdm Wee had previously paid a total of $929,777.95 when in reality, she had paid $1,207,405.35 (see [96]-[108] above) - in other words, around $277,627.40 of the amount determined by the Adjudicator as due to LJH was tainted by fraud in that regard.\n174 Unlike in Hansen Yucken, the fraud in this case did not relate to a discrete component of LJH's claim. Moreover, the quantum of the claim affected by the fraud cannot, by any measure, be considered de minimis given that at least $337,949.40 (being $60,322 plus $277,627.40) of the sum awarded to LJH has been tainted by fraud. This amounts to around 49.2% of the amount claimed by LJH ($686,380.21) and around 48.6% of the amount determined by the Adjudicator as being due from Mdm Wee ($694,696.76, inclusive of 7% GST).\n175 Following the approach taken in Facade Solution, I am of the view that the court should not lightly disregard the conduct of LJH in this case. It is clear that LJH has abused the SOPA regime by fraudulently obtaining a determination in its favour of over $270,000 on claims which it knew, or at least ought to have known, had no factual or legal basis. In fact, when one views LJH's conduct as a whole, in particular the way it attempted to serve PC 21 on Mdm Wee by email when it had never done so in the past, this is quite likely a case where LJH was attempting to claim as much money from Mdm Wee as possible, with the hope that she would be taken by surprise and would have no time to react. I do not find that this is a case where cashflow is crucial to LJH, given that LJH waited for almost two years after it last did any work on the Project in 2019 (at least according to its case) before attempting to serve PC 21 on Mdm Wee on 30 April 2021. LJH has given no explanation whatsoever in its affidavits (affirmed by Mr Li) to account for this delay. I find that this would not be the exceptional type of case where the court should allow the portions of the Adjudication Determination affected by fraud to be severed - the policy consideration of facilitating cash flow does not outweigh the need to uphold public confidence in the administration of justice in this case (see Facade Solution at [61]). As such, putting aside the question of whether the tainted parts are substantially and textually severable, I decline to exercise my discretion to sever the Adjudication Determination, which should therefore be set aside in its entirety.\nSeverance of an adjudication determination where the adjudicator has overlooked patent errors\n\n176 Given my conclusion above at [175] that the Adjudication Determination should be set aside in its entirety for being tainted by fraud, it is not necessary for me to decide if the parts of the Adjudication Determination affected by the Adjudicator's failure to recognise patent errors are severable.\n177 Nevertheless, I make the following observations. There are no Singapore authorities setting out what considerations the court should take into account in deciding whether to sever parts of an adjudication determination where the Adjudicator has breached his duties under the SOPA by failing to recognise patent errors. The considerations applicable to adjudication determinations tainted by fraud may provide some helpful guidelines. If one is to take a similar approach, the court must balance the policy consideration of ensuring that Adjudicators discharge their duties under the SOPA against that of facilitating cash flow. An appropriate balance may be struck by considering the nature of the patent error(s), the quantum of the claim affected by the patent error(s), and the requirements of textual and substantial severability.\n178 However, I would add that, while the court should only sever an adjudication determination affected by fraud in extremely limited situations, the same standard probably should not be applied to adjudication determinations affected by patent errors. Fraudulent conduct is far more opprobrious than a failure by an adjudicator to recognise patent errors, and courts can afford to be less hesitant to sever adjudication determinations in the latter situation.\nIssue 5: Whether the Adjudication Determination should be set aside for breaches of natural justice\n\n179 Section 16(5)(c) of the SOPA provides that an adjudicator must comply with the principles of natural justice. Further, s 27(6)(g) provides that a party may apply to set aside an adjudication determination on the ground that a breach of the rules of natural justice has occurred in connection with the making of the adjudication determination. The court has accordingly set aside adjudication determinations where the adjudicator has acted in breach of his duty to comply with the requirements of natural justice: see eg, Citiwall Safety Glass Pte Ltd v Mansource Interior Pte Ltd [2015] 1 SLR 797 at [47], citing SEF Construction Pte Ltd v Skoy Connected Pte Ltd [2010] 1 SLR 733 at [45].\nPrinciples applicable to natural justice\n\n180 As set out in Bintai Kindenko Pte Ltd v Samsung C&T Corp [2018] 2 SLR 1311 at [34], there are two facets to the principles of natural justice. First, the parties to the adjudication must be accorded a fair hearing (the \"fair hearing rule\"). Second, the adjudicator must have been independent and impartial in deciding the dispute (the \"no bias rule\").\n181 The standard of proof to be met to establish a breach of the rules of natural justice is that of a balance of probabilities. In particular, the party seeking to set aside the determination must show, on a balance of probabilities, that (i) there has been a material breach of natural justice (ii) which has caused it to suffer prejudice (Glaziers Engineering Pte Ltd v WCS Engineering Construction Pte Ltd [2018] 2 SLR 1311 at [34]-[35]). Importantly, the prejudice to be demonstrated is \"conceptually distinct from the fact of the breach\" (L W Infrastructure Pte Ltd v Lim Chin San Contractors Pte Ltd and another appeal [2013] 1 SLR 125 (\"L W Infrastructure\") at [78]). If it were otherwise, every breach of the rules of justice could constitute some form of prejudice (Soh Beng Tee & Co Pte Ltd v Fairmount Development Pte Ltd [2007] 3 SLR(R) 86 (\"Soh Beng Tee\") at [84]).\n182 In this case, Mdm Wee has alleged breaches of both the fair hearing rule and no bias rule. I will consider in turn if either rule has been breached.\nWhether the fair hearing rule has been breached\n\n183 An essential feature of natural justice is fairness, which encompasses the right to be heard, ie, each party's right to present its case and respond to the case against it (Manjit Singh s/o Kirpal Singh and another v Attorney-General [2013] 2 SLR 844 (\"Manjit Singh\") at [88]; Soh Beng Tee at [42]). In upholding the right to be heard, \"[t]he best rule of thumb to adopt is to treat the parties equally and allow them reasonable opportunities to present their cases as well as to respond\" [emphasis added] (Soh Beng Tee at [65(a)]). What fairness demands, however, will vary based on factors including the character of the decision-making body and the kind of decision it must make, the statutory or other framework in which it operates, and the object of the process at the stage in question (Manjit Singh at [88]).\n184 Mdm Wee alleges that the fair hearing rule has been breached as the Adjudicator had made his determination based on matters which he did not give Mdm Wee a fair opportunity to address. In particular, she argues that:\n(a) The Adjudicator had made his decision on whether PC 21 was validly served based on an email dated 17 June 2015 (the \"17 June 2015 Email\") provided by LJH on the evening of 16 June 2021 (which was enclosed in LJH's fourth set of submissions). Without giving Mdm Wee an opportunity to address him on that email, he rendered his decision two days later on 18 June 2021.\n(b) LJH had submitted a total of three sets of further submissions on 16 June 2021 (the second to fourth sets). Specifically, LJH's second set of submissions of 16 June 2021 cross-referenced the supporting documents in its Adjudication Application, to a summary table of the Variation Works that formed part of its claim. Likewise, the Adjudicator issued his determination on 18 June 2021 without giving Mdm Wee a chance to address him on LJH's further submissions.\n185 Mdm Wee also points out that it was possible for the Adjudicator to afford her an opportunity to be heard by convening an adjudication conference or extending the time for making his determination.\n186 On the other hand, LJH contends that there was no breach of Mdm Wee's right to be heard as it was open to her to make the necessary written submissions or responses, or request for such an opportunity to do so. Moreover, it argues that the Adjudicator was not obliged to request for a longer period of time for him to make his determination.\n187 Thus, two questions arise for my consideration:\n(a) First, did the Adjudicator breach Mdm Wee's right to be heard by depriving her of an opportunity to address him on the new material adduced by LJH?\n(b) If there has been a breach of Mdm Wee's right to be heard, has Mdm Wee suffered prejudice as a result of that breach?\nWas there a breach of Mdm Wee's right to be heard?\n\n188 As mentioned above at [183], the core of a party's right to be heard is its right to present its case and to respond to the case against it. I agree with Mdm Wee that the Adjudicator's failure to afford her an opportunity to address him on queries he posed to LJH and the new material adduced by LJH in response to those queries, prevented her from being able to fairly respond to the case against her, and thus constituted a violation of her right to be heard and consequently, the fair hearing rule.\n189 In particular, I am of the view that Mdm Wee was deprived of a fair opportunity to be heard by reason of (i) the Adjudicator's failure to ask Mdm Wee and her solicitors whether Mdm Wee wished to respond to the new material adduced by LJH; and (ii) relatedly, the Adjudicator's failure to request for an extension of time to render his determination in order to receive further submissions from Mdm Wee or to convene an adjudication conference to hear the parties.\n(1) The Adjudicator's failure to ask Mdm Wee and her solicitors whether Mdm Wee wished to respond to new material adduced by LJH\n\n190 In my view, Mdm Wee's right to be heard has been infringed by the Adjudicator's failure to ask her and her solicitors whether Mdm Wee wished to respond to the new material adduced by LJH. Here, the Adjudicator had emailed LJH on 16 June 2021 (with Lee & Lee copied) to enquire how past payment claims were served on Mdm Wee, and received LJH's response on the same day. Likewise, the Adjudicator had only received LJH's second set of submissions containing the cross-references to documents pertaining to the Variation Works on 16 June 2021. However, the Adjudicator did not then ask Lee & Lee whether Mdm Wee intended to reply or respond to LJH's points and documents submitted on 16 June 2021. He simply proceeded to issue his determination on 18 June 2021, which relied on the points and documents submitted by LJH on 16 June 2021. I find that the Adjudicator's conduct in this case constitutes a breach of the fair hearing rule, as it effectively deprived Mdm Wee of an opportunity to respond to the case against her.\n191 I am fortified in my conclusion by the Court of Appeal's decision in L W Infrastructure, a case concerning the setting aside of an arbitral award. In that case, after the arbitrator had rendered a final award, the defendant had written to the arbitrator (copying the plaintiff) to request an additional award of pre-award interest pursuant to s 43(4) of the Arbitration Act (Cap 10, 2002 Rev Ed). The arbitrator rendered an additional award of pre-award interest merely three days after the defendant had submitted its request, even before the plaintiff had responded on the applicability of s 43(4). In finding there that the additional award was made without affording the plaintiff an opportunity to be heard, the Court of Appeal affirmed at [75] the High Court Judge's finding that the short time given for the plaintiff to respond was unreasonable, and that the arbitrator should have \"contacted the plaintiff to ascertain whether it intended to object to the making of the Additional Award\". In my view, the Adjudicator in the present case should likewise have contacted Mdm Wee and/or Lee & Lee to ascertain whether Mdm Wee intended to address him on the new material adduced by LJH. If so, the Adjudicator could then have sought an extension of time to issue his determination to afford Mdm Wee an opportunity to address him, which is a point I discuss below at [193]-[199].\n192 LJH argues that Lee & Lee could and ought to have tendered Mdm Wee's submissions to the Adjudicator on 17 or 18 June 2021, and he would then have been obliged to consider those submissions pursuant to s 17(4)(g) of the SOPA. I recognise that the email containing the Adjudicator's queries directed to LJH was sent to Lee & Lee as well. However, Mdm Wee's evidence is that she had only learnt of LJH's Adjudication Application on 15 June 2021 and appointed Lee & Lee on 16 June 2021. Her solicitors had, on the same day, requested a copy of the Adjudication Application. Even assuming that Mdm Wee and Lee & Lee received the Adjudication Application immediately thereafter, two days would hardly be enough time for them to go through LJH's Adjudication Application, discuss the issues, and formulate responses to the queries posed by the Adjudicator to LJH on 16 June 2021. In my view, Mdm Wee cannot be said to have received a fair or reasonable opportunity to address the Adjudicator on the queries that he posed, and the material adduced by LJH in its case against her. In the premises, I find that there has been a breach of the fair hearing rule.\n(2) The Adjudicator's omission to request for an extension of time to issue his determination\n\n193 Relatedly, I am of the view that the Adjudicator's decision not to request for an extension of time to issue his determination in order to receive further arguments from Mdm Wee or to convene an adjudication conference had resulted in a breach of the fair hearing rule.\n194 By an email dated 16 June 2021 sent at 10.33am, Lee & Lee invited the Adjudicator to consider requesting for an extension of time and indicated that Mdm Wee would not oppose a request by the Adjudicator for a longer period of time to render the Adjudication Determination. In response, however, the Adjudicator stated in an email sent on the same day at 11.09am that \"[a]s there has been no payment response or Adjudication Response, the provisions of the act do not allow for extension of time for the Adjudication Determination that stand [sic] at 18 June 2021\".\n195 In my view, the Adjudicator might have been operating under a misapprehension that he could not request for an extension of time to issue his determination if there had been no payment response or adjudication response served by Mdm Wee. If so, that would be an erroneous reading of the SOPA. Section 17(1)(a) of the SOPA provides that an adjudicator must determine an adjudication application \"within 7 days after the commencement of the adjudication ... or within such longer period as may have been requested by the adjudicator and agreed to by the claimant and the respondent\". Therefore, the possibility of an extension exists even in situations when there is no payment response and/or adjudication response, subject to the extension being agreed to by the parties. That makes sense, because the respondent can still raise jurisdictional objections or flag out patent errors, even if no payment response or adjudication response has been served (see [133] above). An extension of time might allow a respondent sufficient time to make written submissions on these points concerning jurisdiction and/or patent errors.\n196 Likewise, an extension of time might allow an adjudication conference to be held, where a respondent can then raise any points concerning jurisdiction and/or patent errors. Section 16(6)(e) of the SOPA provides that an adjudicator may call a conference of the parties. The Practice Directions to Adjudicators PD01-17, issued by the SMC (the Authorised Nominating Body under the SOPA) (the \"Practice Directions\"), states at para 2.1 that the purpose of an adjudication conference is to allow parties an opportunity to air their concerns and for the adjudicator to clarify any doubts he may have regarding the cases submitted by parties. The Practice Directions further states at para 2.3 that, although the wording of s 16(6) of the SOPA (formerly s 16(4) of the 2006 SOPA) is permissive, adjudicators should nonetheless hold an adjudication conference unless there are compelling reasons not to do so. It goes on to give an example of what would be a \"compelling reason\", which is where the sum is in dispute is less than S$25,000.\n197 In the present case, as stated in the Adjudication Determination, by an email sent to LJH, Mdm Wee and Lua Architects on 14 June 2021, the Adjudicator had directed an adjudication conference to be held on 16 June 2021. LJH and the Architect wrote back on the same day saying that they were unavailable on that date. There was no response from Mdm Wee, whose evidence is that she only learnt about the ongoing adjudication proceedings on 15 June 2021 at a meeting with Mr Lua (see above at [16]). The Adjudicator then found himself unable to convene an adjudication conference owing to \"the short timeline to the Adjudication Determination (18 June 2021)\". Given that LJH itself, the claimant in the proceedings before the Adjudicator, had indicated that it was unavailable to attend an adjudication conference on 16 June 2021, I am of the view that there was no good reason for the Adjudicator not to have requested for an extension of time to issue his determination in order to hold an adjudication conference on a later alternative date, when both LJH and Mdm Wee would be available to attend. Had the Adjudicator requested for an extension of time, and the parties had agreed to his request, the Adjudicator might have been able to convene an adjudication conference during which Mdm Wee could have been given a fair and reasonable opportunity to be heard. For instance, Mdm Wee could have raised jurisdictional issues such as the invalid service of PC 21 on her by email (see [63] above), as well as patent errors such as the lack of evidence of the completion of Variation Works which LJH had claimed for in PC 21 (see [149] above).\n198 LJH points out that the Adjudicator's discretion to extend the time for determining an adjudication application is in any event subject to agreement by both LJH and Mdm Wee. However, there is no evidence before me that LJH would not have consented to a request by the Adjudicator for more time to allow an adjudication conference to be held, or for Mdm Wee's solicitors to respond to the new points and documents raised by LJH. For the latter, I find that the Adjudicator should have asked Lee & Lee if Mdm Wee intended to respond to LJH's new material submitted on 16 June 2021. If the answer was in the affirmative, the Adjudicator could have given them a reasonable time to respond in writing, and asked the parties for an extension of time for him to issue his determination. In fact, Lee & Lee had already invited the Adjudicator to consider requesting for an extension of time and indicated that they would not object to such a request (see [194] above).\n199 In my judgment, the situation that presented itself to the Adjudicator was one where it would have been entirely appropriate for him to have requested an extension of time to issue his determination. Since he did not do so, I cannot conclude based on the material before me that LJH would have refused to agree to any such request by the Adjudicator for an extension of time. As a consequence of the Adjudicator's decision that he would issue his determination by 18 June 2021, without any request for an extension of time, Mdm Wee was deprived of the opportunity to properly respond to the new material submitted by LJH. I therefore find that the fair hearing rule has been breached in this regard as well.\nHas Mdm Wee suffered prejudice?\n\n200 I also find that Mdm Wee was prejudiced by the Adjudicator's failure to afford her a fair and reasonable opportunity to respond to the new material adduced by LJH, by reason of his decision to issue his determination by 18 June 2021 without (i) asking Mdm Wee (and her solicitors) whether they wished to respond to the new material; or (ii) requesting for an extension of time to issue his determination. Although Mdm Wee points out that LJH had submitted three sets of further submissions on 16 June 2021, she has only elaborated on how she was prejudiced by the Adjudicator's failure to afford her a reasonable opportunity to respond to the 17 June 2015 Email (enclosed in LJH's fourth set of submissions) and LJH's second set of submissions.\n(a) In relation to the 17 June 2015 Email, Mdm Wee could have, if given the opportunity, highlighted that (i) the email contained queries about a payment claim and was not service of a payment claim; and (ii) Mdm Wee had never replied to that email because she did not check her emails regularly (see [60] above). Given that that was the only piece of evidence that the Adjudicator relied on in concluding that the service of PC 21 by email was consistent with the parties' past practice, had Mdm Wee been given the opportunity to respond to the 17 June 2015 Email, my view is that it could have made a material difference to the Adjudicator's conclusion that there was valid service of PC 21.\n(b) In relation to LJH's second set of submissions wherein it cross-referenced the documents submitted for the Variation Works forming part of its claim, Mdm Wee was also prejudiced. In this regard, I note that the Adjudicator himself remarked that he initially faced difficulties in adjudicating LJH's claims for the Variation Works because there was no-cross referencing done between the summary table of the Variation Works claimed by LJH, and the supporting documents which numbered over 500 pages. It was only after the Adjudicator had received LJH's second set of submissions on 16 June 2021 that he could make sense of LJH's claim for Variation Works by cross-referencing the summary table of the Variation Works to the corresponding supporting documents produced by LJH. It is thus evident that the patent errors in LJH's claim for the Variation Works would only have become apparent after LJH had tendered its second set of submissions on 16 June 2021. Had Mdm Wee been given a reasonable opportunity to review LJH's second set of submissions and to address the Adjudicator on them, she could have detected and raised the patent errors in the documents in LJH's Adjudication Application - specifically, (i) that the quotations and/or Progress Claim 8 in the supporting documents did not evidence completion of the Variation works; and (ii) that there were multiple inconsistent quotations for the same works (see [140]-[151] above). As already mentioned (at [133] above), it is well established that a respondent is entitled to raise patent errors in the material before an adjudicator notwithstanding that a payment response has not been filed (Comfort Management at [66]-[67]).\nWhether the no bias rule has been breached\n\n201 An adjudicator has a statutory obligation to act impartially under both ss 16(5)(a) and 16(5)(c) of the SOPA (formerly ss 16(3)(a) and 16(3)(c) of the 2006 SOPA): Metropole Pte Ltd v Designshop Pte Ltd [2017] 4 SLR 277 (\"Metropole\") at [46]. Where an adjudicator fails to act impartially, an adjudication determination will be set aside by the court: JRP & Associates Pte Ltd v Kindly Construction & Services Pte Ltd [2015] 3 SLR 575 (\"Kindly Construction\") at [52].\n202 An adjudicator's duty to be impartial requires him to act without bias - actual or apparent: Kindly Construction at [53]. In her written submissions, however, Mdm Wee did not specify if she was alleging that there was actual or apparent bias on the Adjudicator's part. It does not appear to me that Mdm Wee is alleging actual bias on the part of the Adjudicator. In any event, she has not raised any evidence to substantiate actual bias. I therefore confine my discussion to whether there has been apparent bias on the Adjudicator's part.\n203 The test for apparent bias was set out by Sundaresh Menon JC (as he then was) in Re Shankar Alan s/o Anant Kulkarni [2007] 1 SLR(R) 85 at [91] and affirmed in the context of proceedings under the SOPA in Metropole at [47] and Kindly Construction at [53] - whether there are circumstances which would give rise to a reasonable suspicion or apprehension in a fair-minded reasonable person with knowledge of all the relevant facts that the decision-maker was biased.\n204 Mdm Wee alleges that the Adjudicator's apparent bias is evidenced by the following circumstances:\n(a) He had directed his inquiries to LJH alone, without inviting Mdm Wee to respond or comment on them.\n(b) Based on the 17 June 2015 Email alone, he found that the service of PC 21 was consistent with LJH's previous service of payment claims.\n(c) He considered whether PC 21 was served on Lua Architects even though that was irrelevant to whether PC 21 was served on Mdm Wee, and concluded that the receipt of PC 21 in Lua Architects' junk email folder was evidence of service on Mdm Wee.\n205 LJH's response is that there is no indication of any bias on the part of the Adjudicator because he had properly applied his mind to the evidence and was entitled to come to his view that PC 21 was validly served on Mdm Wee based on the materials and facts before him.\n206 I begin by reiterating that the context of the SOPA must be taken into consideration when one decides how the rules of natural justice apply in adjudication proceedings (see above at [183]). In particular, courts must be cognisant of the tight timelines given to an adjudicator to make a determination and the need for a quick method of adjudication to facilitate cash flow (Kindly Construction at [70]). For this reason, deficiencies in the reasoning or methodology of the adjudicator may be tolerable, given the concept of temporary finality whereby parties may seek a fuller ventilation of their arguments at another more thorough and deliberate forum (Kindly Construction at [70]).\n207 In the present case, I find that the Adjudicator's reasoning in finding that PC 21 was validly served on Mdm Wee, though deficient for the reasons I have stated above at [60], does not warrant a finding of apparent bias on his part. The Adjudicator had noted that LJH could not provide evidence of how past payment claims were served on Mdm Wee. The fact that the Adjudicator had posed further inquiries to LJH to seek evidence pertaining to the service of past payment claims shows that the Adjudicator was not prepared to accept LJH's submission that PC 21 was validly served on Mdm Wee at face value. In my view, the circumstances do not give rise to any reasonable suspicion or apprehension in a fair-minded reasonable person that the Adjudicator was biased solely by virtue of (i) his deficient reasoning that the service of PC 21 was consistent with that of past payment claims, or (ii) allegedly irrelevant considerations.\n208 As for the Adjudicator's decision to pose his queries only to LJH and his omission to invite Mdm Wee to comment on or respond to LJH's responses, I am likewise unable to conclude that those circumstances sufficed to ground a finding of apparent bias.\n209 In Metropole, it was argued that the adjudicator had been biased because he did not ask for the applicant's response in relation to questions he posed to the respondent. The applicant alleged that s 17(4)(g) of the SOPA (formerly s 17(3)(g) of the 2006 SOPA) placed a duty on the adjudicator to invite the applicant to respond. Section 17(4)(g) of the SOPA provides that, in determining an adjudication application, an adjudicator may only have regard to, among other things, the submissions and responses of the parties to the adjudication, and any other information or document provided at the request of the adjudicator in relation to the adjudication. This argument was rejected by Vinodh Coomaraswamy J, who observed (at [52], in relation to s 17(3)(g) of the 2006 SOPA):\nMetropole argues that s 17(3)(g) of the Act places on the adjudicator a duty to direct Metropole to respond. I disagree. Section 17(3)(g) provides that an adjudicator shall have regard to \"the submissions and responses of the parties to the adjudication, and any other information or document provided at the request of the adjudicator in relation to the adjudication\". This does not mean that parties can make no submissions and furnish no responses that the adjudicator has not requested. That is not the practice. The antecedent for the phrase \"at the request of the adjudicator\" in this context is only \"any other information or document\". In fact, s 17(3)(g) of the Act in my view would have operated to require the adjudicator to consider any response Metropole might have made to DPL's e-mail of 31 March 2016. Metropole might have more of an argument on apparent bias if it had asked for an opportunity to respond to DPL's e-mail but was denied it by the adjudicator, or if Metropole had actually responded to it and the adjudicator refused to take the response into account. But that is not what happened.\n[emphasis added]\n210 I agree with the views expressed. The failure of an adjudicator to invite a party to respond to certain matters would not normally constitute apparent bias. Mdm Wee's solicitors could have responded in writing to the new material, or made oral submissions at an adjudication conference. The problem in this case lay not in any perception of apparent bias, but simply because the Adjudicator had not afforded Mdm Wee a reasonable opportunity to respond to the new material adduced by LJH. As I have already explained, (i) by not asking Mdm Wee whether she intended to respond to LJH's new submissions and material before he issued his determination on 18 June 2021; and/or (ii) by not requesting for an extension of time for making his determination (to receive further arguments from Mdm Wee or to convene an adjudication conference on a day where both LJH's and Mdm Wee's solicitors could attend to address him on the new material adduced by LJH), the Adjudicator has breached the fair hearing rule (see [188]-[200] above).\nConclusion on whether there was a breach of natural justice\n\n211 I find that there was a breach of the rules of natural justice, specifically of the fair hearing rule. In particular, Mdm Wee's right to be heard was infringed by reason of the Adjudicator's failure to afford her a fair and reasonable opportunity to respond to the 17 June 2015 Email and LJH's second set of submissions, which were tendered in response to the Adjudicator's queries directed to LJH. Moreover, Mdm Wee had suffered prejudice as a result of that breach of the fair hearing rule. Therefore, I find that the Adjudication Determination should also be set aside under s 27(8)(a) of the SOPA for breach of the rules of natural justice.\nIssue 6: Whether LJH is barred from recovering money in court\n\n212 Mdm Wee submits that LJH is precluded from recovering any money in court as LJH, being an unlicensed builder, is prohibited from doing so by s 29B(4) read with s 29B(2)(a) of the BCA.\n213 Given my finding that the Adjudication Determination should be set aside in its entirety under s 27(8)(a) of the SOPA on the following grounds: (i) invalid service of PC 21 (see [63] above); (ii) fraud (see [118] above); (iii) the Adjudicator's failure to recognise patent errors (see [166] above); and (iv) breach of natural justice (see [211] above), it is not strictly necessary to consider this submission about LJH's lack of a proper licence under the BCA. Nonetheless, as this is a point that was raised and argued by the parties, I will express some tentative conclusions.\nDoes s 29B(4) of the BCA prohibit enforcement of adjudication determinations under the SOPA?\n\n214 To recapitulate, s 29B(4) of the BCA provides that a person who carries out any general building works or specialist building works in contravention of s 29B(2) is not entitled to recover in any court any charge, fee or remuneration for the general building works or specialist building works so carried out. Section 29B(2)(a) of the BCA in turn prohibits a person from carrying on the business of a general builder in Singapore unless he is in possession of a general builder's licence.\n215 The central question in these proceedings is whether a contractor who has carried out general building works without the requisite licence (in contravention of s 29B(2)(a) of the BCA) is precluded from enforcing an adjudication determination under s 27(1) of the SOPA by virtue of s 29B(4) of the BCA (which disentitles such a contractor from recovering any \"charge, fee or remuneration\" for the general building works in any court). Under s 27(1) of the SOPA, the court may grant leave for an adjudication determination obtained under the SOPA to be enforced \"in the same manner as a judgment or order of the court to the same effect\".\n216 Counsel for LJH submitted at the hearing before me that s 29B(4) of the BCA does not prevent LJH from enforcing an Adjudication Determination even if it is unlicensed. He pointed to s 5 of the SOPA which provides that any person who has carried out any construction work, or supplied any goods or services, under a contract is entitled to a progress payment. In my view, s 5 of the SOPA does not assist LJH. The question of whether LJH is entitled to progress payments or not is distinct from and irrelevant to the question of whether LJH can recover money in court by enforcing the Adjudication Determination under s 27(1) of the SOPA, contrary to s 29B(4) of the BCA.\n217 Section 29B(4) of the BCA must be interpreted in a manner that would promote the purpose or object underlying the written law, as mandated by s 9A(1) of the Interpretation Act 1965 (2020 Rev Ed). The purposive approach to statutory interpretation was laid out in the seminal case of Tan Cheng Bock v Attorney-General [2017] 2 SLR 850 at [37] and [54]:\n(a) The court must start by ascertaining the possible interpretations of the provision, having regard not just to the text, but also to the context, of the provision within the written law as a whole.\n(b) The court must then ascertain the legislative purpose or object of the statute. The purpose should ordinarily be gleaned from the text itself. However, extraneous material may be used to ascertain the meaning of the provision if the provision is ambiguous or obscure on its face.\n(c) The court then compares the possible interpretations of the provision against the purpose of the relevant part of the statute. The interpretation which furthers the purpose of the written text should be preferred.\n218 The task here is the proper interpretation of s 29B(4) of the BCA, in particular, whether it applies to the enforcement of adjudication determinations under s 27(1) of the SOPA. As for the possible interpretations of s 29B(4) of the BCA, I accept that it is unclear whether the recovery of \"any charge, fee or remuneration\" for building work carried out would include the enforcement of an adjudication determination obtained in respect of that building work under the SOPA, or whether it is limited to legal proceedings brought by the builder for the court to determine whether the builder is entitled to the charge, fee or remuneration for the building work that has been carried out.\n219 The text of s 29B(4) and Part 5A (in which s 29B(4) is situated) do not illuminate the legislative purpose of s 29B(4) of the BCA. The long title of the BCA also does not shed light on the purpose of s 29B(4) of the BCA. However, I note that s 4(2)(a) of the SOPA provides that the SOPA does not apply to any contract for the carrying out of construction work at or on any residential property which does not require the approval of the Commissioner of Building Control under the BCA. Put another way, building works on residential property which require the Commissioner of Building Control's approval under the BCA would be covered by the provisions of the SOPA. This suggests that the SOPA provisions, at least where residential property is concerned, are to be read subject to the BCA.\n220 As s 29B(4) of the BCA is ambiguous on its face, I turn next to consider secondary material which may shed light on Parliament's intent in legislating s 29B(4) of the BCA. Section 29B(4) of the BCA was enacted pursuant to clause 9 of the Building Control (Amendment) Act 2007 (No 47 of 2007). The Explanatory Statement of the Building Control (Amendment) Bill (Bill No 34/2007) (the \"BCA Bill\") states at page 94 that one of the main purposes of amending the BCA is to \"raise standards of work in the construction industry by licensing builders\". The Explanatory Statement further states at page 106:\nThe new section 29B makes it an offence to carry on the business of a general builder or specialist builder in Singapore except by or under the authority of a licence. The penalty is a fine of up to $20,000 or imprisonment of up to 12 months or both.\n221 During the Second Reading of BCA Bill, Minister Grace Fu stated that clause 9 of the BCA Bill was added to \"put in place a licensing scheme to set minimum standards of professionalism for builders\" and that \"[t]he proposed licensing scheme will ensure that our builders are professionally qualified and competent\". She further highlighted the need to ensure that penalties for non-compliance are harsh enough to \"reflect the true cost of poor safety management\": see Singapore Parliamentary Debates, Official Report (20 September 2007) vol 83 at cols 2057-2058 (Grace Fu, Minister of State for National Development).\n222 It is clear from the secondary material that the purpose of introducing the licensing regime in the BCA is to increase the overall standards of the construction industry. The purpose of introducing penalties through s 29B of the BCA (which include fines, imprisonment terms and prohibiting unlicensed builders from recovering money in court) is to deter builders in the construction industry from engaging in construction work without a licence. That would ensure that builders meet the statutory requirements to obtain a licence (prescribed under Part 5A of the BCA) which would enhance the overall safety standards and competency of the construction industry.\n223 Seen in that light, I find that interpreting s 29B(4) of the BCA as not precluding unlicensed builders from obtaining leave of court to enforce adjudication determinations under s 27(1) of the SOPA would be inimical to the legislative purpose of s 29B, which is to deter builders from engaging in construction works without a licence. Such an interpretation would diminish the deterrent effect of s 29B of the BCA as it would allow unlicensed builders to abuse the architecture of the SOPA to obtain remuneration for construction works, thereby circumventing the prohibition in s 29B of the BCA.\n224 Accordingly, in my judgment, it would further the legislative purpose behind the enactment of s 29B(4) of the BCA to interpret it as prohibiting builders who have contravened s 29B(2)(a) of the BCA from enforcing adjudication determinations under s 27(1) of the SOPA. In other words, I find that the prohibition against unlicensed builders recovering \"in any court any charge, fee or remuneration\" for building works under s 29B(4) of the BCA would include the process by which the builder seeks leave of the court under s 27(1) of the SOPA to enforce an adjudication determination obtained under the SOPA as a court judgment. As the court should not lend its aid to a breach of s 29B of the BCA by granting leave to an unlicensed builder to enforce an adjudication determination as a judgment or order of court, any such leave obtained by an applicant on an ex parte basis, like in this case, is liable to be set aside if it is established that s 29B(4) of the BCA applies.\nWas there a contravention of s 29B(2) of the BCA\n\n225 In view of my preceding observations, if I find that LJH has contravened s 29B(2)(a) of the BCA, it would follow that LJH is precluded by s 29B(4) of the BCA from recovering any money in court by enforcing the Adjudication Determination under s 27(1) of the SOPA. If so, the proper course would be for the court to set aside the leave that was granted earlier to LJH on an ex parte basis to enforce the adjudication determination.\n226 Section 29B(2)(a) of the BCA prohibits a person from carrying on the business of a general builder in Singapore unless he/she possesses a general builder's licence. I thus consider (i) whether LJH has carried on the business of a general builder by virtue of its works in respect of the Project; and (ii) if so, whether LJH possessed a general builder's licence when carrying out those works.\nWhether LJH carried on the business of a general builder\n\n227 I first consider whether LJH has carried on the business of a general builder by virtue of its works in respect of the Project. Section 2 of the BCA defines:\n(a) \"builder\" as one who undertakes to carry out any building works for the person's own account or for or on behalf of another person;\n(b) \"building\" as any permanent or temporary building or structure;\n(c) \"building works\" as among other things, (a) the erection, extension or demolition of a building and (b) the alteration, addition or repair of a building; and\n(d) \"general building works\" as building works other than specialist building works.\n228 In this case, LJH was engaged by Mdm Wee to erect a two-storey detached dwelling house (see [6] above), which constitutes \"general building works\" as it does not fall within the list of specialist building works specifically set out under s 2 of the BCA.\n229 Section 29A(1) of the BCA defines \"building works\" as any building works to which Part 2 of the BCA applies. Section 4 of the BCA provides that Part 2 of the BCA applies to all buildings works subject to certain exceptions. These exceptions do not apply to the works done by LJH.\n230 Section 29A(2)(a) of the BCA further provides that, for the purposes of Part 5A (which contains s 29B), a person carries on the business of a general builder if the person undertakes to carry out general building works for or on behalf of another person for a fixed sum, percentage, or valuable consideration, or reward other than wages, but not if the person carries out, or undertakes to carry out, general building works only as a sub-contractor. In the present case, LJH had undertaken to carry out general building works for Mdm Wee for consideration of $2,059,940 (see [6] above). I thus find that LJH has carried on the business of a general builder for the purposes of ss 29A and 29B of the BCA.\nWhether LJH possessed a general builder's licence when carrying out works in respect of the Project\n\n231 I next consider whether LJH was in possession of a general builder's licence whilst it was carrying out general building works in respect of the Project. As a preliminary point, Mr Li argues that a general builder's licence is only necessary for building works where plans are required to be approved by the Commissioner of Building Control. That point may be briefly disposed of. As alluded above at [219], s 4(2)(a) of the SOPA provides that the SOPA does not apply to any contract for the carrying out of construction work at or on any residential property which does not require the approval of the Commissioner of Building Control under the BCA. Hence, if Mr Li is suggesting that the works carried out by LJH on the Property were building works which did not require the approval of the Commissioner of Building Control, that would disqualify LJH from utilising the SOPA regime in the first place.\n232 It is not disputed that LJH is not presently in possession of a general builder's licence. However, at the hearing before me, counsel for LJH showed the court LJH's builder's licence evidencing that LJH was a licensed builder from 20 July 2014 to 20 July 2017, which has been exhibited in an affidavit affirmed by Mr Li. LJH's counsel referred to Mr Li's affidavit where Mr Li stated that the works claimed for in PC 21 were done from 2015 to 2017. LJH's counsel thus submitted that, during the period when the works in PC 21 were carried out, LJH was a licensed builder, and LJH thus did not fall afoul of s 29B(2) of the BCA. On the other hand, counsel for Mdm Wee pointed out that PC 21 was a claim for works done up till the issuance of the TOP in 2019. Mdm Wee also points out that PC 21 was expressly stated to be \"for the period ending 30 April 2021\".\n233 By LJH's own evidence, it had carried out works in respect of the Project until as late as 2019; in particular, LJH claims that it had (i) carried out works to dismantle the tempered glass roof and to install a metal roof for the Property's car porch in 2018; and (ii) paid the Professional Engineer (whom LJH says Mdm Wee failed to pay) to complete certain external cladding works to expedite obtaining the TOP in 2019 (even though LJH claims that the cladding works did not fall within its scope of work under the Contract) (see [10] and [12] above).\n234 However, this is disputed by Mdm Wee, whose evidence is that she had liaised directly with Builder's Alliance to construct the metal roof for the car porch in 2018, and it was Builder's Alliance which carried out the works in respect of the car porch roof. She produces a tax invoice from Builders Alliance dated 23 April 2018 for the metal roof, and her cheque payment for that invoice dated 24 April 2018. As for the external cladding works, Mdm Wee says that those works fell within LJH's scope of work under the Contract, and that Yong Chow had carried out the works which LJH failed to complete. Moreover, she says that she was not informed that she owed payments to the Professional Engineer, who had been engaged directly by LJH.\n235 In view of the factual disagreements in the evidence before me as to whether LJH carried out general building works on the Project in 2018 and 2019, I cannot conclude whether LJH had in fact carried on the business of a general builder after 20 July 2017 when it was no longer in possession of a general builder's licence. Since this defence is one that is raised by Mdm Wee to resist enforcement of the Adjudication Determination, the burden falls on her to show on a balance of probabilities that s 29B(2)(a) of the BCA was contravened by LJH, such that it would be contrary to s 29B(4) of the BCA for the court to allow enforcement of the Adjudication Determination under the SOPA. She has not been able to discharge her burden in this respect.\nConclusion on whether LJH is precluded by s 29B(4) of the BCA from enforcing the Adjudication Determination\n\n236 As I am unable to determine that there has been a contravention of s 29B(2)(a) of the BCA based on the material before the court, I cannot conclude that LJH is precluded by s 29B(4) of the BCA from enforcing the Adjudication Determination under s 27(1) of the SOPA in the present case.\nConclusion\n\n237 For the above reasons, I find that the Adjudication Determination should be set aside in its entirety, and I therefore grant an order in terms of prayer 1 of SUM 4487. There is accordingly no need to hear SUM 881, which is Mdm Wee's application for a stay of the enforcement of the Adjudication Determination pending the conclusion of the arbitration between the parties. I will hear parties as to what consequential directions they require in relation to SUM 881.\n238 I will also deal separately with the issue of the costs of SUM 4487.\nAng Cheng Hock\nJudge of the High Court\nOng Kok Seng and Yang Liyuan Ian (Patrick Ong Law LLC) for the plaintiff;\nLee Peng Khoon Edwin and Amanda Koh Jia Yi (Eldan Law LLP) for the defendant.\n", "label": [[9, 72, "COURT"], [159, 200, "PETITIONER"], [219, 240, "RESPONDENT"], [1152, 1217, "PRECEDENT"], [1334, 1348, "JUDGE"], [1415, 1429, "JUDGE"], [1560, 1637, "STATUTE"], [1644, 1648, "STATUTE"], [2009, 2013, "STATUTE"], [2111, 2115, "STATUTE"], [2768, 2772, "STATUTE"], [2867, 2883, "CASE_NUMBER"], [3173, 3177, "STATUTE"], [3203, 3219, "DATE"], [3230, 3236, "PROVISION"], [3244, 3248, "STATUTE"], [3267, 3271, "STATUTE"], [3432, 3436, "STATUTE"], [3469, 3473, "STATUTE"], [3523, 3527, "STATUTE"], [3587, 3628, "PETITIONER"], [3680, 3689, "GPE"], [3730, 3733, "ORG"], [3741, 3747, "OTHER_PERSON"], [3775, 3796, "RESPONDENT"], [3949, 3969, "OTHER_PERSON"], [4013, 4020, "OTHER_PERSON"], [4051, 4058, "OTHER_PERSON"], [4067, 4070, "ORG"], [4228, 4235, "OTHER_PERSON"], [4250, 4283, "ORG"], [4325, 4328, "ORG"], [4357, 4364, "OTHER_PERSON"], [4680, 4743, "STATUTE"], [5107, 5140, "RESPONDENT"], [5708, 5721, "OTHER_PERSON"], [5727, 5730, "OTHER_PERSON"], [5761, 5764, "ORG"], [6092, 6099, "OTHER_PERSON"], [6113, 6116, "OTHER_PERSON"], [6143, 6146, "ORG"], [6237, 6249, "OTHER_PERSON"], [6254, 6257, "OTHER_PERSON"], [6306, 6309, "ORG"], [6331, 6362, "ORG"], [6447, 6457, "DATE"], [6469, 6472, "OTHER_PERSON"], [6495, 6502, "OTHER_PERSON"], [6515, 6518, "OTHER_PERSON"], [6562, 6569, "OTHER_PERSON"], [6599, 6609, "OTHER_PERSON"], [6791, 6794, "ORG"], [6869, 6872, "ORG"], [6906, 6913, "OTHER_PERSON"], [7045, 7052, "OTHER_PERSON"], [7081, 7088, "OTHER_PERSON"], [7271, 7281, "OTHER_PERSON"], [7285, 7292, "PETITIONER"], [7459, 7466, "OTHER_PERSON"], [7558, 7565, "OTHER_PERSON"], [7578, 7608, "ORG"], [7644, 7653, "OTHER_PERSON"], [7696, 7699, "ORG"], [7838, 7845, "OTHER_PERSON"], [7859, 7868, "OTHER_PERSON"], [7918, 7921, "ORG"], [7931, 7938, "OTHER_PERSON"], [7955, 7958, "ORG"], [8030, 8032, "OTHER_PERSON"], [8046, 8049, "ORG"], [8054, 8064, "OTHER_PERSON"], [8250, 8261, "DATE"], [8265, 8268, "ORG"], [8273, 8283, "OTHER_PERSON"], [8338, 8340, "OTHER_PERSON"], [8372, 8386, "ORG"], [8396, 8399, "ORG"], [8534, 8537, "ORG"], [8628, 8631, "ORG"], [8716, 8723, "OTHER_PERSON"], [8802, 8827, "ORG"], [8867, 8874, "OTHER_PERSON"], [9030, 9040, "PROVISION"], [9084, 9087, "ORG"], [9201, 9214, "OTHER_PERSON"], [9257, 9264, "OTHER_PERSON"], [9281, 9283, "OTHER_PERSON"], [9292, 9301, "OTHER_PERSON"], [9373, 9380, "OTHER_PERSON"], [9390, 9392, "OTHER_PERSON"], [9509, 9511, "OTHER_PERSON"], [9519, 9522, "OTHER_PERSON"], [9531, 9538, "OTHER_PERSON"], [9640, 9647, "OTHER_PERSON"], [9704, 9711, "OTHER_PERSON"], [9782, 9785, "ORG"], [9790, 9800, "OTHER_PERSON"], [9874, 9876, "OTHER_PERSON"], [9973, 9980, "OTHER_PERSON"], [10214, 10217, "ORG"], [10330, 10337, "OTHER_PERSON"], [10384, 10387, "ORG"], [10434, 10437, "ORG"], [10532, 10543, "DATE"], [10586, 10589, "COURT"], [10591, 10605, "ORG"], [10615, 10618, "ORG"], [10701, 10704, "ORG"], [10858, 10871, "DATE"], [10873, 10876, "ORG"], [10935, 10949, "ORG"], [10996, 11003, "OTHER_PERSON"], [11098, 11101, "ORG"], [11838, 11849, "PROVISION"], [12189, 12196, "OTHER_PERSON"], [12362, 12369, "OTHER_PERSON"], [12386, 12403, "PROVISION"], [12484, 12495, "DATE"], [12497, 12500, "ORG"], [12577, 12584, "OTHER_PERSON"], [12614, 12617, "ORG"], [12661, 12672, "DATE"], [12701, 12708, "OTHER_PERSON"], [12791, 12817, "ORG"], [12820, 12823, "ORG"], [12868, 12875, "OTHER_PERSON"], [12879, 12890, "DATE"], [13058, 13065, "OTHER_PERSON"], [13087, 13090, "WITNESS"], [13113, 13120, "OTHER_PERSON"], [13257, 13264, "OTHER_PERSON"], [13316, 13319, "OTHER_PERSON"], [13322, 13325, "OTHER_PERSON"], [13352, 13359, "OTHER_PERSON"], [13437, 13444, "OTHER_PERSON"], [13608, 13615, "PROVISION"], [13623, 13627, "STATUTE"], [13680, 13687, "OTHER_PERSON"], [13722, 13736, "ORG"], [13764, 13776, "DATE"], [13799, 13802, "OTHER_PERSON"], [13858, 13861, "OTHER_PERSON"], [13884, 13896, "DATE"], [13898, 13905, "OTHER_PERSON"], [13950, 13962, "DATE"], [14094, 14101, "OTHER_PERSON"], [14236, 14243, "OTHER_PERSON"], [14330, 14333, "OTHER_PERSON"], [14586, 14590, "STATUTE"], [14598, 14610, "DATE"], [14612, 14615, "OTHER_PERSON"], [14618, 14621, "OTHER_PERSON"], [14732, 14735, "ORG"], [14848, 14865, "CASE_NUMBER"], [14923, 14926, "ORG"], [14974, 14977, "ORG"], [15021, 15024, "ORG"], [15684, 15688, "PROVISION"], [15696, 15700, "STATUTE"], [15834, 15849, "CASE_NUMBER"], [16047, 16054, "OTHER_PERSON"], [16184, 16200, "PROVISION"], [16208, 16222, "STATUTE"], [16278, 16288, "PROVISION"], [16552, 16559, "OTHER_PERSON"], [16571, 16578, "OTHER_PERSON"], [16952, 16955, "OTHER_PERSON"], [17163, 17167, "STATUTE"], [17489, 17492, "OTHER_PERSON"], [17639, 17642, "STATUTE"], [17670, 17678, "PROVISION"], [17686, 17689, "STATUTE"], [17743, 17757, "PROVISION"], [17765, 17768, "STATUTE"], [17933, 17941, "PROVISION"], [18108, 18115, "OTHER_PERSON"], [18163, 18174, "PROVISION"], [18182, 18185, "STATUTE"], [18271, 18280, "GPE"], [18349, 18352, "OTHER_PERSON"], [18364, 18367, "OTHER_PERSON"], [18512, 18515, "ORG"], [18681, 18684, "ORG"], [18900, 18907, "OTHER_PERSON"], [19328, 19335, "OTHER_PERSON"], [19450, 19457, "OTHER_PERSON"], [19700, 19707, "OTHER_PERSON"], [19799, 19807, "PROVISION"], [19815, 19818, "STATUTE"], [19966, 19974, "PROVISION"], [19982, 19985, "STATUTE"], [20018, 20022, "STATUTE"], [20379, 20383, "STATUTE"], [21264, 21267, "ORG"], [21320, 21324, "STATUTE"], [21353, 21356, "ORG"], [21412, 21415, "STATUTE"], [21605, 21615, "PROVISION"], [21623, 21627, "STATUTE"], [21808, 21812, "PROVISION"], [21820, 21824, "STATUTE"], [21973, 21989, "PROVISION"], [21997, 22001, "STATUTE"], [22163, 22176, "PROVISION"], [22184, 22188, "STATUTE"], [22605, 22615, "PROVISION"], [22770, 22780, "PROVISION"], [22791, 22798, "PROVISION"], [22806, 22810, "STATUTE"], [22883, 22887, "PROVISION"], [22895, 22899, "STATUTE"], [23142, 23149, "PROVISION"], [23157, 23161, "STATUTE"], [23292, 23305, "PROVISION"], [23312, 23325, "PROVISION"], [23333, 23337, "STATUTE"], [23422, 23432, "PROVISION"], [23601, 23608, "PROVISION"], [23616, 23620, "STATUTE"], [23870, 23880, "PROVISION"], [23888, 23892, "STATUTE"], [24042, 24066, "PROVISION"], [24074, 24078, "STATUTE"], [24160, 24164, "PROVISION"], [24172, 24176, "STATUTE"], [24309, 24316, "PROVISION"], [24324, 24328, "STATUTE"], [24432, 24436, "PROVISION"], [24444, 24448, "STATUTE"], [24511, 24518, "PROVISION"], [24526, 24530, "STATUTE"], [24629, 24689, "PRECEDENT"], [25139, 25150, "OTHER_PERSON"], [25289, 25293, "STATUTE"], [25653, 25660, "PROVISION"], [26076, 26079, "JUDGE"], [26099, 26105, "OTHER_PERSON"], [26118, 26125, "JUDGE"], [26131, 26147, "OTHER_PERSON"], [28434, 28441, "OTHER_PERSON"], [28448, 28513, "PRECEDENT"], [28723, 28730, "OTHER_PERSON"], [28827, 28834, "OTHER_PERSON"], [28935, 28942, "OTHER_PERSON"], [29008, 29011, "ORG"], [29062, 29069, "OTHER_PERSON"], [29084, 29091, "OTHER_PERSON"], [29129, 29132, "OTHER_PERSON"], [29311, 29318, "OTHER_PERSON"], [29396, 29403, "OTHER_PERSON"], [29432, 29439, "OTHER_PERSON"], [29596, 29599, "ORG"], [29671, 29678, "OTHER_PERSON"], [29759, 29769, "OTHER_PERSON"], [29787, 29797, "OTHER_PERSON"], [29883, 29886, "ORG"], [29891, 29894, "ORG"], [29941, 29948, "OTHER_PERSON"], [30014, 30018, "STATUTE"], [30033, 30036, "ORG"], [30080, 30087, "OTHER_PERSON"], [30283, 30286, "ORG"], [30538, 30542, "PROVISION"], [30550, 30554, "STATUTE"], [30962, 30975, "PROVISION"], [31609, 31619, "PROVISION"], [31627, 31631, "STATUTE"], [31693, 31706, "PROVISION"], [31714, 31718, "STATUTE"], [31868, 31878, "PROVISION"], [31976, 31986, "PROVISION"], [32003, 32013, "PROVISION"], [32021, 32025, "STATUTE"], [32052, 32055, "OTHER_PERSON"], [32088, 32091, "OTHER_PERSON"], [32269, 32279, "PROVISION"], [32287, 32291, "STATUTE"], [32535, 32555, "ORG"], [32720, 32732, "JUDGE"], [32786, 32790, "PROVISION"], [32798, 32802, "STATUTE"], [32880, 32884, "STATUTE"], [32968, 32971, "JUDGE"], [33046, 33050, "STATUTE"], [33473, 33477, "STATUTE"], [33529, 33621, "STATUTE"], [33628, 33645, "STATUTE"], [33693, 33697, "PROVISION"], [33833, 33837, "PROVISION"], [34039, 34049, "ORG"], [34084, 34088, "PROVISION"], [34158, 34161, "JUDGE"], [34344, 34433, "STATUTE"], [34457, 34466, "PROVISION"], [34474, 34491, "STATUTE"], [34499, 34506, "PROVISION"], [34514, 34518, "STATUTE"], [34738, 34745, "PROVISION"], [34753, 34757, "STATUTE"], [34897, 34906, "PROVISION"], [34936, 34943, "PROVISION"], [34951, 34955, "STATUTE"], [35166, 35170, "STATUTE"], [35442, 35446, "STATUTE"], [35813, 35823, "PROVISION"], [35831, 35835, "STATUTE"], [35928, 35932, "PROVISION"], [35940, 35944, "STATUTE"], [36029, 36039, "PROVISION"], [36047, 36051, "STATUTE"], [36076, 36080, "STATUTE"], [36795, 36805, "PROVISION"], [36813, 36817, "STATUTE"], [37535, 37539, "PROVISION"], [37547, 37551, "STATUTE"], [37553, 37569, "PROVISION"], [37577, 37581, "STATUTE"], [37704, 37711, "PROVISION"], [37719, 37723, "STATUTE"], [38175, 38185, "PROVISION"], [38193, 38197, "STATUTE"], [38588, 38598, "PROVISION"], [38606, 38610, "STATUTE"], [39806, 39816, "PROVISION"], [39824, 39828, "STATUTE"], [40015, 40019, "STATUTE"], [40086, 40093, "OTHER_PERSON"], [40135, 40142, "OTHER_PERSON"], [40239, 40246, "OTHER_PERSON"], [40365, 40372, "OTHER_PERSON"], [40454, 40461, "OTHER_PERSON"], [40529, 40536, "OTHER_PERSON"], [40706, 40720, "ORG"], [40727, 40734, "OTHER_PERSON"], [40793, 40800, "OTHER_PERSON"], [41107, 41114, "OTHER_PERSON"], [41506, 41513, "OTHER_PERSON"], [41524, 41527, "ORG"], [41637, 41644, "OTHER_PERSON"], [41913, 41916, "ORG"], [41975, 41978, "ORG"], [42156, 42168, "DATE"], [42194, 42197, "OTHER_PERSON"], [42249, 42256, "OTHER_PERSON"], [42523, 42530, "OTHER_PERSON"], [42549, 42563, "ORG"], [42809, 42812, "ORG"], [42866, 42873, "OTHER_PERSON"], [43153, 43160, "OTHER_PERSON"], [43339, 43346, "OTHER_PERSON"], [43466, 43473, "OTHER_PERSON"], [43518, 43526, "LAWYER"], [43605, 43608, "OTHER_PERSON"], [43618, 43624, "PETITIONER"], [43669, 43676, "OTHER_PERSON"], [43782, 43789, "OTHER_PERSON"], [43865, 43875, "LAWYER"], [43880, 43883, "OTHER_PERSON"], [43888, 43891, "OTHER_PERSON"], [43962, 43969, "OTHER_PERSON"], [43973, 43987, "ORG"], [43996, 43999, "OTHER_PERSON"], [44184, 44191, "OTHER_PERSON"], [44276, 44283, "OTHER_PERSON"], [44372, 44375, "OTHER_PERSON"], [44603, 44606, "OTHER_PERSON"], [44688, 44691, "OTHER_PERSON"], [44777, 44780, "OTHER_PERSON"], [45092, 45099, "OTHER_PERSON"], [45180, 45183, "ORG"], [45254, 45261, "OTHER_PERSON"], [45409, 45412, "ORG"], [45452, 45459, "OTHER_PERSON"], [45478, 45481, "ORG"], [45673, 45680, "OTHER_PERSON"], [45691, 45698, "OTHER_PERSON"], [46052, 46059, "OTHER_PERSON"], [46117, 46124, "OTHER_PERSON"], [46233, 46236, "ORG"], [46250, 46257, "OTHER_PERSON"], [46316, 46330, "ORG"], [46416, 46430, "ORG"], [46434, 46437, "ORG"], [46653, 46660, "OTHER_PERSON"], [46744, 46757, "DATE"], [46807, 46814, "OTHER_PERSON"], [46921, 46928, "OTHER_PERSON"], [46948, 46962, "ORG"], [47167, 47174, "OTHER_PERSON"], [47286, 47293, "OTHER_PERSON"], [47387, 47390, "ORG"], [47395, 47409, "ORG"], [47514, 47516, "OTHER_PERSON"], [47627, 47648, "ORG"], [47882, 47889, "OTHER_PERSON"], [47976, 47979, "OTHER_PERSON"], [48114, 48117, "ORG"], [48185, 48192, "OTHER_PERSON"], [48347, 48354, "OTHER_PERSON"], [48676, 48683, "OTHER_PERSON"], [48748, 48755, "OTHER_PERSON"], [48869, 48882, "DATE"], [49296, 49299, "ORG"], [49357, 49364, "OTHER_PERSON"], [49384, 49391, "OTHER_PERSON"], [49493, 49500, "OTHER_PERSON"], [49649, 49656, "OTHER_PERSON"], [49726, 49733, "OTHER_PERSON"], [49886, 49893, "OTHER_PERSON"], [50154, 50161, "OTHER_PERSON"], [50237, 50240, "ORG"], [50298, 50311, "DATE"], [50345, 50352, "OTHER_PERSON"], [50474, 50477, "ORG"], [50611, 50618, "OTHER_PERSON"], [50797, 50800, "ORG"], [50921, 50924, "ORG"], [50956, 50969, "DATE"], [51073, 51083, "PROVISION"], [51091, 51095, "STATUTE"], [51113, 51116, "ORG"], [51163, 51188, "PROVISION"], [51196, 51200, "STATUTE"], [51342, 51349, "PROVISION"], [51357, 51361, "STATUTE"], [51481, 51491, "PROVISION"], [51499, 51503, "STATUTE"], [51533, 51536, "ORG"], [51609, 51616, "OTHER_PERSON"], [51679, 51682, "OTHER_PERSON"], [51897, 51904, "OTHER_PERSON"], [52261, 52277, "PROVISION"], [52285, 52289, "STATUTE"], [52556, 52625, "PRECEDENT"], [54962, 54965, "OTHER_PERSON"], [55073, 55080, "OTHER_PERSON"], [55100, 55103, "ORG"], [55218, 55240, "ORG"], [55254, 55261, "OTHER_PERSON"], [55293, 55302, "OTHER_PERSON"], [55317, 55320, "ORG"], [55370, 55380, "OTHER_PERSON"], [55454, 55464, "OTHER_PERSON"], [55516, 55523, "OTHER_PERSON"], [55547, 55550, "OTHER_PERSON"], [55555, 55565, "OTHER_PERSON"], [56138, 56141, "ORG"], [56411, 56418, "OTHER_PERSON"], [57094, 57101, "OTHER_PERSON"], [57142, 57145, "ORG"], [57410, 57413, "ORG"], [57439, 57442, "ORG"], [57541, 57544, "ORG"], [57635, 57644, "OTHER_PERSON"], [57649, 57656, "OTHER_PERSON"], [57753, 57756, "ORG"], [57787, 57790, "ORG"], [57807, 57814, "OTHER_PERSON"], [57828, 57831, "ORG"], [57875, 57884, "OTHER_PERSON"], [57943, 57950, "OTHER_PERSON"], [57988, 57997, "OTHER_PERSON"], [58046, 58048, "OTHER_PERSON"], [58084, 58087, "OTHER_PERSON"], [58152, 58159, "OTHER_PERSON"], [58169, 58178, "OTHER_PERSON"], [58284, 58287, "ORG"], [58316, 58327, "DATE"], [58519, 58526, "OTHER_PERSON"], [58555, 58564, "OTHER_PERSON"], [58607, 58614, "OTHER_PERSON"], [58694, 58703, "OTHER_PERSON"], [58762, 58771, "OTHER_PERSON"], [58841, 58845, "STATUTE"], [59004, 59013, "OTHER_PERSON"], [59027, 59034, "OTHER_PERSON"], [59071, 59080, "OTHER_PERSON"], [59118, 59127, "OTHER_PERSON"], [59200, 59209, "OTHER_PERSON"], [59273, 59276, "ORG"], [59356, 59359, "ORG"], [59517, 59526, "OTHER_PERSON"], [59652, 59655, "ORG"], [59753, 59756, "ORG"], [59837, 59840, "ORG"], [59981, 59984, "ORG"], [60055, 60064, "OTHER_PERSON"], [60093, 60100, "OTHER_PERSON"], [60118, 60127, "OTHER_PERSON"], [60241, 60250, "OTHER_PERSON"], [60254, 60257, "ORG"], [60320, 60329, "OTHER_PERSON"], [60368, 60371, "ORG"], [60405, 60412, "OTHER_PERSON"], [60437, 60440, "ORG"], [60511, 60520, "OTHER_PERSON"], [60536, 60543, "OTHER_PERSON"], [60570, 60579, "OTHER_PERSON"], [60585, 60588, "ORG"], [60607, 60616, "OTHER_PERSON"], [60672, 60679, "OTHER_PERSON"], [60775, 60778, "ORG"], [60816, 60825, "OTHER_PERSON"], [60846, 60849, "ORG"], [60920, 60923, "ORG"], [60947, 60950, "ORG"], [61002, 61009, "OTHER_PERSON"], [61014, 61023, "OTHER_PERSON"], [61052, 61061, "OTHER_PERSON"], [61106, 61113, "OTHER_PERSON"], [61142, 61151, "OTHER_PERSON"], [61178, 61181, "ORG"], [61266, 61269, "ORG"], [61317, 61326, "OTHER_PERSON"], [61347, 61356, "OTHER_PERSON"], [61396, 61399, "ORG"], [61452, 61459, "OTHER_PERSON"], [61472, 61481, "OTHER_PERSON"], [61579, 61582, "ORG"], [61593, 61596, "ORG"], [61642, 61649, "OTHER_PERSON"], [61671, 61680, "OTHER_PERSON"], [61733, 61736, "ORG"], [61747, 61750, "ORG"], [61782, 61791, "OTHER_PERSON"], [61793, 61796, "ORG"], [61845, 61852, "OTHER_PERSON"], [61871, 61880, "OTHER_PERSON"], [61931, 61940, "OTHER_PERSON"], [61977, 61986, "OTHER_PERSON"], [62020, 62023, "ORG"], [62038, 62047, "OTHER_PERSON"], [62103, 62106, "ORG"], [62158, 62167, "OTHER_PERSON"], [62186, 62195, "OTHER_PERSON"], [62225, 62228, "ORG"], [62263, 62266, "ORG"], [62315, 62324, "OTHER_PERSON"], [62366, 62369, "ORG"], [62387, 62390, "ORG"], [62438, 62447, "OTHER_PERSON"], [62488, 62491, "ORG"], [62644, 62647, "ORG"], [62769, 62778, "OTHER_PERSON"], [62857, 62866, "OTHER_PERSON"], [62958, 62961, "ORG"], [63000, 63009, "OTHER_PERSON"], [63091, 63100, "OTHER_PERSON"], [63137, 63140, "ORG"], [63208, 63217, "OTHER_PERSON"], [63240, 63243, "ORG"], [63364, 63373, "OTHER_PERSON"], [63439, 63446, "OTHER_PERSON"], [63578, 63587, "OTHER_PERSON"], [63599, 63606, "OTHER_PERSON"], [63938, 63947, "OTHER_PERSON"], [63983, 63990, "OTHER_PERSON"], [64163, 64172, "OTHER_PERSON"], [64223, 64230, "OTHER_PERSON"], [64396, 64408, "DATE"], [64448, 64460, "DATE"], [64574, 64586, "DATE"], [65031, 65034, "ORG"], [65123, 65132, "OTHER_PERSON"], [65141, 65144, "ORG"], [65183, 65186, "ORG"], [65278, 65281, "ORG"], [65327, 65336, "OTHER_PERSON"], [65347, 65354, "OTHER_PERSON"], [65416, 65423, "OTHER_PERSON"], [65445, 65454, "OTHER_PERSON"], [65476, 65485, "OTHER_PERSON"], [65598, 65601, "ORG"], [65655, 65665, "OTHER_PERSON"], [65691, 65694, "ORG"], [65731, 65741, "OTHER_PERSON"], [65878, 65885, "OTHER_PERSON"], [65899, 65902, "ORG"], [66022, 66025, "ORG"], [66182, 66185, "ORG"], [66253, 66263, "OTHER_PERSON"], [66320, 66323, "ORG"], [66332, 66342, "OTHER_PERSON"], [66368, 66384, "DATE"], [66403, 66406, "ORG"], [66551, 66561, "OTHER_PERSON"], [66690, 66719, "ORG"], [66742, 66752, "OTHER_PERSON"], [66844, 66854, "OTHER_PERSON"], [66988, 66997, "ORG"], [67006, 67016, "OTHER_PERSON"], [67031, 67040, "ORG"], [67116, 67126, "OTHER_PERSON"], [67184, 67194, "OTHER_PERSON"], [67361, 67371, "OTHER_PERSON"], [67399, 67402, "ORG"], [67409, 67422, "DATE"], [67476, 67486, "OTHER_PERSON"], [67508, 67511, "ORG"], [67533, 67543, "OTHER_PERSON"], [67588, 67596, "PROVISION"], [67698, 67706, "PROVISION"], [67806, 67816, "OTHER_PERSON"], [67877, 67880, "ORG"], [67887, 67902, "DATE"], [68051, 68058, "OTHER_PERSON"], [68109, 68119, "OTHER_PERSON"], [68167, 68177, "OTHER_PERSON"], [68253, 68256, "ORG"], [68328, 68331, "ORG"], [68381, 68389, "PROVISION"], [68654, 68657, "ORG"], [68808, 68810, "OTHER_PERSON"], [68862, 68865, "ORG"], [69003, 69013, "OTHER_PERSON"], [69076, 69100, "PROVISION"], [69233, 69236, "ORG"], [69241, 69251, "OTHER_PERSON"], [69343, 69353, "OTHER_PERSON"], [69617, 69627, "OTHER_PERSON"], [69741, 69748, "OTHER_PERSON"], [69783, 69793, "OTHER_PERSON"], [69988, 69995, "OTHER_PERSON"], [70053, 70069, "DATE"], [70160, 70167, "OTHER_PERSON"], [70195, 70205, "OTHER_PERSON"], [70210, 70213, "OTHER_PERSON"], [70432, 70442, "OTHER_PERSON"], [70496, 70499, "OTHER_PERSON"], [70654, 70657, "ORG"], [70664, 70674, "OTHER_PERSON"], [70834, 70836, "OTHER_PERSON"], [70908, 70911, "ORG"], [70939, 70950, "OTHER_PERSON"], [70980, 70983, "ORG"], [70988, 70998, "OTHER_PERSON"], [71004, 71011, "OTHER_PERSON"], [71034, 71036, "OTHER_PERSON"], [71069, 71072, "ORG"], [71123, 71133, "OTHER_PERSON"], [71138, 71140, "OTHER_PERSON"], [71171, 71181, "OTHER_PERSON"], [71217, 71220, "ORG"], [71245, 71255, "OTHER_PERSON"], [71303, 71305, "OTHER_PERSON"], [71354, 71356, "OTHER_PERSON"], [71386, 71400, "CASE_NUMBER"], [71445, 71455, "OTHER_PERSON"], [71470, 71480, "OTHER_PERSON"], [71484, 71494, "OTHER_PERSON"], [71532, 71534, "OTHER_PERSON"], [71593, 71596, "ORG"], [71635, 71637, "OTHER_PERSON"], [71682, 71685, "ORG"], [71690, 71700, "OTHER_PERSON"], [71795, 71797, "OTHER_PERSON"], [71880, 71883, "ORG"], [71889, 71904, "DATE"], [71925, 71936, "OTHER_PERSON"], [71992, 72002, "OTHER_PERSON"], [72042, 72045, "ORG"], [72049, 72060, "DATE"], [72089, 72099, "OTHER_PERSON"], [72103, 72118, "DATE"], [72348, 72351, "OTHER_PERSON"], [72405, 72415, "OTHER_PERSON"], [72608, 72611, "ORG"], [72715, 72718, "ORG"], [72771, 72778, "OTHER_PERSON"], [72838, 72845, "OTHER_PERSON"], [72869, 72872, "OTHER_PERSON"], [72877, 72887, "OTHER_PERSON"], [72943, 72950, "OTHER_PERSON"], [72965, 72968, "ORG"], [73043, 73046, "OTHER_PERSON"], [73051, 73061, "OTHER_PERSON"], [73227, 73234, "OTHER_PERSON"], [73271, 73278, "OTHER_PERSON"], [73327, 73330, "ORG"], [73410, 73417, "OTHER_PERSON"], [73464, 73474, "OTHER_PERSON"], [73688, 73691, "ORG"], [73965, 73972, "OTHER_PERSON"], [74008, 74015, "OTHER_PERSON"], [74039, 74049, "OTHER_PERSON"], [74167, 74174, "OTHER_PERSON"], [74229, 74236, "OTHER_PERSON"], [74477, 74480, "ORG"], [74550, 74557, "OTHER_PERSON"], [74724, 74727, "ORG"], [74816, 74823, "OTHER_PERSON"], [74846, 74849, "ORG"], [74877, 74889, "DATE"], [74953, 74960, "OTHER_PERSON"], [74964, 74977, "DATE"], [75006, 75009, "ORG"], [75101, 75108, "OTHER_PERSON"], [75211, 75218, "OTHER_PERSON"], [75390, 75397, "OTHER_PERSON"], [75483, 75490, "OTHER_PERSON"], [75554, 75561, "OTHER_PERSON"], [75574, 75577, "ORG"], [75643, 75650, "OTHER_PERSON"], [75678, 75681, "ORG"], [75706, 75713, "OTHER_PERSON"], [75779, 75782, "ORG"], [75984, 75991, "OTHER_PERSON"], [76077, 76084, "OTHER_PERSON"], [76349, 76356, "OTHER_PERSON"], [76585, 76626, "PRECEDENT"], [76669, 76732, "PRECEDENT"], [76784, 76787, "ORG"], [76872, 76879, "OTHER_PERSON"], [76883, 76893, "OTHER_PERSON"], [76925, 76935, "OTHER_PERSON"], [77051, 77058, "OTHER_PERSON"], [77171, 77178, "OTHER_PERSON"], [77219, 77229, "OTHER_PERSON"], [77282, 77284, "OTHER_PERSON"], [77306, 77316, "OTHER_PERSON"], [77358, 77361, "ORG"], [77403, 77406, "ORG"], [77414, 77416, "OTHER_PERSON"], [77441, 77448, "OTHER_PERSON"], [77474, 77484, "OTHER_PERSON"], [77490, 77493, "ORG"], [77575, 77582, "OTHER_PERSON"], [77586, 77589, "ORG"], [77598, 77601, "ORG"], [77615, 77625, "OTHER_PERSON"], [77760, 77767, "OTHER_PERSON"], [77798, 77808, "OTHER_PERSON"], [77812, 77815, "ORG"], [77869, 77876, "OTHER_PERSON"], [77902, 77909, "OTHER_PERSON"], [78073, 78076, "ORG"], [78136, 78143, "OTHER_PERSON"], [78372, 78375, "ORG"], [78472, 78475, "ORG"], [78510, 78517, "OTHER_PERSON"], [78532, 78542, "OTHER_PERSON"], [78591, 78594, "ORG"], [78690, 78697, "OTHER_PERSON"], [78718, 78721, "ORG"], [78883, 78886, "ORG"], [78916, 78923, "OTHER_PERSON"], [78964, 78974, "OTHER_PERSON"], [78990, 78997, "OTHER_PERSON"], [79176, 79183, "OTHER_PERSON"], [79392, 79402, "OTHER_PERSON"], [79407, 79410, "OTHER_PERSON"], [79453, 79464, "DATE"], [79513, 79520, "OTHER_PERSON"], [79668, 79675, "OTHER_PERSON"], [79715, 79722, "OTHER_PERSON"], [79730, 79733, "OTHER_PERSON"], [80132, 80135, "OTHER_PERSON"], [80247, 80254, "OTHER_PERSON"], [80284, 80287, "OTHER_PERSON"], [80292, 80302, "OTHER_PERSON"], [80370, 80373, "ORG"], [80543, 80546, "ORG"], [80601, 80608, "OTHER_PERSON"], [80610, 80613, "ORG"], [80662, 80665, "ORG"], [80837, 80840, "ORG"], [80912, 80915, "ORG"], [81844, 81851, "OTHER_PERSON"], [81914, 81916, "OTHER_PERSON"], [82257, 82260, "ORG"], [82439, 82442, "ORG"], [82565, 82568, "ORG"], [82616, 82619, "ORG"], [82732, 82735, "ORG"], [83217, 83224, "OTHER_PERSON"], [83300, 83309, "OTHER_PERSON"], [83324, 83331, "OTHER_PERSON"], [83337, 83346, "OTHER_PERSON"], [83417, 83424, "OTHER_PERSON"], [83430, 83433, "ORG"], [83506, 83509, "ORG"], [83595, 83598, "ORG"], [83741, 83744, "ORG"], [83891, 83901, "OTHER_PERSON"], [83907, 83910, "ORG"], [83945, 83955, "DATE"], [83965, 83975, "OTHER_PERSON"], [84061, 84068, "OTHER_PERSON"], [84088, 84095, "OTHER_PERSON"], [84121, 84124, "ORG"], [84176, 84179, "ORG"], [84184, 84194, "OTHER_PERSON"], [84254, 84261, "OTHER_PERSON"], [84311, 84320, "OTHER_PERSON"], [84380, 84383, "ORG"], [84391, 84401, "OTHER_PERSON"], [84459, 84462, "ORG"], [84625, 84628, "ORG"], [84777, 84784, "OTHER_PERSON"], [84920, 84923, "ORG"], [84958, 84961, "ORG"], [85146, 85155, "OTHER_PERSON"], [85244, 85247, "ORG"], [85364, 85367, "ORG"], [85440, 85449, "OTHER_PERSON"], [85582, 85585, "ORG"], [85686, 85689, "ORG"], [85731, 85738, "OTHER_PERSON"], [85810, 85813, "ORG"], [85835, 85842, "OTHER_PERSON"], [85846, 85856, "DATE"], [85926, 85933, "OTHER_PERSON"], [85949, 85951, "OTHER_PERSON"], [85973, 85976, "ORG"], [86041, 86044, "ORG"], [86064, 86071, "OTHER_PERSON"], [86075, 86085, "DATE"], [86130, 86133, "ORG"], [86457, 86460, "ORG"], [86572, 86575, "ORG"], [86720, 86723, "ORG"], [86815, 86822, "OTHER_PERSON"], [86856, 86859, "ORG"], [86942, 86945, "ORG"], [87144, 87147, "ORG"], [87195, 87202, "OTHER_PERSON"], [87220, 87223, "ORG"], [87306, 87313, "OTHER_PERSON"], [87510, 87513, "OTHER_PERSON"], [87545, 87563, "ORG"], [87611, 87623, "DATE"], [87945, 87952, "OTHER_PERSON"], [88065, 88068, "OTHER_PERSON"], [88225, 88239, "ORG"], [88250, 88264, "ORG"], [88334, 88337, "ORG"], [88377, 88380, "ORG"], [88403, 88406, "ORG"], [88690, 88693, "ORG"], [88772, 88775, "ORG"], [88882, 88885, "ORG"], [89130, 89133, "ORG"], [89475, 89478, "ORG"], [89659, 89662, "ORG"], [89708, 89711, "ORG"], [89856, 89859, "ORG"], [89908, 89911, "ORG"], [90079, 90082, "ORG"], [90166, 90169, "OTHER_PERSON"], [90380, 90383, "ORG"], [90673, 90682, "OTHER_PERSON"], [90693, 90696, "ORG"], [90756, 90759, "OTHER_PERSON"], [90763, 90766, "ORG"], [90771, 90781, "OTHER_PERSON"], [90901, 90911, "PROVISION"], [90919, 90923, "STATUTE"], [91219, 91235, "PROVISION"], [91243, 91247, "STATUTE"], [91392, 91396, "STATUTE"], [91443, 91456, "PROVISION"], [91464, 91468, "STATUTE"], [91950, 91963, "PROVISION"], [91971, 91975, "STATUTE"], [92133, 92234, "PRECEDENT"], [92236, 92243, "PROVISION"], [92251, 92255, "STATUTE"], [92266, 92273, "PROVISION"], [92392, 92399, "PROVISION"], [92407, 92411, "STATUTE"], [92508, 92515, "PROVISION"], [92528, 92532, "STATUTE"], [92843, 92850, "PROVISION"], [92858, 92862, "STATUTE"], [93981, 93988, "PROVISION"], [93996, 94000, "STATUTE"], [94330, 94337, "PROVISION"], [94345, 94349, "STATUTE"], [94656, 94663, "PROVISION"], [94671, 94675, "STATUTE"], [94863, 94870, "PROVISION"], [94878, 94882, "STATUTE"], [96391, 96394, "WITNESS"], [96520, 96524, "STATUTE"], [96585, 96588, "ORG"], [96654, 96657, "ORG"], [96935, 96938, "ORG"], [97154, 97157, "ORG"], [97203, 97206, "OTHER_PERSON"], [97234, 97237, "ORG"], [97343, 97346, "ORG"], [97388, 97391, "ORG"], [97473, 97489, "PROVISION"], [97588, 97591, "ORG"], [97657, 97660, "OTHER_PERSON"], [97710, 97713, "ORG"], [97898, 97901, "ORG"], [98000, 98003, "ORG"], [98317, 98320, "ORG"], [98439, 98442, "ORG"], [98570, 98577, "OTHER_PERSON"], [98597, 98600, "ORG"], [99322, 99325, "ORG"], [99422, 99425, "ORG"], [99497, 99504, "OTHER_PERSON"], [99625, 99628, "ORG"], [99639, 99642, "ORG"], [99750, 99760, "OTHER_PERSON"], [99975, 99985, "OTHER_PERSON"], [100456, 100467, "OTHER_PERSON"], [100477, 100567, "PRECEDENT"], [102384, 102402, "ORG"], [103577, 103586, "OTHER_PERSON"], [103617, 103620, "ORG"], [103886, 103889, "ORG"], [104036, 104052, "DATE"], [104102, 104105, "ORG"], [104170, 104179, "OTHER_PERSON"], [104319, 104322, "ORG"], [104869, 104885, "PROVISION"], [104893, 104907, "STATUTE"], [104940, 104947, "OTHER_PERSON"], [104964, 104980, "PROVISION"], [104988, 105002, "STATUTE"], [105058, 105068, "PROVISION"], [105295, 105307, "PROVISION"], [105315, 105329, "STATUTE"], [105344, 105347, "OTHER_PERSON"], [105763, 105781, "ORG"], [106321, 106334, "OTHER_PERSON"], [107820, 107823, "ORG"], [107893, 107896, "ORG"], [108074, 108077, "ORG"], [108179, 108182, "ORG"], [108299, 108309, "PROVISION"], [108350, 108363, "PROVISION"], [108497, 108511, "PROVISION"], [108741, 108744, "OTHER_PERSON"], [108903, 108906, "OTHER_PERSON"], [109010, 109021, "DATE"], [109535, 109538, "OTHER_PERSON"], [109735, 109742, "OTHER_PERSON"], [109955, 109958, "ORG"], [110193, 110196, "ORG"], [111361, 111368, "OTHER_PERSON"], [111528, 111531, "ORG"], [112097, 112100, "ORG"], [112411, 112418, "OTHER_PERSON"], [112986, 112993, "OTHER_PERSON"], [113060, 113067, "OTHER_PERSON"], [114012, 114022, "PROVISION"], [114030, 114034, "STATUTE"], [114293, 114297, "STATUTE"], [114311, 114318, "OTHER_PERSON"], [114504, 114511, "OTHER_PERSON"], [114805, 114809, "STATUTE"], [114983, 114986, "ORG"], [115127, 115130, "ORG"], [115152, 115155, "ORG"], [115445, 115463, "PROVISION"], [115471, 115475, "STATUTE"], [115793, 115803, "PROVISION"], [115811, 115815, "STATUTE"], [116279, 116295, "PROVISION"], [116303, 116307, "STATUTE"], [116573, 116687, "PRECEDENT"], [116819, 116828, "OTHER_PERSON"], [117211, 117218, "PROVISION"], [117226, 117230, "STATUTE"], [117241, 117249, "PROVISION"], [117257, 117261, "STATUTE"], [117272, 117279, "PROVISION"], [117292, 117296, "STATUTE"], [118310, 118314, "STATUTE"], [118998, 119001, "ORG"], [119149, 119152, "ORG"], [119212, 119215, "OTHER_PERSON"], [119219, 119222, "OTHER_PERSON"], [119227, 119237, "OTHER_PERSON"], [119351, 119375, "COURT"], [119388, 119492, "PRECEDENT"], [119834, 119848, "OTHER_PERSON"], [119879, 119882, "ORG"], [119935, 119944, "OTHER_PERSON"], [119987, 119990, "ORG"], [120043, 120046, "ORG"], [120123, 120126, "ORG"], [120182, 120189, "OTHER_PERSON"], [120193, 120196, "OTHER_PERSON"], [120201, 120211, "OTHER_PERSON"], [120246, 120253, "OTHER_PERSON"], [120510, 120523, "OTHER_PERSON"], [120796, 120799, "ORG"], [120881, 120884, "ORG"], [121151, 121154, "ORG"], [121186, 121189, "ORG"], [121205, 121216, "STATUTE"], [121403, 121406, "ORG"], [121482, 121489, "OTHER_PERSON"], [121572, 121575, "ORG"], [121786, 121789, "ORG"], [121802, 121805, "ORG"], [121964, 121977, "DATE"], [121979, 121982, "ORG"], [122053, 122055, "OTHER_PERSON"], [123351, 123355, "STATUTE"], [123659, 123663, "STATUTE"], [124477, 124493, "PROVISION"], [124501, 124505, "STATUTE"], [124596, 124606, "PROVISION"], [124998, 125081, "PRECEDENT"], [125090, 125164, "PRECEDENT"], [125226, 125294, "PRECEDENT"], [125906, 126004, "PRECEDENT"], [126109, 126237, "PRECEDENT"], [126340, 126416, "PRECEDENT"], [126462, 126469, "OTHER_PERSON"], [126823, 126835, "OTHER_PERSON"], [126840, 126900, "PRECEDENT"], [126903, 126915, "OTHER_PERSON"], [126927, 126939, "OTHER_PERSON"], [127157, 127165, "JUDGE"], [127444, 127456, "OTHER_PERSON"], [127617, 127624, "OTHER_PERSON"], [127842, 127845, "ORG"], [127900, 127903, "ORG"], [127949, 127956, "OTHER_PERSON"], [128045, 128057, "DATE"], [128063, 128066, "ORG"], [128185, 128188, "ORG"], [128435, 128447, "DATE"], [128463, 128470, "OTHER_PERSON"], [128498, 128501, "ORG"], [128529, 128536, "OTHER_PERSON"], [128791, 128798, "OTHER_PERSON"], [129163, 129170, "OTHER_PERSON"], [129311, 129318, "OTHER_PERSON"], [129344, 129351, "OTHER_PERSON"], [129421, 129428, "OTHER_PERSON"], [129609, 129616, "OTHER_PERSON"], [129715, 129718, "ORG"], [129751, 129754, "ORG"], [129998, 130005, "OTHER_PERSON"], [130103, 130110, "OTHER_PERSON"], [130138, 130145, "OTHER_PERSON"], [130355, 130362, "OTHER_PERSON"], [130462, 130469, "OTHER_PERSON"], [130497, 130504, "OTHER_PERSON"], [130571, 130578, "OTHER_PERSON"], [130685, 130692, "OTHER_PERSON"], [130807, 130810, "JUDGE"], [130813, 130816, "OTHER_PERSON"], [130875, 130882, "OTHER_PERSON"], [131143, 131146, "OTHER_PERSON"], [131149, 131152, "OTHER_PERSON"], [131161, 131168, "OTHER_PERSON"], [131201, 131204, "ORG"], [131241, 131253, "DATE"], [131305, 131317, "DATE"], [131373, 131376, "ORG"], [131519, 131526, "OTHER_PERSON"], [131928, 131935, "PROVISION"], [131943, 131958, "STATUTE"], [132177, 132184, "PROVISION"], [132662, 132669, "OTHER_PERSON"], [132677, 132680, "WITNESS"], [132708, 132715, "OTHER_PERSON"], [132880, 132887, "OTHER_PERSON"], [132988, 132991, "OTHER_PERSON"], [133031, 133038, "OTHER_PERSON"], [133075, 133093, "DATE"], [133173, 133183, "PROVISION"], [133191, 133195, "STATUTE"], [133289, 133292, "OTHER_PERSON"], [133295, 133298, "OTHER_PERSON"], [133317, 133324, "OTHER_PERSON"], [133428, 133431, "OTHER_PERSON"], [133434, 133437, "OTHER_PERSON"], [133441, 133453, "DATE"], [133561, 133568, "OTHER_PERSON"], [133573, 133576, "OTHER_PERSON"], [133579, 133582, "OTHER_PERSON"], [133705, 133708, "ORG"], [133824, 133827, "ORG"], [133857, 133864, "OTHER_PERSON"], [134392, 134399, "OTHER_PERSON"], [134544, 134547, "OTHER_PERSON"], [134550, 134553, "OTHER_PERSON"], [135294, 135301, "OTHER_PERSON"], [135352, 135356, "STATUTE"], [135358, 135374, "PROVISION"], [135382, 135386, "STATUTE"], [136364, 136380, "PROVISION"], [136388, 136392, "STATUTE"], [136523, 136526, "ORG"], [136569, 136573, "STATUTE"], [136908, 136915, "PROVISION"], [136923, 136927, "STATUTE"], [136938, 136945, "PROVISION"], [136958, 136962, "STATUTE"], [137313, 137316, "OTHER_PERSON"], [137318, 137325, "OTHER_PERSON"], [137330, 137344, "ORG"], [137446, 137449, "OTHER_PERSON"], [137570, 137577, "OTHER_PERSON"], [137698, 137701, "OTHER_PERSON"], [137894, 137897, "ORG"], [138278, 138281, "OTHER_PERSON"], [138286, 138293, "OTHER_PERSON"], [138511, 138518, "OTHER_PERSON"], [138602, 138609, "OTHER_PERSON"], [138818, 138821, "ORG"], [139027, 139030, "OTHER_PERSON"], [139035, 139042, "OTHER_PERSON"], [139219, 139226, "OTHER_PERSON"], [139293, 139296, "OTHER_PERSON"], [139360, 139363, "OTHER_PERSON"], [139366, 139369, "OTHER_PERSON"], [139373, 139380, "OTHER_PERSON"], [139436, 139448, "DATE"], [139659, 139662, "OTHER_PERSON"], [139665, 139668, "OTHER_PERSON"], [140299, 140311, "DATE"], [140359, 140366, "OTHER_PERSON"], [140547, 140554, "OTHER_PERSON"], [140597, 140604, "OTHER_PERSON"], [140832, 140839, "OTHER_PERSON"], [140994, 141001, "OTHER_PERSON"], [141255, 141258, "ORG"], [141292, 141295, "ORG"], [141368, 141375, "OTHER_PERSON"], [141534, 141541, "OTHER_PERSON"], [141822, 141825, "OTHER_PERSON"], [142038, 142041, "OTHER_PERSON"], [142316, 142319, "ORG"], [142457, 142460, "ORG"], [142569, 142572, "ORG"], [142645, 142648, "ORG"], [142793, 142796, "ORG"], [142843, 142846, "ORG"], [142917, 142920, "ORG"], [142967, 142979, "DATE"], [142985, 142992, "OTHER_PERSON"], [143039, 143042, "OTHER_PERSON"], [143184, 143187, "OTHER_PERSON"], [143828, 143852, "PROVISION"], [143860, 143864, "STATUTE"], [143875, 143899, "PROVISION"], [143919, 143996, "PRECEDENT"], [144107, 144221, "PRECEDENT"], [144390, 144393, "OTHER_PERSON"], [144530, 144533, "OTHER_PERSON"], [144812, 144827, "JUDGE"], [144854, 144866, "OTHER_PERSON"], [144966, 144970, "STATUTE"], [144974, 144983, "GPE"], [145242, 145245, "OTHER_PERSON"], [145373, 145376, "ORG"], [145401, 145408, "OTHER_PERSON"], [145538, 145541, "ORG"], [145626, 145640, "ORG"], [145704, 145711, "OTHER_PERSON"], [145756, 145770, "ORG"], [145817, 145824, "OTHER_PERSON"], [145830, 145833, "ORG"], [146046, 146053, "OTHER_PERSON"], [146150, 146154, "STATUTE"], [146898, 146905, "OTHER_PERSON"], [147130, 147137, "OTHER_PERSON"], [147200, 147203, "ORG"], [147374, 147381, "OTHER_PERSON"], [147789, 147792, "ORG"], [147820, 147827, "OTHER_PERSON"], [147856, 147859, "OTHER_PERSON"], [147985, 147994, "GPE"], [148179, 148189, "PROVISION"], [148197, 148201, "STATUTE"], [148212, 148222, "PROVISION"], [148310, 148326, "PROVISION"], [148334, 148338, "STATUTE"], [148668, 148687, "JUDGE"], [148729, 148739, "PROVISION"], [148752, 148756, "STATUTE"], [148759, 148768, "PETITIONER"], [148781, 148791, "PROVISION"], [148846, 148855, "ORG"], [148880, 148896, "PROVISION"], [149412, 149422, "PROVISION"], [149517, 149526, "ORG"], [149546, 149549, "ORG"], [149562, 149575, "DATE"], [149577, 149586, "ORG"], [149684, 149687, "ORG"], [149741, 149750, "ORG"], [150052, 150059, "OTHER_PERSON"], [150303, 150310, "OTHER_PERSON"], [150430, 150437, "OTHER_PERSON"], [150473, 150476, "OTHER_PERSON"], [150679, 150686, "OTHER_PERSON"], [150748, 150751, "OTHER_PERSON"], [150758, 150765, "OTHER_PERSON"], [151103, 151110, "OTHER_PERSON"], [151563, 151573, "PROVISION"], [151581, 151585, "STATUTE"], [151838, 151868, "PROVISION"], [151876, 151879, "STATUTE"], [151980, 151990, "PROVISION"], [151998, 152002, "STATUTE"], [152342, 152345, "STATUTE"], [152470, 152478, "PROVISION"], [152486, 152489, "STATUTE"], [152552, 152556, "STATUTE"], [152580, 152588, "PROVISION"], [152596, 152599, "STATUTE"], [152715, 152723, "PROVISION"], [152872, 152889, "PROVISION"], [152897, 152900, "STATUTE"], [152982, 152991, "GPE"], [153215, 153226, "PROVISION"], [153234, 153237, "STATUTE"], [153303, 153310, "PROVISION"], [153318, 153322, "STATUTE"], [153336, 153344, "PROVISION"], [153352, 153355, "STATUTE"], [153495, 153502, "PROVISION"], [153510, 153514, "STATUTE"], [153595, 153599, "STATUTE"], [153752, 153760, "PROVISION"], [153768, 153771, "STATUTE"], [153789, 153792, "ORG"], [153878, 153881, "PROVISION"], [153889, 153893, "STATUTE"], [154067, 154070, "PROVISION"], [154078, 154082, "STATUTE"], [154231, 154234, "ORG"], [154312, 154319, "PROVISION"], [154327, 154331, "STATUTE"], [154345, 154353, "PROVISION"], [154361, 154364, "STATUTE"], [154366, 154384, "PROVISION"], [154392, 154395, "STATUTE"], [154512, 154519, "PROVISION"], [154527, 154564, "STATUTE"], [154653, 154720, "PRECEDENT"], [155475, 155483, "PROVISION"], [155491, 155494, "STATUTE"], [155586, 155593, "PROVISION"], [155601, 155605, "STATUTE"], [155646, 155654, "PROVISION"], [155662, 155665, "STATUTE"], [155898, 155902, "STATUTE"], [156132, 156152, "PROVISION"], [156163, 156171, "PROVISION"], [156230, 156238, "PROVISION"], [156246, 156249, "STATUTE"], [156273, 156276, "STATUTE"], [156320, 156328, "PROVISION"], [156336, 156339, "STATUTE"], [156362, 156371, "PROVISION"], [156379, 156383, "STATUTE"], [156402, 156406, "STATUTE"], [156600, 156603, "STATUTE"], [156733, 156736, "STATUTE"], [156779, 156783, "STATUTE"], [156808, 156812, "STATUTE"], [156905, 156908, "STATUTE"], [156917, 156925, "PROVISION"], [156933, 156936, "STATUTE"], [157030, 157040, "ORG"], [157065, 157073, "PROVISION"], [157081, 157084, "STATUTE"], [157086, 157100, "PROVISION"], [157108, 157111, "STATUTE"], [157136, 157144, "PROVISION"], [157152, 157205, "STATUTE"], [157240, 157291, "STATUTE"], [157373, 157376, "STATUTE"], [157523, 157534, "PROVISION"], [157626, 157635, "GPE"], [157799, 157807, "STATUTE"], [157818, 157826, "OTHER_PERSON"], [157839, 157847, "PROVISION"], [157855, 157863, "STATUTE"], [158332, 158340, "OTHER_PERSON"], [158491, 158494, "STATUTE"], [158607, 158612, "PROVISION"], [158620, 158623, "STATUTE"], [158939, 158946, "PROVISION"], [158954, 158957, "STATUTE"], [159102, 159110, "PROVISION"], [159118, 159121, "STATUTE"], [159235, 159242, "PROVISION"], [159250, 159254, "STATUTE"], [159303, 159308, "PROVISION"], [159454, 159459, "PROVISION"], [159467, 159470, "STATUTE"], [159542, 159546, "STATUTE"], [159635, 159640, "PROVISION"], [159648, 159651, "STATUTE"], [159751, 159759, "PROVISION"], [159767, 159770, "STATUTE"], [159832, 159843, "PROVISION"], [159851, 159854, "STATUTE"], [159904, 159911, "PROVISION"], [159919, 159923, "STATUTE"], [160080, 160088, "PROVISION"], [160096, 160099, "STATUTE"], [160178, 160185, "PROVISION"], [160193, 160197, "STATUTE"], [160258, 160262, "STATUTE"], [160336, 160341, "PROVISION"], [160349, 160352, "STATUTE"], [160603, 160611, "PROVISION"], [160619, 160622, "STATUTE"], [160661, 160669, "PROVISION"], [160677, 160680, "STATUTE"], [160759, 160770, "PROVISION"], [160778, 160781, "STATUTE"], [160824, 160832, "PROVISION"], [160840, 160843, "STATUTE"], [160929, 160936, "PROVISION"], [160944, 160948, "STATUTE"], [161049, 161052, "ORG"], [161121, 161138, "PROVISION"], [161146, 161149, "STATUTE"], [161223, 161232, "GPE"], [161314, 161317, "ORG"], [161441, 161444, "ORG"], [161522, 161525, "ORG"], [161601, 161604, "ORG"], [161704, 161713, "PROVISION"], [161721, 161724, "STATUTE"], [162226, 162229, "OTHER_PERSON"], [162428, 162431, "PROVISION"], [162439, 162442, "STATUTE"], [162448, 162462, "PROVISION"], [162470, 162473, "STATUTE"], [162530, 162536, "PROVISION"], [162544, 162547, "STATUTE"], [162557, 162566, "PROVISION"], [162574, 162577, "STATUTE"], [162592, 162598, "PROVISION"], [162606, 162609, "STATUTE"], [162732, 162749, "PROVISION"], [162757, 162760, "STATUTE"], [162804, 162811, "PROVISION"], [162828, 162834, "PROVISION"], [163203, 163206, "ORG"], [163262, 163269, "OTHER_PERSON"], [163336, 163339, "ORG"], [163431, 163434, "STATUTE"], [163444, 163447, "ORG"], [163565, 163568, "ORG"], [163722, 163724, "OTHER_PERSON"], [163949, 163958, "PROVISION"], [163966, 163970, "STATUTE"], [163989, 163993, "STATUTE"], [164187, 164190, "STATUTE"], [164205, 164207, "OTHER_PERSON"], [164252, 164255, "ORG"], [164390, 164393, "ORG"], [164413, 164417, "STATUTE"], [164473, 164476, "ORG"], [164587, 164590, "ORG"], [164608, 164611, "ORG"], [164648, 164651, "ORG"], [164680, 164692, "DATE"], [164696, 164708, "DATE"], [164766, 164768, "OTHER_PERSON"], [164770, 164773, "ORG"], [164799, 164801, "OTHER_PERSON"], [164823, 164825, "OTHER_PERSON"], [164898, 164901, "ORG"], [164993, 164996, "ORG"], [165025, 165028, "ORG"], [165056, 165064, "PROVISION"], [165072, 165075, "STATUTE"], [165108, 165115, "OTHER_PERSON"], [165211, 165214, "OTHER_PERSON"], [165315, 165318, "ORG"], [165424, 165427, "ORG"], [165627, 165634, "OTHER_PERSON"], [165898, 165905, "OTHER_PERSON"], [166045, 166063, "ORG"], [166158, 166175, "ORG"], [166313, 166320, "OTHER_PERSON"], [166355, 166358, "ORG"], [166404, 166413, "OTHER_PERSON"], [166446, 166449, "ORG"], [166601, 166604, "ORG"], [166687, 166690, "ORG"], [166785, 166788, "ORG"], [166852, 166864, "DATE"], [166981, 166984, "OTHER_PERSON"], [167109, 167120, "PROVISION"], [167128, 167131, "STATUTE"], [167190, 167198, "PROVISION"], [167206, 167209, "STATUTE"], [167289, 167293, "STATUTE"], [167400, 167408, "PROVISION"], [167416, 167419, "STATUTE"], [167538, 167549, "PROVISION"], [167557, 167560, "STATUTE"], [167644, 167652, "PROVISION"], [167660, 167663, "STATUTE"], [167716, 167723, "PROVISION"], [167731, 167735, "STATUTE"], [167978, 167985, "PROVISION"], [167996, 168003, "OTHER_PERSON"], [168229, 168236, "PROVISION"], [168301, 168309, "PROVISION"], [168311, 168325, "JUDGE"], [168350, 168362, "JUDGE"], [168367, 168382, "JUDGE"], [168424, 168444, "OTHER_PERSON"], [168449, 168466, "OTHER_PERSON"]]}
