{"text": "\n\nCove Development Pte Ltd v Ideal Accommodation (Singapore) Pte Ltd\n[2009] SGHC 167\n\nCase Number\n:\nSuit 446/2009, SUM 3519/2009\nDecision Date\n:\n16 July 2009\nTribunal/Court\n:\nHigh Court\nCoram\n:\nNathaniel Khng AR\nCounsel Name(s)\n:\nLing Tien Wah, Joseph Lee, and Tang Jin Sheng (Rodyk & Davidson LLP) for the plaintiff(s); Chia Ho Choon, Lin Shuling Joycelyn, and Kishan Pillay (KhattarWong LLP) for the defendant(s)\nParties\n:\nCove Development Pte Ltd -- Ideal Accommodation (Singapore) Pte Ltd\nCivil Procedure - Judgment on Admission\nLandlord and Tenant - Recovery of possession\n16 July 2009\nJudgment reserved.\nNathaniel Khng AR:\nIntroduction\n\n1 This is an application by Cove Development Pte Ltd (\"the Plaintiff\") for judgment against Ideal Accommodation (Singapore) Pte Ltd (\"the Defendant\") on admission of facts pursuant to O 27 r 3 of the Rules of Court (Cap 322, R 5, 1996 Rev Ed) (\"the Rules\") for possession of 171 residential units at the development known as \"Grangeford\" (located at 25 Leonie Hill Road) (\"the Premises\"). The prayers, as set out in the application, are as follows:\n1. That possession of the [Premises] be forthwith given to the [Plaintiff].\n2. That this Order be made without prejudice to the parties' respective positions and the other reliefs claimed by the parties in the pleadings.\n3. The [Defendant] pay the [Plaintiff] the costs of this application.\n4. Further or other relief as this Honourable Court deems fit.\nThe factual matrix\n\n2 The dispute between the Plaintiff and the Defendant originated from the discovery by the Urban Redevelopment Authority (\"the URA\") of illegal additions/alterations to the Premises. By way of two tenancy agreements (dated 30 December 2008 and 27 February 2009 respectively) (\"the Tenancy Agreements\"), the Plaintiff had leased the Premises to the Defendant. After entering into the Tenancy Agreements, the Defendant proceeded to sub-divide 141 of the residential units in the Premises into 600 sub-units and thereafter leased these units out to sub-tenants (\"the Sub-Tenants\").\n3 On 29 April 2009, the URA served an enforcement notice (\"the Enforcement Notice\") notifying both the Plaintiff and the Defendant that the additions/alterations carried out by the Defendant in the Premises was in breach of planning control as it had done the works without the requisite planning authorisation. The Enforcement Notice described the works that had been done as follows:\n(i) [A]dditions and alterations were carried out to physically partition and convert each of the residential units from a single unit to two separate units, thereby materially changing the use of each of the residential units from that approved as a single dwelling to the use as two separate units; and\n(ii) additions and alterations were carried out to physically convert the bigger of the aforesaid two separate units (\"the affected premises\") created from each of the residential units to multiple living quarters, thereby materially changing the use of the affected premises from that approved for residential use to a non-residential use as multiple living quarters.\n4 The Enforcement Notice gave both parties the deadline of 30 May 2009 to, firstly, demolish the unauthorised partitions in question, and, secondly, discontinue and cease the unauthorised use of each of the altered units as two separate units and/or as multiple living quarters. Failing this, the parties would have committed an offence under the Planning Act (Cap 232, 1998 Rev Ed) and would be liable on prosecution and conviction to a fine not exceeding $200,000 or to imprisonment for a term not exceeding one year, or to both a fine and imprisonment. Both parties appealed to the Ministry of National Development (\"the MND\") against the directions in the Enforcement Notice. The Defendant's appeal was rejected in a letter dated 27 May 2009 and it was given the extended deadline of 3 June 2009 to comply with the directions in the Enforcement Notice. The Plaintiff's appeal was likewise rejected in a letter dated 27 May 2009 and it was given the deadline of 27 July 2009 to comply with the directions in the Enforcement Notice.\n5 Subsequently, on 25 May 2009, the Plaintiff filed the present action, ie, Suit No 446 of 2009, against the Defendant for, inter alia, possession of the Premises, rental in arrears and double rent. In its Statement of Claim, the Plaintiff asserted that the Defendants had failed to make the requisite payments of rent and other moneys as stipulated in the Tenancy Agreements, and that accordingly, the Plaintiff was entitled to forfeit the Tenancy Agreements. In reply, the Defendant stated, in its Defence and Counterclaim, that, inter alia, the Tenancy Agreements was void by reason of a common mistake and that it was discharged from performance of the Tenancy Agreements by reason of frustration.\n6 On 29 May 2009, the Defendant wrote to inform the MND that it was impossible to comply with the directions in the Enforcement Notice by 3 June 2009 as it had \"yet to notify [the Sub-Tenants] and properly relocate them\", and appealed for more time to comply with the directions. On 3 June 2009, the MND rejected the Defendant's appeal. On the same day, ie, 3 June 2009, the Plaintiff served the Defendant with a Notice of Forfeiture and Termination. On 5 June 2009, the Plaintiff recovered possession of unit #01-04 of the Premises, which had been used by the Defendant as its office.\n7 To date, the Plaintiff has only re-entered and recovered possession of 14 other units of the Premises. According to the Plaintiff, it has not been able to effect peaceful re-entry of the units that are currently still being occupied by certain Sub-Tenants (collectively referred to as \"the remaining Sub-Tenants\") due to the resistance of the latter, and without possession of the whole of the Premises, it (ie, the Plaintiff) would not be able to comply with the directions in the Enforcement Notice and would be liable for sanctions.\n8 In the circumstances, the Plaintiff decided to file the present application for judgment for possession of the Premises.\nOrder 27 r 3 of the Rules\n\n9 Under O 27 r 3 of the Rules, where there are admissions of fact, the court may, at its discretion, give judgment or make such orders as a party would be entitled to. The rule, in full, states as follows:\nJudgment on admission of facts (O.27, r.3)\nWhere admissions of fact are made by a party to a cause or matter either by his pleadings or otherwise, any other party to the cause or matter may apply to the Court for such judgment or order as upon those admissions he may be entitled to, without waiting for the determination of any other question between the parties, and the Court may give such judgment, or make such order, on the application as it thinks just. An application for an order under this Rule may be made by summons.\n10 The rule providing for judgment on admissions \"applies wherever there is a clear admission of facts in the face of which it is impossible for the party making it to succeed\" (Ellis v Allen [1914] 1 Ch 904 at 909 per Sargant J). The judgment or order made under the rule would be considered to be interlocutory in nature (Technistudy Ltd v Kelland [1976] 1 WLR 1042 at 1045). The admission of fact may be expressed or implied (Re Chung Wong Kit\n[1999] 1 HKC 684\nat 686). The admission must be an admission of fact, with which the court need not make further findings of fact, and must not be an admission of law, or even one of mixed fact and law. Neither can the matter turn on a question of law or mixed fact and law. As stated in Shunmugam Jayakumar v Jeyaretnam JB\n[1997] 2 SLR 172\n(\"Shunmugam Jayakumar\") by G P Selvam J (at [35]):\nIt is important to note that the discretionary power of the court to give a judgment under [O 27 r 3] can be exercised only where a defendant has made admissions of fact. It means that the defendant must have made such admissions that it is unnecessary for the Court to make findings of fact -- it having been admitted by the defendant they are no longer in issue. If the matter involves question [sic] of law, admissions of fact alone cannot decide the matter. The rule therefore excludes admissions of non-factual matters -- such as comments, opinions and admissions of law or mixed facts and law.\nAnd in Affin Bank Bhd v Successcom Enterprise Sdn Bhd\n[2009] 1 MLJ 36\n(\"Affin Bank Bhd\"), Zulkefli JCA similarly stated (at 51):\nIf liability turns on a question of law or mixed fact and law, judgment cannot be obtained (see the case of Perwira Habib Bank (M) Bhd v Hj Abdullah Hj Sulaiman & Anor\n[1985] CLJ 639\n(Rep);\n[1985] 2 CLJ 489\n). As such, if a plaintiff cannot show that all the components of his cause of action have been admitted, the plaintiff is not entitled to judgment under O 27 r 3 of the RHC [ie, the equivalent of O 27 r 3 of the Rules].\n11 Questions of mixed fact and law have been described as questions that involve a combination of issues of fact and law (Butterworths Concise Australian Legal Dictionary (Peter Butt gen ed) (3rd Ed, LexisNexis Butterworths, 2004) (\"Butterworths Concise Australian Legal Dictionary\") at p 284). The definition of an issue or question of law, in particular, has been the subject of much debate. In the recent case of Ng Eng Ghee v Mamata Kapildev Dave\n[2009] SGCA 14\n(\"Horizon Towers\"), V K Rajah JA, who delivered the judgment of the Court of Appeal, observed that the definition of the phrase \"question of law\" varies in different contexts, and \"may be wider or narrower depending on the underlying policy considerations\" (at [99]). Locally, questions of law have been expressly defined in some cases as being a reference to undecided or uncertain areas of the law that have to be adjudicated upon. In Ahong Construction (S) Pte Ltd v United Boulevard Pte Ltd\n[2000] 1 SLR 749\n(\"Ahong Construction\"), G P Selvam JC stated (at [7]):\nA question of law means a point of law in controversy which has to be resolved after opposing views and arguments have been considered. It is a matter of substance the determination of which will decide the rights between the parties.\nThis passage was cited with approval by the Court of Appeal in Northern Elevator Manufacturing Sdn Bhd v United Engineers (Singapore) Pte Ltd (No 2)\n[2004] 2 SLR 494\n(\"Northern Elevator\"). In Northern Elevator, Choo Han Teck J, who delivered the judgment of the Court of Appeal, concluded (at [19]):\nTo our mind, a \"question of law\" must necessarily be a finding of law which the parties dispute, that requires the guidance of the court to resolve.\n12 The approach in Ahong Construction and Northern Elevator was adopted in the context of s 28(2) of the Arbitration Act (Cap 10, 1985 Rev Ed), a provision which allowed for an appeal to the court \"on any question of law arising out of an award made on an arbitration agreement\". Rajah JA observed that this approach, which he termed as the \"narrower approach\", was appropriate in that context in view of the legitimate expectations of parties to an arbitration as regards finality (Horizon Towers at [100]). If the approach in Ahong Construction and Northern Elevator were to be taken as the narrower approach, one example of a wider approach would be an approach which accepts that the application of incontrovertible law to fact is also a question of law. Such an approach appears to be espoused in the definition for the phrase \"question of law\" which is found in Butterworths Concise Australian Legal Dictionary. This reads (id at p 359):\nQuestion of law A question to be resolved by applying legal principles, rather than by determining a factual situation; an issue involving the application or interpretation of a law and reserved for a judge.\n13 That said, the underlying basis for O 27 r 3 is that, where appropriate, a judgment or order would be made pursuant to the rule \"so as to save time and costs\" (Singapore Civil Procedure 2007 (G P Selvam chief ed) (Sweet & Maxwell Asia, 2007) at para 27/3/6; see also Ellis v Allen (\n[10]\nsupra) at 908-909). As such, it would not be inappropriate to draw from the approach taken in Ahong Construction and Northern Elevator as opposed to a wider approach, such as that which appears to have been set out in Butterworths Concise Australian Legal Dictionary (\n[11]\nsupra), which could make it overly difficult for a judgment or order under the rule to be granted where deserving. That being the case, so long as settled law is applied to an admission of fact, it cannot be said that the matter at hand turns on a question of law. In contrast, if the relevant law were controvertible, it would not be appropriate to grant judgment under O 27 r 3.\n14 In terms of principles, one final point should be made. Even if the requisite admissions of fact are present, the power to grant judgment under O 27 r 3 of the Rules is discretionary. Such discretion will be exercised judiciously depending on the circumstances of the case. As observed by Kekewich J in In re Wright [1895] 2 Ch 747, the obtaining of a judgment or order under the rule for judgment on admissions of fact \"[is] not a matter of right, but [is] a matter for the exercise of a judicial discretion, regard being had to all the circumstances of the case\" (at 750).\n15 There appears to be a dearth of local cases on applications for judgment or orders pursuant to O 27 r 3. Two cases, however, exist which bear note. The first case would be Shunmugam Jayakumar (\n[10]\nsupra). The dispute in that case concerned a publication by a political group which the plaintiffs felt had defamed them. The plaintiffs applied for summary judgment under O 14, and, in the alternative, judgment under O 27 r 3. At first instance, interlocutory judgment under O 27 r 3 was granted. Selvam J, however, allowed the appeal against the O 27 r 3 judgment. The reasons he gave are as follows (id at [36]-[37]):\n36 ... [D]efamation cases of the present kind are unsuitable for an application under O 27 r 3. The reason is that such cases involve matters of law, questions of mixed law and fact and opinions. 'It is well settled', said Lord Morris in Jones v Skelton [1963] 1 WLR 1362 at p 1376, 'that the question whether words which are complained of are capable of conveying a defamatory meaning is a question of law and is therefore one calling for decision by the court. If the words are so capable then it is a question for the jury to decide whether the words do in fact convey a defamatory meaning. In deciding whether words are capable of conveying a defamatory meaning the court will reject those meanings which can only emerge as the product of some strained or forced or utterly unreasonable interpretation.' In deciding defamation actions where the defence of 'fair comment on a matter of public interest' may be or is raised and malice is raised to counter such a defence, complicated question of law or law and fact are likely to be involved. In such cases, if the admissions extend beyond pure facts the case does not come within the words of O 27 r 3.\n37 In my view this is a case where the admissions are not confined to matters of pure fact only. They involve questions of law and mixed law and fact. I therefore decline to give judgment under O 27 r 3.\n16 The second case would be Ow Chor Seng v Coutts Bank (Schweiz) AG\n[2002] 4 SLR 948\n(\"Ow Chor Seng\"). In that case, the defendant, a bank, extended banking facilities to the plaintiff. A dispute arose between the parties and an action was filed by the plaintiff. In its defence and counterclaim, the defendant claimed the sums of $15,875,962.77 and $170,374.69, as well as further interest, expenses and legal costs, from the plaintiff. In the course of his pleadings, the plaintiff admitted that he was liable to the defendant for a sum of money, viz, $10,767,707.18. In dismissing the defendant's application for judgment for that sum under O 27 r 3, the court held (id at [17]):\n... In the present case, although [the plaintiff] had admitted to drawing down the sum in question he had, crucially, pleaded that the [defendant] was precluded from recovering from him in view of [its] alleged breaches .... If he is right on this issue, then he would not be liable. To give judgment for the [defendant] against [the plaintiff] would determine this issue. In an application under this rule the court would only consider whether there is a clear admission of any fact that would entitle the other party to such judgment as he may be entitled to upon those admissions. The court would not examine the likelihood of success of any pleading -- unlike in an application under O 14. Order 27r 3 is intended to provide an immediate judgment based on clear admissions of fact and there is no scope for any consideration of the veracity of the pleadings unless it is clearly untenable.\nThe admissions in the present case\n\n17 Counsel for the Plaintiff, Mr Ling Tien Wah, submitted that the Defendant had implicitly admitted that it was not entitled to possession of the property. Counsel for the Defendant, Mr Chia Ho Choon, in response, submitted that the application for judgment under O 27 r 3 was fundamentally wrong, as the Defendant had not made any admission that the Plaintiff was entitled to possession. Mr Chia further submitted that the Plaintiff's case for possession should be against the remaining Sub-Tenants, and not the Defendant, as the Defendant is presently not in possession of the Premises. This appeared to be the thrust of Mr Chia's case. In my view, however, this submission is misconceived (for the reasons set out at\n[18]\n-\n[20]\nbelow). Crucially, based on the pleadings and submissions before me, the parties were ad idem on the fact that the Tenancy Agreements were no longer in force.\n18 Based on this admission of fact that the Tenancy Agreements were no longer in force, the Plaintiff would clearly be entitled to possession as against the Defendant. No further finding of fact or admission of fact would be necessary. As Mr Ling submitted, at common law, the obligation of tenants to deliver possession of the demised premises to the landlord at the end of a tenancy is clear. This principle has been established and upheld in cases such as Henderson v Squire (1869) LR 4 QB 170. It can be traced back to Harding v Crethorn (1793) 1 Esp 57; 170 ER 278, where Lord Kenyon stated (at 57; 279):\nWhen a lease is expired, the tenant's responsibility is not at an end ; for if the premises are in possession of an under-tenant, the landlord may refuse to accept the possession, and hold the original lessee liable ; for the lessor is entitled to receive the absolute possession at the end of the term. But it may be proved, that the lessor had accepted the under-tenant as his tenant, as by his having accepted the key from the original lessee, while the under-tenant was in possession, by his acceptance of rent from him, or by some act tantamount to it. [emphasis added]\n19 Pre-1826 English case law, of course, applies locally unless being superseded by local statutes or being contrary to local statutes or customs (Tan Sook Yee, Principles of Singapore Land Law (Butterworths Asia, 2nd Ed, 2009) at p 4). Thus, Lye Lin Heng, Landlord and Tenant (Butterworths, 1990) states (at pp 277-278):\nWhen a tenancy comes to an end, by whatever means (whether by effluxion of time, notice to quit, forfeiture etc), the landlord is entitled to possession of the premises. The tenant is therefore under an obligation to deliver up to his landlord vacant possession of the whole of the premises, together with all buildings, structures and fixtures and fittings that he is not entitled to remove. The tenant must therefore ensure that his subtenants vacate the premises. If there are subtenants still remaining, the tenant will be liable to his landlord for the expenses incurred in their removal.\nLikewise, Halsbury's Laws of Singapore vol 14(2) (Butterworths Asia, 2005 Reissue) states (at para 170.1113):\n[170.1113] Liability to restore possession\nA lease usually contains a covenant on the tenant's part to deliver up the premises on the determination of the term. In the absence of such a covenant or of any express stipulation, the tenant is under an implied contract to restore possession to the landlord. ...\n20 If a tenant is obligated to restore possession to the landlord at the end of a lease, whether or not the Defendant is presently in possession of the Premises is irrelevant. As the Defendant had an obligation to deliver vacant possession of the Premises to the Plaintiff upon the ending of the Tenancy Agreements, it follows that its admission that the Tenancy Agreements had ended allows for judgment for possession under O 27 r 3 to be entered against it. In contrast to Shunmugam Jayakumar (\n[10]\nsupra), there were no questions of law or mixed law and fact, as the relevant law is well established (see\n[11]\n-\n[13]\nabove). And in contrast to Ow Chor Seng (\n[16]\nsupra), even if the Defendant were to be successful in defending itself against the Plaintiff's claim, it would still have to deliver possession, as it (ie, the Defendant) was not disputing that the Tenancy Agreements had come to an end.\n21 For completeness, some of the aspersions on the Plaintiff's right to possession as against the Defendant that were cast by Mr Tang Yong, the Defendant's managing director, in his affidavit dated 10 July 2009, will be considered. In that affidavit, Mr Tang had claimed that the Plaintiff had, in a letter dated 12 June 2009 at para 9, acknowledged that it had already re-entered and re-possessed the Premises. This observation, however, is clearly untenable as the letter simply states that the Plaintiff \"will now take steps to repossess [the Premises]\" and para 9 merely makes the qualification that any action taken by the Plaintiff to repossess the Premises would be \"without prejudice whatsoever to [the Plaintiff's] claim\" in the action against the Defendant.\n22 Mr Tang, in his affidavit, also touched on the Plaintiff's attempts to placate the Sub-Tenants by allowing them to stay at the Premises up to 30 June 2009. However, it would be bizarre if the Plaintiff's attempts at achieving an amicable settlement of the impasse were to be construed as having an adverse effect on its right to possession as against the Defendant. Based on what was adduced, there was nothing to indicate that the Plaintiff was waiving its right to vacant possession as against the Defendant even if its endeavours were to fail. No plausible issue of a waiver is apparent, and there was little, if not any, attempt by Mr Chia to submit that there was. Parenthetically, I would also observe that there is case law, viz,\nCheer City Properties Ltd v Lung Tin International Ltd\n\n[1998] 4 HKC 182\n, which indicates that the Plaintiff's efforts to obtain the cooperation of the Sub-Tenants should not affect its right to possession as against the Defendant (at 188).\nExercise of discretion\n\n23 Mr Chia submitted that there would be prejudice to the Defendant if an order for possession were to be granted, due to the bad publicity that the Defendant had received concerning the plight of the Sub-Tenants. As Mr Ling submitted, however, any prejudice in this respect would be ameliorated somewhat by the prayer in the application that any orders made are to be without prejudice to, inter alia, the parties' respective positions (see\n[1]\nabove). Mr Chia also submitted that there would be prejudice as the Defendant would not be able to recover its fittings and furnishings. The prejudice, if any, in this respect, however, is not irreparable as the Defendant could have recourse to the law for any illegal removal or destruction of its fittings and furnishings by the Plaintiff. In contrast, the prejudice that may be suffered by the Plaintiff if judgment for possession is not given (viz, conviction and sentence for an offence under the Planning Act) is irreparable.\n24 Having regard to the all of the circumstances, I am satisfied that my discretion should be exercised in favour of the Plaintiff. In so deciding, I am conscious of the predicament of the remaining Sub-Tenants. If judgment for possession were to be granted, the remaining Sub-Tenants would necessarily be affected; but there would still be some room for them to challenge the Plaintiff's entitlement to possession. In order to obtain leave to issue a Writ of Possession, the Plaintiff will have to show that each of the remaining Sub-Tenants has received sufficient notice of the proceedings as would be necessary for him or her to apply to the court for relief. In this regard, it would be apposite to set out O 45 r 3 of the Rules in full:\nEnforcement of judgment for possession of immovable property (O.45, r.3)\n3.--(1) Subject to these Rules, a judgment or order for the giving of possession of immovable property may be enforced by one or more of the following means:\n(a) writ of possession;\n(b) in a case in which Rule 5 applies, an order of committal.\n(2) A writ of possession to enforce a judgment or order for the giving of possession of any immovable property shall not be issued without the leave of the Court except where the judgment or order was given or made in a mortgage action to which Order 83 applies.\n(3) Such leave shall not be granted unless it is shown that every person in actual possession of the whole or any part of the immovable property has received such notice of the proceedings as appears to the Court sufficient to enable him to apply to the Court for any relief to which he may be entitled.\n(4) A writ of possession may include provision for enforcing the payment of any money adjudged or ordered to be paid by the judgment or order which is to be enforced by the writ.\n[emphasis added]\nConclusion\n\n25 For the foregoing reasons, I grant orders in terms for prayers 1 and 2 as set out earlier (see\n[1]\nabove). I will hear the parties on costs.\nCopyright (c) Government of Singapore.\n", "label": [[2, 84, "PRECEDENT"], [194, 208, "JUDGE"], [230, 243, "LAWYER"], [245, 255, "LAWYER"], [261, 275, "LAWYER"], [321, 334, "LAWYER"], [336, 356, "LAWYER"], [362, 375, "LAWYER"], [425, 449, "RESPONDENT"], [610, 624, "JUDGE"], [671, 695, "ORG"], [1557, 1586, "ORG"], [2050, 2063, "DATE"], [2069, 2072, "ORG"], [3163, 3174, "DATE"], [3451, 3486, "STATUTE"], [3689, 3721, "ORG"], [4215, 4234, "CASE_NUMBER"], [4846, 4857, "DATE"], [4893, 4896, "ORG"], [5141, 5144, "ORG"], [6088, 6100, "PROVISION"], [6123, 6131, "PROVISION"], [7028, 7064, "PRECEDENT"], [7174, 7225, "PRECEDENT"], [7282, 7320, "PRECEDENT"], [7585, 7637, "PRECEDENT"], [7665, 7675, "JUDGE"], [7781, 7790, "PROVISION"], [8296, 8358, "PRECEDENT"], [8379, 8387, "JUDGE"], [8526, 8626, "PRECEDENT"], [8779, 8787, "PROVISION"], [8795, 8798, "STATUTE"], [8822, 8830, "PROVISION"], [9262, 9330, "PRECEDENT"], [9332, 9341, "JUDGE"], [9749, 9823, "PRECEDENT"], [9848, 9858, "JUDGE"], [10177, 10279, "PRECEDENT"], [10325, 10338, "JUDGE"], [10582, 10622, "ORG"], [10653, 10660, "PROVISION"], [10668, 10705, "STATUTE"], [10843, 10848, "JUDGE"], [11091, 11109, "ORG"], [11754, 11762, "PROVISION"], [12100, 12118, "ORG"], [12123, 12140, "ORG"], [12651, 12659, "PROVISION"], [12808, 12816, "PROVISION"], [12953, 12961, "JUDGE"], [13337, 13345, "PROVISION"], [13414, 13433, "OTHER_PERSON"], [13613, 13617, "PROVISION"], [13659, 13667, "PROVISION"], [13717, 13725, "PROVISION"], [13739, 13745, "JUDGE"], [13789, 13797, "PROVISION"], [13948, 13956, "PROVISION"], [14090, 14096, "OTHER_PERSON"], [15008, 15016, "PROVISION"], [15212, 15220, "PROVISION"], [15250, 15306, "PRECEDENT"], [15866, 15874, "PROVISION"], [16593, 16610, "PROVISION"], [16868, 16881, "LAWYER"], [17022, 17035, "LAWYER"], [17100, 17108, "PROVISION"], [17228, 17232, "OTHER_PERSON"], [17462, 17466, "OTHER_PERSON"], [18186, 18223, "PRECEDENT"], [18250, 18296, "PRECEDENT"], [18309, 18315, "OTHER_PERSON"], [19059, 19071, "OTHER_PERSON"], [19155, 19167, "OTHER_PERSON"], [20672, 20680, "PROVISION"], [20722, 20741, "OTHER_PERSON"], [20895, 20907, "RESPONDENT"], [21282, 21291, "OTHER_PERSON"], [21407, 21411, "OTHER_PERSON"], [21927, 21931, "OTHER_PERSON"], [22563, 22567, "OTHER_PERSON"], [22661, 22733, "PRECEDENT"], [22933, 22937, "OTHER_PERSON"], [23147, 23151, "OTHER_PERSON"], [23384, 23388, "OTHER_PERSON"], [23875, 23887, "STATUTE"], [24617, 24625, "PROVISION"], [24926, 24932, "PROVISION"], [25210, 25218, "PROVISION"], [25898, 25921, "ORG"]]}
