{"text": "\n\nIN THE GENERAL DIVISION OF THE HIGH COURT OF THE REPUBLIC OF SINGAPORE\n[2024] SGHC 78\n\nCriminal Case No 1 of 2023\nBetween\nPublic Prosecutor\nAnd\nMasri bin Hussain\nGROUNDS OF DECISION\n\n[Criminal Law -- Statutory offences -- Misuse of Drugs Act]\nPublic Prosecutor\nv\nMasri bin Hussain\n[2024] SGHC 78\n\nGeneral Division of the High Court -- Criminal Case No 1 of 2023\nPang Khang Chau J\n12-13, 17-19, and 25 January, 16 October 2023\n18 March 2024\nPang Khang Chau J:\nIntroduction\n\n1 Masri bin Hussain, a 52-year-old Singaporean male (\"the Accused\"), claimed trial to a capital charge of possessing for the purpose of trafficking three packets of granular/powdery substance weighing not less than 1,381.3g which were analysed and found to contain not less than 23.86 g of diamorphine (\"the Drugs\"), which is an offence under section 5(1)(a) read with s 5(2) of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (the \"MDA\") and punishable under s 33(1) of the MDA. Four other charges against the Accused were stood down by the Prosecution at the commencement of the trial.\n2 Having considered the submissions of the Defence and the Prosecution, I convicted the Accused on the proceeded charge and imposed the mandatory death sentence on him. The Accused has appealed against my decision.\nFacts\n\n3 According to the Statement of Agreed Facts jointly tendered by the Prosecution and the Defence pursuant to s 267 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (the \"CPC\"), the facts set out at [4]-[13] below are undisputed.\nEvents leading up to the accused's arrest on 11 November 2020\n\n4 On 10 November 2020, the Accused had arranged with a person he knew as \"Abang\" to purchase 3 \"bola\" of heroin for S$10,500. The Accused used his mobile phone to communicate with \"Abang\", whose contact was stored in the Accused's phone as \"Dougggg\". To fund this purchase, the Accused asked to borrow S$3,500 from PW44 Zaharah binte Ishak (\"Zaharah\"), who was the Accused's childhood friend. Zaharah agreed to lend the Accused the money.\n5 On 11 November 2020, the Accused asked a taxi driver friend, Saharuden bin Haniffa (\"Saharuden\"), to pick him up from Blk 603 Tampines Avenue 9. The Accused got to know Saharuden when they were both in the Drug Rehabilitation Centre. Saharuden picked the Accused up in his taxi. The Accused was carrying a sling bag. On the Accused's instructions, Saharuden drove to 8 Siglap Road (\"Siglap Court\"), where Zaharah boarded the taxi and handed the accused the S$3,500 which she had agreed to lend him.\n6 Thereafter, the Accused instructed Saharuden to drive to Blk 140 Bedok Reservoir Road, where he alighted and returned sometime later. He then asked Saharuden to drive around the vicinity of Bedok Reservoir, and eventually directed Saharuden to drive to Blk 143 Bedok Reservoir Road (\"Blk 143\"), after receiving instructions from \"Abang\" through calls and text messages.\n7 At Blk 143, the Accused alighted from the taxi, carrying his sling bag. Saharuden and Zaharah remained in the taxi. At about 2.32pm, the Accused went by himself to the third floor of Blk 143. There, he retrieved a \"Yamaha\" brand drawstring bag (the \"Yamaha Drawstring Bag\"), left S$10,500 behind and took a photograph of the money. At about 2.34pm, the Accused took the stairs down to the ground floor, carrying the Yamaha Drawstring Bag and his sling bag. The Accused then returned to Saharuden's taxi and asked Saharuden to send Zaharah back to Siglap Court.\nThe arrest\n\n8 En route to Siglap Court, officers from the Central Narcotics Bureau (\"CNB\") intercepted Saharuden's taxi at about 2.50pm. The Accused was seated in the front passenger seat and Zaharah was seated in one of the rear passenger seats. The Accused, Saharuden and Zaharah were arrested, escorted into CNB operational cars and brought to Siglap Court. PW24 Staff Sergeant Muhammad Helmi bin Abdul Jalan (\"SSgt Helmi\") then drove Saharuden's taxi into the Siglap Court compound, where PW20 Station Inspector Tay Keng Chye (\"SI Sunny\") subsequently conducted a search of the vehicle.\n9 During the search, SI Sunny recovered the Yamaha Drawstring Bag from the front passenger floorboard, which was found to contained three black bundles, marked as \"A1A\", \"A1B\" and \"A1C\". There was no dispute that the three black bundles contained not less than 1,381.3g of granular/powdery substance which were forensically analysed by the Health Sciences Authority (\"HSA\") and found to contain in aggregate not less than 23.86g of diamorphine.\n10 Following the search of the taxi, PW21 Senior Staff Sergeant Goh Jun Xian conducted the search of the Accused and recovered the sling bag he was carrying, which was found to contain two packets of granular/powdery substance (marked as \"D1B\" and \"D1C\") and one sachet of white crystalline substance (marked as \"D1D\"), and one straw of granular/powdery substance (marked as \"D1B1\"). \"D1B\", \"D1C\" and \"D1B1\" weighed a total of not less than 5.16g, and were analysed by the HSA and found to contain not less than 0.04g of diamorphine. \"D1D\" weighed not less than 3.30g and was analysed by the HSA and found to contain not less than 2.25g of methamphetamine. These drugs formed the subject of the stood down charges.\n11 The chain of custody of the seized drug exhibits was not disputed by the accused.\nThe Accused's urine sample\n\n12 Urine was sample taken from the Accused at 7.05pm on 11 November 2020. This was analysed by HSA and found to contain metheamphetamine and morphine.\nThe Accused's Statements\n\n13 The Accused gave various statements under ss 22 and 23 of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (the \"CPC\"). It was undisputed that the statements were given voluntarily and without threat, inducement or promise.\nThe Accused's admission that he was in possession of the Drugs and had knowledge of the nature of the Drugs\n\n14 In addition to the undisputed facts set out in the Statement of Agreed Facts, it was also undisputed that the Accused was in possession of the Drugs and had knowledge that the Drugs contained diamorphine.\nThe parties' cases\n\n15 The Prosecution's case was that, since the Accused had admitted to the having possession of the Drugs and knowledge of their nature, he is presumed to have the Drugs in his possession for the purpose of trafficking: see Zainal bin Hamad v Public Prosecutor [2018] 2 SLR 1119 at [47] to [48]. Further, the Prosecution's case is that the Accused is unable to rebut the presumption of trafficking on the balance of probabilities.\n16 The Defence's case is that, although the Accused did not deny possession or knowledge of nature of the Drugs, the Accused purchased the Drugs solely for his own consumption and he had no intention of trafficking in the Drugs (the \"Consumption Defence\").\nOverview of the applicable legal principles\nThe elements of a charge of possession for the purposes of trafficking\n\n17 To make out a charge of possession for the purposes of trafficking under s 5(1)(a) read with s 5(2) of the MDA, the Prosecution bears the burden of proving the following elements (see Muhammad Ridzuan bin Md Ali v Public Prosecutor and other matters [2014] 3 SLR 721 at [59]):\n(a) possession of a controlled drug (which may be proved or presumed under s 18(1) of the MDA, or deemed under s 18(4) of the MDA);\n(b) knowledge of the nature of the drug (which may be proved or presumed under s 18(2) of the MDA); and\n(c) possession of the controlled drug was for the purpose of trafficking which was not authorised.\nThe statutory presumption of trafficking\n\n18 As the Accused did not dispute possession of and knowledge of the nature of the Drugs, the Prosecution invoked the presumption of trafficking under s 17(c) of the MDA, which provides that:\nPresumption concerning trafficking\n17. Any person who is proved to have had in his or her possession more than --\n...\n(c) 2 grammes of diamorphine;\n...\nwhether or not contained in any substance, extract, preparation or mixture, is presumed to have had that drug in possession for the purpose of trafficking unless it is proved that his or her possession of that drug was not for that purpose.\n19 Where the presumption of trafficking is successfully invoked, the burden of proof shifts to the accused person to rebut that presumption on a balance of probabilities.\nIssues for determination\n\n20 Given the nature of the parties' cases as outlined at [15]-[16] above, I found that the Prosecution has proven beyond reasonable doubt that the Accused had possession of the Drugs, and that the Accused knew that the Drugs were diamorphine. Accordingly, the presumption of trafficking under s 17(c) of the MDA was successfully invoked by the Prosecution, and the burden fell on the Accused to rebut that presumption on a balance of probabilities. The Accused sought to discharge this burden by raising the Consumption Defence. Therefore, the only issue to be determined is whether the Defence has proven the Consumption Defence on the balance of probabilities.\nEvaluation of the Accused's Consumption Defence\nOverview of parties' submissions concerning the Consumption Defence\n\n21 The Defence submitted that the Accused purchased the Drugs for the price of $10,500, because this represented a \"good deal\", in that he was thereby a securing a cheaper price for his heroin consumption by purchasing in bulk. A second reason advanced by the Defence was that by purchasing in bulk, it would minimise the Accused's risk of getting caught as he would then not need to make multiple trips to purchase smaller quantities of heroin. The Defence submitted that, given the Accused's rate of consumption of 3.75g of heroin (gross weight) per day, the Drugs would have lasted the accused nine to ten months, and it was credible for the Accused to have purchased nine to ten months' supply of drugs for his own consumption. The Defence further submitted that this purchase was within the Accused's means as he had sufficient savings and had also secured a loan of $3,500 from a friend. Finally, the Defence pointed out that the Consumption Defence is supported by the lack of evidence of drug trafficking paraphernalia and the lack of evidence of the Accused having a list of customers.\n22 The Prosecution relied on the Accused's admission in various statements made to the CNB that he intended to sell the Drugs to make money. The Prosecution also pointed out that the Accused did not raise the Consumption Defence in his cautioned statement. Instead, when asked for his defence, the Accused's response was: \"Nothing. I hope the weight will be less than 15 grams so that I will not be sentenced to death.\" The Prosecution submitted that the Accused had grossly exaggerated his rate of consumption, which the Prosecution calculated to be less than 0.8g (gross weight) per day (instead of 3.75g as claimed by the accused). This meant that the Drugs would have lasted the Accused several years instead of nine to ten months. In any event, the Prosecution submitted that the Accused had no reasonable explanation for stockpiling a large quantity of drugs amounting to nine to ten month's supply solely for his own consumption. The Prosecution further submitted that the Accused did not have the financial means to purchase such a large quantity of drugs solely for the purpose of consumption given that his take home pay did not exceed $2,500 per month. Finally, the Prosecution submitted that the Accused's admission that he had not made any plans concerning the storage of the Drugs shows that he never intended to stockpile the Drugs for his own consumption but was instead planning to resell the Drugs.\nPrinciples applicable to a defence of consumption\n\n23 The principles applicable to a defence of consumption was helpfully summarised by the Court of Appeal in A Steven s/o Paul Raj v Public Prosecutor [2022] 2 SLR 538 (\"A Steven\") in the following passage (at [22]--[25]):\n22 We begin with a brief restatement of the principles applicable to the consumption defence. In a case such as the present, where the presumption of trafficking in s 17(c) of the MDA is engaged, the burden is on the appellant to prove on a balance of probabilities that the diamorphine in his possession was not for the purpose of trafficking (see Jusri bin Mohamed Hussain v Public Prosecutor [1996] 2 SLR(R) 706 (\"Jusri\") at [31] and Low Theng Gee v Public Prosecutor [1996] 3 SLR(R) 42 at [78]). As Yong Pung How CJ observed in Jusri at [63], while it is often difficult for an accused person to adduce any other evidence apart from his own testimony, \"it must follow from the statutory presumption in s 17 of the [MDA] that an accused found in possession of a large quantity of drugs faces an uphill task\". Moreover, if all an accused person can adduce is a bare allegation, the onus is on the trial judge to believe or not believe him, and an appellate court \"would be most reluctant to disturb any such finding\" (Jusri at [64]).\n23 The relevant Parliamentary debates are also instructive in shedding light on the basis for this presumption. For instance, at the Second Reading of the Misuse of Drugs (Amendment) Bill (Bill No 55/75), the then-Minister for Home Affairs and Education, Mr Chua Sian Chin (\"Mr Chua\"), sought to \"allay the fear of those who may have the impression that drug addicts might inadvertently be hanged as a result of their having in their possession a controlled drug which contains more than 15 grammes of pure heroin [the street name for diamorphine]\" (so as to exceed the capital punishment threshold set out in the Second Schedule to the MDA). Mr Chua explained that the diamorphine commonly used by drug abusers and addicts in Singapore was usually mixed with other substances, such that the resultant mixture contained about 40% pure diamorphine and 60% adulterants. In these circumstances - having regard to the amount of these mixed substances that an accused person would need to be in possession of in order for him to be at risk of receiving the death penalty, as well as the likely cost of procuring drugs in such amounts - it was \"most unlikely for a person who [was] in possession of so much heroin to be only a drug addict and not a trafficker\". In the same Bill, a similar rationale was cited for reducing the threshold for invoking the presumption of trafficking for diamorphine from 5g to 2g - namely, the need to take into consideration the proportion of adulterants typically contained in these drugs when they were sold (see Singapore Parliamentary Debates, Official Report (20 November 1975) vol 34 at cols 1382-1384).\n24 Where (as in the present case) the drugs in question were not re-packed or apportioned in any particular manner to differentiate the amount intended to be sold from that intended to be consumed, the court must look at the totality of the circumstances to determine whether the appellant has rebutted the presumption in s 17: Muhammad bin Abdullah v Public Prosecutor and another appeal [2017] 1 SLR 427 (\"Muhammad bin Abdullah\") at [29]. Relevant factors include: (a) whether there is credible evidence of the appellant's rate of drug consumption and the number of days the supply is meant for; (b) the frequency of supply of the drugs; (c) whether the appellant had the financial means to purchase the drugs for himself; and (d) whether the appellant had made a contrary admission in any of his statements that the whole quantity of drugs was for sale (Muhammad bin Abdullah at [30]-[31]). Further, the possession of drug trafficking paraphernalia whose utility is obviously in relation to the preparation of drugs for sale is also relevant as circumstantial evidence of the appellant's drug trafficking activities: Sharom bin Ahmad and another v Public Prosecutor [2000] 2 SLR(R) 541 (\"Sharom bin Ahmad\") at [36].\n25 The key pillar and essential foundation of the consumption defence is, however, the appellant's rate of consumption of the relevant drug. The appellant bears the burden of establishing the extent of his personal consumption, and it is incumbent on him to show, by credible evidence, his rate of consumption (see Sulaiman bin Jumari at [117]). Other factors - such as the appellant's financial means to support his drug habit, how he came to be in possession of the drugs, and his possession of drug trafficking paraphernalia - are secondary. Thus, without credible and consistent evidence to establish his claimed rate of consumption on a balance of probabilities, an accused person who seeks to rely on the consumption defence will generally face insuperable difficulties.\n[emphasis in original]\n24 A few points may be noted about the foregoing passage:\n(a) Where the presumption of trafficking under s 17 of the MDA is engaged, the burden is on the accused person to prove on the balance of probabilities that the drugs in his possession were not for the purpose of trafficking.\n(b) Relevant factors to be considered in determining whether the accused person has rebutted the presumption include:\n(i) whether there is credible evidence of the accused person's rate of drug consumption and the number of days the supply is meant for;\n(ii) the frequency of supply of the drugs;\n(iii) whether the accused person had the financial means to purchase the drugs for himself; and\n(iv) whether the accused person had made a contrary admission in any of his statements that the whole quantity of drugs was for sale.\n(c) A key pillar which an accused person relying on the consumption defence needs to establish is his rate of consumption of the relevant drug. He needs to show this by credible evidence. Without credible and consistent evidence to establish his claimed rate of consumption, the accused person will face insuperable difficulties in establishing the consumption defence.\n25 I shall consider each of the factors referred at [24(b)] above in turn.\nRate of consumption and the number of days the Drugs are meant for\n\n26 The Accused first mentioned his rate of consumption of heroin in his second long statement, recorded by PW47 ASP Fernandez Anthony Leo (\"IO Anthony\") in the afternoon of 16 November 2020 (\"P27\"), where the Accused was recorded as saying:\nWhen I relapsed into \"heroin\" since fasting month this year, I do not have a fixed \"heroin\" supplier. I would just go to Geylang to find my friends if I want to buy \"heroin\". From May to July 2020, my \"heroin\" consumption was just on and off basis. From August 2020 onwards until now, my consumption of \"heroin\" slowly increased. Since September 2020, I would smoke about half a packet of \"heroin\" on 01 day, which is about 3.75g [of] \"heroin\".\n27 In his fourth long statement, recorded by IO Anthony in the afternoon of 17 November 2020 (\"D1\"), the Accused was recorded as saying:\nI don't know how long the 03 \"bola\" of \"heroin\" would last for my own consumption. Based on my experience, 01 \"bola\" can make at least 50 packets with each packet about 7.5 grams to 8 grams. So, with these 03 \"bola\" of \"heroin\", I would minimally be able to have about 150 packets of \"heroin\". My daily consumption is about half a packet of \"heroin\" so with 150 packets of \"heroin\" with me, I do not need to risk buying more \"heroin\".\n28 In the Case for the Defence, it was stated that \"[t]he Accused would typically purchase 2-3 packets of diamorphine per week\". Two to three packets a week would translate roughly to between one quarter and half a packet a day.\n29 At trial, the Accused gave the following evidence:\nYour Honour, in the beginning May 2020, I was consuming based on unit of measurement straw, Your Honour, which is 6 centimetre. Per day would be one-quarter of a straw, subsequently increased to half of the straw, Your Honour. And then within the next 2 to 3 days, I am able to complete one full straw, Your Honour. Then the rate increased, Your Honour. Per day I am able to consume one full straw, Your Honour. Then in the month of July and August, Your Honour, my rate increased. By then, I was able to consume half packet, Your Honour. Half packet will be the weight---okay, Your Honour, the weight of a full packet is 7.5 gram. Half packet will be about ... 3.5 to 4 gram, Your Honour.\n30 Although the Accused's various accounts were largely consistent that he was consuming about half a packet of heroin a day at the time of his arrest, there are some noteworthy inconsistencies in details between his different accounts. In P27, the Accused said that from May to July 2020, he was consuming heroin on just an \"on and off basis\". However, at trial, he said he was already consuming a full straw a day before July 2020. In P27, he said he started consuming half a packet a day from September 2020. At trial, he said he began consuming half a packet a day from \"July and August\".\n31 Although the accused is not expected to assess his daily consumption with precision, he is expected to give a coherent account of his rate of consumption (A Steven at [36]). In my view, the shift in the timeline concerning when the Accused began increasing his rate of consumption between his account in P27 and his account at trial constituted an internal consistency which raised the spectre that the Accused was trying to \"improve\" his story between the time of giving his long statement and the time of the trial.\n32 The Prosecution also pointed out that the Accused's claimed rate of consumption is inconsistent with the Accused's explanation concerning drugs found in his sling bag. As noted above, the sling bag contained two packets and one straw of granular/powdery substance weighing not less than 5.16g in total (and analysed and found to contain not less than 0.04g of diamorphine). In P27, the Accused explain that these drugs were purchased from his friend, \"John\", about two to three days before his arrest. He paid \"John\" $250 for one packet of heroin which weighed about 7.5g. He then poured the heroin from that one packet into smaller packs and straws for his own consumption. When asked in court to confirm whether the drugs found in the sling bag was what remained of the drugs he bought from \"John\" two to three days before his arrest, the Accused confirmed that this was the case.\n33 The Prosecution submitted that this meant that the Accused had only consumed 2.34g of heroin (gross weight) over the course of the two (or three) days since he purchased the drugs from \"John\". When confronted with this calculation during cross-examination, the Accused explained that drugs in the sling bag were not solely from the purchase he made from \"John\" two to three days earlier, but could also have been mixed with the balance of drugs he purchase from other suppliers prior to that. Needless to say, this answer is internally inconsistent with the answers he gave earlier (as summarised in the previous paragraph).\n34 The Prosecution also submitted that the Accused's claimed rate of consumption was inconsistent with the medical evidence. From 13 to 15 November 2020, the Accused was admitted to the Changi Prison's Complex Medical Centre (\"CMC\") for drug withdrawal observation. The results of the observation were set out in a medical report prepared by PW12 Dr Sahaya Nathan (\"Dr Nathan\"). According to the medical report, the Accused was assessed to have \"MILD OPIOID DRUG WITHDRAWAL\" and that \"[b]ased on correlation of the above clinical findings and history [the Accused's] RATE OF DRUG CONSUMPTION of OPIOID was likely to be LOW\" (emphasis in original). The Defence submitted that no weight should be given to the medical report's assessment of the Accused's rate of consumption. They pointed to the disclaimer in the medical report that \"the severity of withdrawal is not clearly or directly related to the quantity of the drugs previously consumed\" and to Dr Nathan's admission that that it was an \"arbitrary kind of correlation\". In response, the Prosecution pointed to Dr Nathan's explanation that \"if we have scored mild symptoms, the likelihood of you having a low rate of consumption is there\".\n35 In my view, it is clearly reasonable to expect some correlation between the severity of an accused person's drug withdrawal symptoms and his rate of drug consumption. Otherwise, the medical report on drug withdrawal observation would not contain a specific section concerning the rate of drug consumption based on correlation with the clinical findings, and Dr Nathan would not have said \"if we have scored mild symptoms, the likelihood of you having a low rate of consumption is there\" (emphasis added). However, the correlation is not absolute, as Dr Nathan candidly admitted and as evidenced by the disclaimer in the medical report referred to in the previous paragraph. Dr Nathan's opinion was supported by PW14 Dr Edwin Lymen (\"Dr Lymen\"), who observed the Accused on 15 November 2020. As Dr Lymen told the court:\nGenerally speaking, mild withdrawal symptoms, those with mild withdrawal symptoms, the rate of consumption could be low. But there is a---there is a lot of difference between individuals, so I can't 100% say just because he had a mild opioid withdrawal, the rate of consumption should be low. But generally speaking, it's true.\n[emphasis added]\n36 What this means is that, while the medical report does not conclusively debunk the Accused's claimed rate of consumption, it demonstrates that the Accused's claim was less likely to be true, all other things being equal. In any event, at the very minimum, the medical report cannot be relied on by the Defence as support for the Accused's claimed rate of consumption.\n37 As for the number of days the Drugs are meant for, the Accused gave evidence that he expected the Drugs to last him nine to ten months. The Prosecution calculated that, at the Accused's claimed rate of consumption of 3.75g per day, the Drugs would last 368 days. For completeness, I should add that if the Accused's claimed rate of consumption is not accepted, and if we go instead by the Prosecution's calculation (at [33] above) that the Accused was consuming only 2.34g of heroin over two to three days, the Drugs would have been enough to last the Accused roughly three to five years.\n38 In Jusri bin Mohamed Hussain v Public Prosecutor [1996] 2 SLRI 706 (\"Jusri\"), after noting that there must be \"credible evidence of the rate of consumption as well as the number of days the supply is meant for\" (at [62]), Yong Pung How CJ went on to remark (at [63]):\nIn this respect, credible evidence does not mean the mere say-so of the accused. I appreciate that it is often difficult for an accused to adduce any other evidence apart from his own testimony. However, it seems to me that it must follow from the statutory presumption in s 17 of the Misuse of Drugs Act that an accused found in possession of a large quantity of drugs faces an uphill task. It cannot be right that the court is obliged to accept in all cases the bare allegation of the accused. That would make nonsense out of s 17.\n[emphasis added]\n39 In the present case, the Accused's claimed rate of consumption rested solely on the Accused's bare allegation, and is not supported by any other credible evidence. Moreover, the Accused's claimed rate of consumption is inconsistent with the explanation he gave concerning the drugs in the sling bag. In this regard, I considered the subsequent explanation given by the Accused during cross-examination (see [33] above) to be a mere afterthought, and preferred to accept his earlier explanations as true (see [32] above). The Accused's claimed rate of consumption is also inconsistent with the assessed rate of consumption in the medical report prepared by Dr Nathan. While the assessment in the medical report is by no means conclusive, what remains undeniable is that the medical report neither supports nor corroborates the Accused's claim rate of consumption.\n40 I therefore held that the Accused has failed to establish his claimed rate of consumption. As the Court of Appeal noted in Chong Hoon Cheong v Public Prosecutor [2022] 2 SLR 708 (\"Chong Hoon Cheong\") the failure of an accused person to prove the rate of his consumption is \"fatal to his case since the rate of consumption is the essential foundation of a consumption defence\" (at [52]).\nFrequency of supply\n\n41 The frequency of supply is relevant for the purposes of determining how much of the drugs which an accused person is found with would be needed by the accused person for his own consumption. For example, in Public Prosecutor v Dahalan bin Ladaewa [1995] 2 SLR(R) 124 (\"Ladaewa\"), The offender was caught in possession of 24 sachets which was analysed and found to contain 28.36g of diamorphine. The court accepted the offender's evidence that he would consume slightly less than one sachet per day. On the frequency of supply, the court accepted the offender's evidence that his supplier would make deliveries once in about two weeks. The court therefore accepted that, of the 24 sachets, about 12 to 14 sachets were meant of the offender's own consumption while the remainder were for trafficking. The court therefore amended the trafficking charge to exclude the amount of diamorphine in these 12 to 14 sachets, thereby bringing the amount of drugs being trafficked below the death penalty threshold.\n42 In the present case, the Accused did not give evidence concerning the frequency of supply. In P27, he was recorded as saying:\nI would just go to Geylang to find my friends if I want to buy \"heroin\". ... Since September 2020 ... I was still getting \"heroin\" from friends at Geylang whom I do not saved (sic) their contact. I would just walk there and easily I can get \"heroin\".\nThus, the Accused was saying in P27 that there was no fixed frequency of supply, and he could get his supply of heroin any time by walking to Geylang to find his friends. The issue of frequency of supply was not explored at trial.\n43 Since it is not the Defence's case that the Accused was encountering issues with the frequency of supply, such that he had to stockpile a certain amount of drugs to tide him over till the next delivery of drugs, the issue of frequency of supply is not relevant for the determination of the present case. This explains why neither the Prosecution nor the Defence expended time exploring this issue.\nThe Accused' financial means to afford the Drugs\n\n44 The relevance of an accused person's financial means may be illustrated by reference to Muhammad bin Abdullah, where the Court of Appeal reasoned as follows (at [40]):\nThe First Appellant admitted at trial that he had limited financial means (above at [11]). He did not have a regular source of income apart from the profits he derived from drug trafficking and he had to meet the needs of his family and to finance his drug consumption. In fact, he further admitted in cross-examination that because of a \"shortage of money\", he was sometimes unable to pay the maintenance of S$430 every month to his ex-wife and children from his previous marriage. The market price of one small packet of diamorphine was about S$100 to S$150. Assuming the First Appellant intended to store 20 small packets in addition to the ten small packets that he said in the Statement he normally stored, he would be forgoing an income of S$2,000 to S$3,000 simply to ensure that he had a large surplus of drugs for own consumption. We do not think this was probable in the light of his limited finances and the availability of regular supplies of diamorphine at that time.\nIn that case, the court found that, because of the offender's limited finances, it was not probable that the offender intended to store all 30 small packets of heroin (amounting 30 days' supply based on the offender's assumed rate of consumption) for his own consumption, as opposed to selling part of the drugs to generate additional income.\n45 The Accused's evidence was that, prior to his arrest, he was working as a cleaning supervisor at a hotel. His basic salary was $1,900 per month, which translated to a take-home pay of $1,600 per month. On some months, he could be taking home as much as $2,500 due to overtime pay. However, from February 2020 to the time of his arrest, he was not required to do any overtime at the hotel due to the COVID-19 situation. So his take home pay during this period was $1,600 per month.\n46 As for where the Accused obtained the $10,500 he paid \"Abang\" for the Drugs, the Accused's evidence was that $3,500 was money he borrowed from Zaharah, while the remaining $7,000 was his own money. Of these $7,000, the Accused's evidence was that $3,000 was from Government payouts, $500 was from GST rebates while the remaining $3,500 came from his own savings. He also testified that he had a balance of $1,700 with him after the transaction.\n47 The Prosecution submitted that the mere fact that the Accused needed to borrow money in order to be able to purchase the Drugs shows that he did not have the financial means to do so. I accepted this submission, especially since the Accused had not provided any explanation concerning how he intended to repay the $3,500 loan from Zaharah (other than by selling the Drugs), even though the burden of proof is on him to establish the Consumption Defence on the balance of probabilities.\nThe accused's statements\n\n48 The Accused admitted in his contemporaneous statement (P18), taken between 4.08pm and 5.20pm on the day of his arrest, that the Drugs were \"[f]or me to sell\".\n49 In the cautioned statement administered on 12 November 2020, when asked whether he wanted to say anything in his own defence, the Accused answered: \"Nothing. I hope the weight will be less than 15 grams so that I will not be sentenced to death\".\n50 In his second long statement (P27), the Accused said:\nI take this amount of \"heroin\" mostly for my own consumption. Some of the \"heroin\" I can also use to make money. Nowadays, 01 packet of \"heroin\" about 7.5 grams would already costs about SGD$250. If 10 packets of \"heroin\", it is already SGD$2500. If I can make money, I would try to sell the \"heroin\".\n51 Even during his testimony in court, the Accused remained equivocal about whether all of the Drugs were for his own consumption, as demonstrated by the following exchange during examination-in-chief:\nQ Right. Now Mr Masri, you informed the Court---okay, sorry, can you tell this Court then what was the purpose of acquiring these three bundles of heroin?\nA Your Honour, they were mainly for my consumption, Your Honour. For my consumption, Your Honour.\n[emphasis added]\n52 In relation to P18, the Defence's initial position, as set out in the Case for the Defence, was to completely deny that he gave the answer \"for me to sell\". At trial, the Accused no longer denied giving that answer. Instead, he explained that he could not really remember what happened, he was \"in a state of blur\" and confused and \"filled with anxiety\", as well as experiencing drug withdrawal. The Defence therefore submitted that the answer \"for me to sell\" was clearly erroneous. In this regard, the Defence pointed to the presence of other errors in P18, such as the Accused misidentifying the supplier of the Drugs as \"John\" instead of \"Abang\".\n53 The Prosecution responded that the Accused was sufficiently clear minded during the taking of P18 to distinguish between the three black bundle of drugs he purchased from \"Abang\" that day and the drugs found in the sling bang. The Accused answered \"for me to sell\" when shown a photograph of the three black bundles but answered \"[f]or my own consumption\" when shown a photograph of the drugs in the sling bag.\n54 The Prosecution also disputed that the Accused was suffering from drug withdrawal at the time P18 was taken. First, drug withdrawal was not a point mentioned in the Case for the Defence. Second, SSGT Saharil gave evidence that he did not notice anything significant about the Accused's demeanour during the taking of P18 and the Accused did not make any complaint to him. Third, the Prosecution also called PW48 Dr Dominic Cheong (\"Dr Cheong\") who examined the Accused at 2.08am on 12 November 2020. Dr Cheong's evidence was that he did not observe any drug withdrawal symptoms. Finally, Dr Nathan gave evidence that, based on the Accused's evidence that he last consumed heroin at 11.00am, five hours (ie, the interval between 11.00am and 4.00pm) was too short a duration for one to experience withdrawal symptoms.\n55 In the light of the foregoing, I found that the answer \"for me to sell\" given by the Accused in P18 was accurate and reliable. He drew a clear distinction between the Drugs and the drugs in the sling bag. Whatever withdrawal effect he may have been experiencing at the time, it was clearly not serious enough (in the light of the medical evidence and SSGT Saharil's observations) to impair the reliability of the Accused's answers in P18. I therefore decided that full weight should be given to the Accused's admission in P18.\n56 As for the cautioned statement, the Defence submitted that was no admission about drug trafficking in the Accused's answer. I do not accept this submission. When the cautioned statement was administered, the Accused was specifically informed that he was being charged for trafficking in not less than 15g of diamorphine and asked whether he wanted to say anything in his defence. The answer \"Nothing\", coupled with \"I hope the weight will be less than 15 grams\", would on any reasonable interpretation be an implicit admission to the charge of trafficking.\n57 Even if I were wrong on this question of interpretation, the fact remains that the Accused's failure to mention the Consumption Defence in the cautioned statement means that an adverse inference may be drawn against the Accused pursuant to s 261 of the CPC. In deciding whether to draw such an adverse inference, I needed to consider any explanation which the Accused may give for his failure to mention the Consumption Defence. The Accused gave two explanations. The first was that he was in a state of shock and was thinking of how to escape the death penalty. I did not find this explanation credible. If it were true that the Drugs were entirely (or even partially) for his own consumption, the natural reaction for a person in the Accused's position who was hoping to escape the death penalty would be to say that the Drugs were not meant for trafficking but for his own consumption. The fact that the only thing which the Accused could say in his bid to escape the death penalty was \"I hope the weight will be less than 15 grams\" is telling that the Accused intended to traffic in the Drugs. The second explanation was that the Accused was suffering from drug withdrawal. However, the cautioned statement was administered at 2.14am, a few minutes after the Accused was examined by Dr Cheong. As noted at [54] above, Dr Cheong did not notice any signs of drug withdrawal. I therefore rejected the Accused's explanations and drew an adverse inference against him.\n58 As for P27, the Accused's statement that the Drugs were \"mostly\" for his own consumption amounts, in my view, to an admission that not all of the Drugs were meant for his own consumption. Further, his statements that \"[i]f I can make money, I would try to sell the 'heroin'.\" evinced a clear intention to traffic at least part of the Drugs. The Defence initially took the position, in the Case for the Defence, that P27 was inaccurately recorded. However, the Accused abandoned this position at trial and admitted that P27 was recorded accurately. The Defence's explanation for this part of the Accused's statement in P27 was that it was merely speculative and opportunistic, in the sense that the Accused was merely saying that he may potentially consider selling if the opportunity to do so arose, and not that he had a present intention to sell. I accepted there was some ambiguity in this statement and, consequently, some doubt as to what the Accused actually meant. In the circumstances, in the light of the guidance provided by the Court of Appeal in Chong Hoon Cheong at [70], I placed no weight on this statement.\n59 However, my decision to place no weight on P27 does not affect my decision, after having considered all the relevant evidence in totality, to give full weight to the Accused's admission in P18 and to draw an adverse inference against the Accused in respect of his cautioned statement.\nExplanations for the large quantity of drugs\n\n60 I turn next to the Accused's own explanations for the large quantity of drugs seized from him. By the Accused's own concession, the quantity of drugs he was arrested with was a \"huge amount\". The Defence raised several arguments to justify this large amount.\nCost benefit of a bulk purchase\n\n61 First, the Accused explained that he purchased the Drugs as it represented a good deal. He explained that, given the unpredictability of the COVID-19 pandemic, it made sense to purchase a large quantity of diamorphine so that he would avoid the volatility of prices when border closures occur. I reject this argument. The Accused's justification of potential price volatility was contradicted by his own evidence that the price had in fact decreased from May 2020 to November 2020. It would not make sense for the Accused to be worried about an increase in prices when there had been a downward trend in prices in the months that he was consuming diamorphine.\n62 A closely related argument is that there would be cost savings if the Accused purchases in bulk . Although I accepted that there would be cost savings to the Accused if he could purchase in bulk, I was also of the view that, in the light of my finding concerning the Accused's lack of financial means, the Accused was not in a financial position to take advantage of such cost savings from bulk purchase solely for his own consumption (as opposed to purchasing for the purpose of trafficking).\nFear of being caught by the authorities\n\n63 Second, the Defence submitted that the Accused purchased the Drugs in bulk to avoid the risk of getting caught. The Accused gave evidence that:\nFor safety purposes, it is better for me to take this amount of \"heroin\" as I do not have to risk going out and find the \"heroin\". I am looking thinner so I am afraid MRT police might stop me and arrest me for drug consumption.\nAnd further that:\nDue to me losing weight and my appearances, I feel there is a risk of me being arrested as a drug consumer. So, I want to avoid the risk of keep going out to buy \"heroin\". This is why I chose to keep more stock of \"heroin\" this time by buying the 03 \"bola\" of \"heroin\".\n64 The Prosecution submits that this explanation is illogical because the Accused would have faced the risk of getting caught on account of his appearance regardless of his purpose of going out (including for work or to run some other errands). I agreed with this submission. For completeness, the Prosecution cross-examined the Accused on his allegation of being \"skinny to the bone\" using photographs taken at the time of his arrest. Having reviewed the photographs, I was of the view that a reasonable person would not have considered the Accused to be so skinny as to readily suspect that he was a drug addict.\nLack of storage plans\n\n65 Finally, the Drugs would have lasted the Accused about nine to ten months by his own account (and lasted much longer by the Prosecution's calculations). The Accused gave evidence that he would not store the Drugs at home, as he did not wish to implicate his mother and sister whom he was staying with. He also could not store the Drugs at his workplace. When asked where he planned to store the Drugs, his reply was that he had not formulated a storage plan. In my view, the fact that the Accused had not formulated any plans for long term storage of such a large quantity of drugs before receiving them constitutes clear evidence that the Accused was not planning to hold on to the Drugs for a prolonged period of time. Instead, he merely intended to resell the Drugs relatively soon for a profit.\nLack of drug trafficking paraphernalia and customer list\n\n66 The Defence placed heavy emphasis on the fact that the Accused did not have drug trafficking paraphernalia or a list of customers to whom he could sell drugs to. In my view, while the presence of drug trafficking paraphernalia constitutes circumstantial evidence of an accused person's drug trafficking activities (A Steven at [24]), the absence of drug trafficking paraphernalia is a neutral factor in assessing whether or not the Accused intended to traffic in the drugs. In Hanafi bin Abu Bakar and another v Public Prosecutor [1999] SGCA 59 (\"Hanafi\"), the Court of Appeal held (at [76]) that \"the absence of any drug paraphernalia [was] equivocal at the most since it was not necessary that [the appellants'] repack the heroin into sachets for them to be trafficking in the heroin found in the packet\".\n67 As for the lack of a customer list, the Accused was, by his own evidence, familiar with Geylang and he knew exactly where he could obtain drugs. As a corollary, the Accused would also know where drug consumers would go to buy drugs. It was therefore not necessary for him maintain a list of customers because he knew exactly where sellers would station themselves to meet customers and he could do the same. Further, he also had friends who had previously asked him for heroin.\nConclusion\n\n68 In summary, the evidence considered in totality did not support a finding, on a balance of probabilities, that the Accused intended to consume the entirety of the Drugs. First, the Accused failed to establish his rate of consumption of heroin, and this was fatal to his case. Second, the Accused did not have the financial means to purchase $10,500 worth of heroin solely for the purpose of his own consumption. Third, the fact that he had not formulated any plans for the storage of the Drugs is a strong indication that the Accused had no intention to hold on to the Drugs for nine to ten months as he alleged. Fifth, the Accused's explanation concerning the benefit of bulk purchase and the fear of being caught by authorities did not make sense in the light of the relevant circumstances. Sixth, the Accused clearly admitted in his contemporaneous statement that the Drugs were for him to sell. Finally, I drew an adverse inference against the Accused for failing to mention the Consumption Defence in his cautioned statement. All of the foregoing, taken together led me to the conclusion that the Consumption Defence has not been proven on a balance of probabilities.\n69 Accordingly, I convicted the Accused of the proceeded charge. As more than 15g of diamorphine was involved, the prescribed sentence was death. As the Accused's case was not eligible for any alternative sentencing regimes under s 33B of the MDA, I imposed on him the sentence of death as mandated by the law.\nPang Khang Chau\nJudge of the High Court\nSelene Yap, Emily Koh and Keira Yu (Attorney-General's Chambers) for the prosecution;\nNandwani Manoj Prakash, Joel Quah, Benedict Eoon, and Daren Kim (Gabriel Law Corporation) for the accused.\n", "label": [[9, 72, "RESPONDENT"], [146, 163, "RESPONDENT"], [265, 282, "RESPONDENT"], [364, 379, "JUDGE"], [442, 457, "JUDGE"], [477, 494, "PETITIONER"], [818, 850, "PROVISION"], [858, 900, "STATUTE"], [907, 910, "STATUTE"], [934, 941, "PROVISION"], [949, 952, "STATUTE"], [1393, 1398, "PROVISION"], [1406, 1429, "STATUTE"], [1458, 1461, "STATUTE"], [1761, 1766, "OTHER_PERSON"], [1900, 1919, "WITNESS"], [1973, 1980, "OTHER_PERSON"], [2024, 2040, "DATE"], [2082, 2103, "OTHER_PERSON"], [2190, 2199, "OTHER_PERSON"], [2255, 2264, "OTHER_PERSON"], [2369, 2378, "OTHER_PERSON"], [2426, 2433, "OTHER_PERSON"], [2557, 2566, "OTHER_PERSON"], [2670, 2679, "OTHER_PERSON"], [2753, 2762, "OTHER_PERSON"], [2852, 2857, "OTHER_PERSON"], [2966, 2975, "OTHER_PERSON"], [2980, 2987, "OTHER_PERSON"], [3380, 3389, "OTHER_PERSON"], [3407, 3416, "OTHER_PERSON"], [3425, 3432, "OTHER_PERSON"], [3441, 3453, "COURT"], [3481, 3493, "COURT"], [3513, 3544, "ORG"], [3558, 3567, "OTHER_PERSON"], [3647, 3654, "OTHER_PERSON"], [3715, 3724, "OTHER_PERSON"], [3729, 3736, "OTHER_PERSON"], [3766, 3769, "ORG"], [3802, 3814, "COURT"], [3836, 3866, "WITNESS"], [3874, 3879, "OTHER_PERSON"], [3893, 3902, "OTHER_PERSON"], [3919, 3931, "COURT"], [3971, 3984, "WITNESS"], [3987, 3995, "OTHER_PERSON"], [4070, 4075, "OTHER_PERSON"], [4414, 4417, "ORG"], [4555, 4567, "WITNESS"], [4964, 4967, "ORG"], [5083, 5086, "ORG"], [5375, 5391, "DATE"], [5414, 5417, "ORG"], [5541, 5553, "PROVISION"], [5561, 5584, "STATUTE"], [5613, 5616, "STATUTE"], [6284, 6354, "PRECEDENT"], [6940, 6966, "PROVISION"], [6974, 6977, "STATUTE"], [7051, 7141, "PRECEDENT"], [7219, 7226, "PROVISION"], [7234, 7237, "STATUTE"], [7255, 7262, "PROVISION"], [7270, 7273, "STATUTE"], [7355, 7362, "PROVISION"], [7370, 7373, "STATUTE"], [7672, 7679, "PROVISION"], [7687, 7690, "STATUTE"], [8596, 8603, "PROVISION"], [8611, 8614, "STATUTE"], [10265, 10268, "ORG"], [11754, 11824, "PRECEDENT"], [12033, 12040, "PROVISION"], [12048, 12051, "STATUTE"], [12217, 12300, "PRECEDENT"], [12305, 12365, "PRECEDENT"], [12371, 12384, "JUDGE"], [12400, 12405, "OTHER_PERSON"], [12574, 12578, "PROVISION"], [12587, 12590, "STATUTE"], [12888, 12893, "JUDGE"], [13059, 13107, "STATUTE"], [13162, 13176, "LAWYER"], [13182, 13187, "LAWYER"], [13541, 13544, "ORG"], [13550, 13554, "OTHER_PERSON"], [13631, 13640, "GPE"], [14862, 14866, "PROVISION"], [14868, 14945, "PRECEDENT"], [14948, 14969, "OTHER_PERSON"], [15397, 15418, "OTHER_PERSON"], [15660, 15728, "PRECEDENT"], [16074, 16093, "OTHER_PERSON"], [16664, 16668, "PROVISION"], [16676, 16679, "STATUTE"], [17999, 18020, "WITNESS"], [18245, 18252, "GPE"], [18645, 18661, "DATE"], [21683, 21687, "OTHER_PERSON"], [22025, 22029, "OTHER_PERSON"], [22303, 22307, "OTHER_PERSON"], [22472, 22476, "OTHER_PERSON"], [22872, 22894, "DATE"], [22928, 22973, "ORG"], [23092, 23105, "WITNESS"], [23111, 23117, "WITNESS"], [23697, 23703, "OTHER_PERSON"], [23812, 23818, "OTHER_PERSON"], [24302, 24308, "OTHER_PERSON"], [24494, 24500, "OTHER_PERSON"], [24618, 24624, "OTHER_PERSON"], [24660, 24671, "WITNESS"], [24677, 24682, "WITNESS"], [24714, 24730, "DATE"], [24738, 24743, "OTHER_PERSON"], [26074, 26137, "PRECEDENT"], [26293, 26306, "JUDGE"], [26612, 26616, "PROVISION"], [26624, 26643, "STATUTE"], [26867, 26871, "PROVISION"], [27552, 27558, "OTHER_PERSON"], [27882, 27936, "PRECEDENT"], [28377, 28447, "PRECEDENT"], [29321, 29328, "GPE"], [29449, 29456, "GPE"], [29695, 29702, "GPE"], [30326, 30347, "OTHER_PERSON"], [32360, 32367, "OTHER_PERSON"], [32996, 33003, "OTHER_PERSON"], [33385, 33401, "DATE"], [34165, 34170, "OTHER_PERSON"], [35690, 35697, "WITNESS"], [35905, 35919, "WITNESS"], [35972, 35988, "DATE"], [35993, 35999, "WITNESS"], [36081, 36087, "WITNESS"], [36665, 36672, "OTHER_PERSON"], [37639, 37644, "PROVISION"], [37652, 37655, "STATUTE"], [38689, 38695, "OTHER_PERSON"], [38724, 38730, "OTHER_PERSON"], [39928, 39945, "OTHER_PERSON"], [44464, 44541, "PRECEDENT"], [44886, 44893, "OTHER_PERSON"], [46694, 46699, "PROVISION"], [46707, 46710, "STATUTE"], [46775, 46790, "JUDGE"], [46815, 46825, "JUDGE"], [46827, 46836, "OTHER_PERSON"], [46841, 46849, "OTHER_PERSON"], [46901, 46923, "OTHER_PERSON"], [46925, 46934, "OTHER_PERSON"], [46936, 46949, "OTHER_PERSON"], [46955, 46964, "OTHER_PERSON"]]}
