{"text": "\n\nIN THE GENERAL DIVISION OF THE HIGH COURT OF THE REPUBLIC OF SINGAPORE\n[2023] SGHC 16\n\nOriginating Summons No 553 of 2021 (Registrar's Appeal No 315 of 2022)\nBetween\nThe Star Pty Ltd\n... Applicant\nAnd\nGuoxing Cui\n... Respondent\nGROUNDS OF DECISION\n\n[Conflict Of Laws -- Foreign judgments -- Recognition -- Judgment given in foreign court on gambling debt -- Whether Singapore courts precluded from recognising foreign judgment on grounds of public policy -- Section 5(2) Civil Law Act (Cap 43, 1999 Rev Ed) -- Section 3(2)(f) Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264, 1985 Rev Ed)]\n[Courts and Jurisdiction -- Court judgments -- Binding force -- Stare decisis -- Earlier decision of Court of Appeal regarded by subsequent Court of Appeal as incorrect in obiter dicta -- Whether High Court bound by earlier decision of Court of Appeal]\nThe Star Pty Ltd\nv\nGuoxing Cui\n[2023] SGHC 16\n\nGeneral Division of the High Court -- Originating Summons No 553 of 2021 (Registrar's Appeal No 315 of 2022)\nChan Seng Onn SJ\n19 December 2022\n20 January 2023\nChan Seng Onn SJ:\nIntroduction\n\n1 This was not the first time the court has had to consider the question of whether foreign judgments based upon gambling debts may be registered under the Reciprocal Enforcement of Commonwealth Judgments Act (Cap 264, 1985 Rev Ed) (\"RECJA\"). In Liao Eng Kiat v Burswood Nominees Ltd [2004] 4 SLR(R) 690 (\"Burswood Nominees\"), the Court of Appeal held that section 3(2)(f) of RECJA read together with section 5(2) of the Civil Law Act (Cap 43, 1999 Rev Ed) (\"CLA\") did not preclude registration of such foreign judgments. In The Star Entertainment QLD Ltd v Yong Khong Yoong Mark [2022] 4 SLR 976 (\"The Star Entertainment\"), the High Court considered itself bound by the authority of Burswood to recognise a similar foreign judgment, notwithstanding obiter dicta by the Court of Appeal in Poh Soon Kiat v Desert Palace Inc [2010] 1 SLR 1119 (\"Desert Palace\") suggesting that Burswood had been wrongly decided.\n2 The present matter likewise concerned an application to register a foreign judgment based upon a gambling debt. As a result of his gambling activities at an Australian casino owned by The Star Pty Ltd (\"the applicant\"), Mr. Guoxing Cui (\"the respondent\") had incurred debts which formed the basis of an Australian judgment which the applicant subsequently obtained against him (\"the judgment\"). When the applicant sought to have the judgment registered in Singapore, the respondent challenged its registration and sought to have it set aside on the basis of section 3(1) and 3(2) of the RECJA.\n3 After considering the parties' submissions, I too found myself bound by Burswood to dismiss the respondent's appeal, and so declined to set aside the registration of the judgment. The respondent appealed, and I now give my reasons.\nThe parties\n\n4 The applicant operates a casino known as \"The Star Sydney\", which was licensed in New South Wales under the Casino Control Act 1992 (NSW) by the Casino, Liquor and Gaming Control Authority of New South Wales.\n5 The respondent was a patron of The Star Sydney, who as a result of his gaming activities there incurred the debts which formed the basis of the judgment.\nProcedural history\n\n6 On 12 February 2021, the applicant obtained judgment against the respondent for a sum of $6,186,314.72 Australian Dollars from the Supreme Court of New South Wales. The applicant subsequently filed an application to register the judgment in Singapore, which was granted on 8 June 2021.\n7 On 16 June 2022, the respondent filed an application to set aside registration of the judgment. This application was heard by the Assistant Registrar (\"the AR\") on 14 October 2022, who declined to set aside the registration. I then heard the respondent's appeal against the AR's decision.\nThe respondent's submissions\n\n8 The respondent argued that the registration of the judgment ought to be set aside pursuant to Order 67 Rule 9(3) of the Rules of Court (Cap 322, R 5, 2014 Rev Ed) (\"ROC 2014\"), which states:\n(3) Where the Court hearing an application to set aside the registration of a judgment registered under the first Act is satisfied that the judgment falls within any of the cases in which a judgment may not be ordered to be registered under section 3(2) of that Act or that it is not just or convenient that the judgment should be enforced in Singapore or that there is some other sufficient reason for setting aside the registration, it may order the registration of the judgment to be set aside on such terms as it thinks fit. [emphasis added]\n9 As he relied on both the section 3(2) and the \"not just or convenient\" grounds as bases upon which to set aside the recognition of the judgment, I briefly lay out his arguments in respect of each.\nSection 3(2) of the RECJA\n\n10 Section 3(2)(f) of the RECJA provides that no foreign judgment shall be ordered to be registered if:\n(f) the judgment was in respect of some cause of action which for reasons of public policy or for some other similar reason could not have been entertained by the registering court.\n11 Where foreign judgments based on gambling debts are concerned, the relevant public policy is that captured in section 5(2) of the CLA, which provides that:\n(2) No action shall be brought or maintained in the court for recovering any sum of money or valuable thing alleged to be won upon any wager or which has been deposited in the hands of any person to abide the event on which any wager has been made.\n12 In short, as section 5(2) of the CLA precludes the court from entertaining any action brought to recover a debt arising out of gambling, section 3(2)(f) of the RECJA would in turn preclude the registration of any foreign judgment based on such a debt.\n13 Additionally, Burswood's holding that section 3(2)(f) of the RECJA did not preclude recognition of foreign judgments based on gambling debts should not be followed. The subsequent decision of Desert Palace had commented that Burswood was \"unsound and should be reviewed\". Burswood's imposition of a \"higher threshold\" of public policy which must be met for registration of a foreign judgment to be refused was inconsistent with the plain wording of section 3(2)(f) of the RECJA. Even if it was not, the statutory public policy as articulated in section 5(2) of the CLA should be considered \"more fundamental\" than common law public policy, and should be sufficient to meet any higher threshold necessary for registration to be refused or set aside.\n\"Not just or convenient\" under Order 67 Rule 9(3) of the ROC\n\n14 The respondent also relied on the phrase \"not just or convenient\" for enforcement as a ground for setting aside under Order 67 Rule 9(3) of the ROC 2014. The opposite phrase \"just and convenient\" for enforcement and ordering of registration is used in section 3(1) of the RECJA:\n3.--(1) Where a judgment has been obtained in a superior court of the United Kingdom of Great Britain and Northern Ireland the judgment creditor may apply to the General Division of the High Court at any time within 12 months after the date of the judgment, or such longer period as may be allowed by the General Division of the High Court, to have the judgment registered in the General Division of the High Court, and on any such application the General Division of the High Court may, if in all the circumstances of the case it thinks it is just and convenient that the judgment should be enforced in Singapore, and subject to this section, order the judgment to be registered accordingly. [emphasis added]\n15 As section 5(2) of the CLA clearly articulates a policy prohibiting the recovery of gambling debts, allowing enforcement of the judgment would create a \"backdoor\" for casinos to enforce such debts. It would create an \"unprincipled\" distinction between situations in which creditors directly bring claims for foreign gambling debts in the Singaporean courts, which the courts are bound to reject by the Court of Appeal decision of Star City Pty Ltd (formerly known as Sydney Harbour Casino Pty Ltd) v Tan Hong Woon [2002] 1 SLR(R) 306, and those in which a creditor seeks recognition of a foreign judgment based on the same gambling debt, which must be recognised as per Burswood. The fact that Burswood was wrongly decided would mean that following it would subject the respondent to an erroneous application of the law. In view of these reasons, recognising the judgment would visit significant injustice and inconvenience upon the respondent.\n16 Crucially, the court is not bound by Burswood to reject such an argument. Burswood was decided on the basis that section 3(2)(f) of RECJA did not preclude the registration of a foreign gambling debt. Counsel in Burswood made no argument on the \"not just or convenient\" ground, and Burswood had merely observed that section 3(1) of the RECJA was \"an apt provision in resolving the case\", and found on the facts that the defendant there had failed to make out that ground.\nAnalysis\n\n17 I found that I remained bound by the authority of Burswood to reject the respondent's submissions, in respect of both section 3(2)(f) and section 3(1) of the RECJA.\nSection 3(2) of the RECJA\n\n18 Burswood's holding that section 3(2)(f) of the RECJA read with section 5(2) of the CLA does not preclude registration of foreign judgments based on gambling debts remains binding precedent under the doctrine of stare decisis. As noted by The Star Entertainment at [15], Desert Palace was concerned with the registration of a foreign judgment not under RECJA but at common law. Its observations that Burswood was \"unsound\", had \"no legal basis\" to impose a higher public policy threshold into section 3(2)(f) of the RECJA, and should have been decided differently, were therefore all ultimately obiter. I also echo The Star Entertainment's observation at [15], that Desert Palace, in commenting that Burswood \"should be reviewed if a similar issue were to come before this court in the future\" (at [114]), made clear that it was not overruling Burswood. Like the court in The Star Entertainment, I was therefore bound to reject the respondent's attempt to set aside the registration of the judgment on the basis of section 3(2)(f) of the RECJA.\n\"Just and convenient\" under s 3(1) of the RECJA\n\n19 It is clear from the wording of section 3(1) of the RECJA that the court only has discretion to register a foreign judgment if it thinks it \"just and convenient\" that the judgment should be enforced in Singapore. Thus, while Burswood was largely concerned with section 3(2)(f) of the RECJA, it also had regard to s 3(1) of the RECJA and made the following finding on whether it would not be just and convenient to register the judgment with which it was concerned (at [47]):\nThus far, the focus of this judgment has been on the public policy exception laid down in s 3(2)(f) of the RECJA. However, we also think it apt to mention another provision of the RECJA which was neglected by counsel for both parties but which we found relevant to the resolution of this case - s 3(1) of the RECJA. Whilst s 3(2) of the RECJA lays down various restrictions on the court's power to order the registration of foreign judgments, s 3(1) of the RECJA gives the court the general discretion to order the registration of a foreign judgment if \"in all the circumstances of the case [the court] thinks it is just and convenient that the judgment should be enforced in Singapore\". In our assessment, Liao had failed signally in his attempt to show that it was not just and convenient for us to register the Australian judgment. [emphasis in original]\n20 This inquiry was one to which the court in Burswood would have had to apply its mind before finding that the judgment with which it was concerned should be registered, and so forms part of its ratio. Given that it did so find despite clearly being cognisant of the public policy against gambling captured in section 5(2) of the CLA, it was not open to me to find that the very same public policy rendered it not just or convenient to enforce and hence register the judgment for the purposes of its enforcement, which was similar to if not legally indistinguishable from those whose recognition was at issue in Burswood and The Star Entertainment. To have held otherwise would be to read the \"not just or convenient\" ground as license for the High Court to freely depart from the binding authority of the Court of Appeal, whenever it might feel that the equities of the instant case warrant doing so.\nConclusion\n\n21 For the reasons above, I found myself bound by the authority of Burswood to find that neither section 3(2)(f) nor section 3(1) barred the registration of a judgment based on a foreign gambling debt. Being so bound, I dismissed the respondent's appeal, and declined to set aside the registration of the judgment under the RECJA.\nChan Seng Onn\nSenior Judge\nLee Ping, Tan Wei Sze and Cristel Chong (Shook Lin & Bok LLP) for the appellant;\nYogarajah Yoga Sharmini and Shawn Tien (Haridass Ho & Partners) for the respondent.\n", "label": [[9, 72, "RESPONDENT"], [172, 184, "PETITIONER"], [862, 874, "PETITIONER"], [1014, 1027, "JUDGE"], [1069, 1077, "JUDGE"], [1252, 1336, "STATUTE"], [1342, 1399, "PRECEDENT"], [1453, 1468, "PROVISION"], [1472, 1477, "STATUTE"], [1497, 1509, "PROVISION"], [1517, 1559, "STATUTE"], [1625, 1692, "PRECEDENT"], [1780, 1788, "GPE"], [1885, 1953, "PRECEDENT"], [1971, 1979, "GPE"], [2196, 2208, "ORG"], [2232, 2243, "RESPONDENT"], [2464, 2473, "GPE"], [2566, 2587, "PROVISION"], [2595, 2600, "STATUTE"], [2676, 2684, "OTHER_PERSON"], [2933, 2948, "GPE"], [2959, 2988, "STATUTE"], [2996, 3058, "ORG"], [3097, 3108, "ORG"], [3241, 3257, "DATE"], [3369, 3401, "COURT"], [3479, 3488, "GPE"], [3511, 3522, "DATE"], [3529, 3541, "DATE"], [3690, 3705, "DATE"], [3941, 3959, "PROVISION"], [4279, 4291, "PROVISION"], [4381, 4390, "GPE"], [4611, 4623, "PROVISION"], [4783, 4795, "PROVISION"], [4803, 4808, "STATUTE"], [4813, 4828, "PROVISION"], [4836, 4841, "STATUTE"], [5209, 5221, "PROVISION"], [5229, 5232, "STATUTE"], [5520, 5532, "PROVISION"], [5540, 5543, "STATUTE"], [5644, 5659, "PROVISION"], [5667, 5672, "STATUTE"], [5776, 5784, "OTHER_PERSON"], [5800, 5815, "PROVISION"], [5823, 5828, "STATUTE"], [5954, 5967, "OTHER_PERSON"], [5987, 5995, "OTHER_PERSON"], [6034, 6042, "OTHER_PERSON"], [6211, 6226, "PROVISION"], [6234, 6239, "STATUTE"], [6307, 6319, "PROVISION"], [6327, 6330, "STATUTE"], [6542, 6560, "PROVISION"], [6568, 6571, "STATUTE"], [6694, 6712, "PROVISION"], [6720, 6728, "STATUTE"], [6828, 6840, "PROVISION"], [6848, 6853, "STATUTE"], [6925, 6956, "GPE"], [6961, 6977, "GPE"], [7459, 7468, "GPE"], [7571, 7583, "PROVISION"], [7998, 8101, "PRECEDENT"], [8262, 8270, "GPE"], [8553, 8561, "OTHER_PERSON"], [8590, 8598, "GPE"], [8629, 8644, "PROVISION"], [8648, 8653, "STATUTE"], [8727, 8735, "GPE"], [8797, 8805, "OTHER_PERSON"], [8831, 8843, "PROVISION"], [8851, 8856, "STATUTE"], [9050, 9058, "OTHER_PERSON"], [9118, 9150, "PROVISION"], [9158, 9163, "STATUTE"], [9165, 9177, "PROVISION"], [9185, 9190, "STATUTE"], [9195, 9203, "OTHER_PERSON"], [9219, 9234, "PROVISION"], [9242, 9247, "STATUTE"], [9258, 9270, "PROVISION"], [9278, 9281, "STATUTE"], [9465, 9478, "ORG"], [9547, 9552, "STATUTE"], [9594, 9602, "OTHER_PERSON"], [9687, 9702, "PROVISION"], [9710, 9715, "STATUTE"], [9813, 9831, "ORG"], [9894, 9902, "OTHER_PERSON"], [10038, 10046, "OTHER_PERSON"], [10070, 10088, "ORG"], [10209, 10224, "PROVISION"], [10232, 10237, "STATUTE"], [10267, 10273, "PROVISION"], [10281, 10286, "STATUTE"], [10323, 10335, "PROVISION"], [10343, 10348, "STATUTE"], [10493, 10502, "GPE"], [10516, 10524, "OTHER_PERSON"], [10552, 10567, "PROVISION"], [10575, 10580, "STATUTE"], [10604, 10610, "PROVISION"], [10618, 10623, "STATUTE"], [10856, 10865, "PROVISION"], [10873, 10878, "STATUTE"], [10946, 10951, "STATUTE"], [11061, 11067, "PROVISION"], [11075, 11080, "STATUTE"], [11089, 11095, "PROVISION"], [11103, 11108, "STATUTE"], [11209, 11215, "PROVISION"], [11223, 11228, "STATUTE"], [11442, 11451, "GPE"], [11473, 11477, "OTHER_PERSON"], [11670, 11678, "GPE"], [11935, 11947, "PROVISION"], [12237, 12245, "OTHER_PERSON"], [12254, 12272, "ORG"], [12606, 12614, "OTHER_PERSON"], [12636, 12668, "PROVISION"], [12863, 12868, "COURT"], [12870, 12883, "JUDGE"], [12897, 12905, "JUDGE"], [12907, 12918, "JUDGE"], [12923, 12936, "JUDGE"], [12978, 13001, "OTHER_PERSON"], [13006, 13016, "LAWYER"]]}
