{"text": "\n\nSingapore Telecommunications Ltd v Starhub Cable Vision Ltd\n[2006] SGCA 5\n\nCase Number\n:\nCA 58/2005\nDecision Date\n:\n06 February 2006\nTribunal/Court\n:\nCourt of Appeal\nCoram\n:\nBelinda Ang Saw Ean J; Chao Hick Tin JA; Yong Pung How CJ\nCounsel Name(s)\n:\nTan Kok Quan SC, Kannan Ramesh, Sean Tan Kim Kang and Lam Sin Yee (Tan Kok Quan Partnership) for the appellant; Philip Jeyaretnam SC, Low Chai Chong and Ajinderpal Singh (Rodyk and Davidson) for the respondent\nParties\n:\nSingapore Telecommunications Ltd -- Starhub Cable Vision Ltd\nContract - Breach - Lease of appellant's facilities to respondent for cable television roll-out to high-rise residential properties - Respondent tapping into leased facilities to transmit cable television signals to other types of properties - Whether respondent breaching lease agreement by such conduct\nContract - Contractual terms - Admissibility of evidence - Whether common assumptions arrived at prior to execution of contract admissible as evidence of factual background to aid in interpretation of contract - Whether any estoppel by convention arising from such common assumptions so as to bar appellant from challenging respondent's tapping\nContract - Contractual terms - Exclusion clauses - Clause excluding liability for \"any indirect, incidental, consequential, or special damages (including, without limitation, damages for harm to business, lost revenues, or lost profits)\" - Whether exclusion clause precluding appellant's claim for loss of revenue from prospective lease of facilities to respondent for cable television roll-out to properties not covered by existing lease\nContract - Remedies - Damages - Whether compensatory damages for breach of contract may be awarded where no loss resulting from breach\n6 February 2006\nJudgment reserved.\nBelinda Ang Saw Ean J (delivering the judgment of the court):\n\n1 This appeal arose from an alleged breach of the Network Lease Agreement dated 16 June 1995 (\"the NLA\") made between the appellant, Singaproe Telecommunications Limited (\"SingTel\"), and the respondent, Starhub Cable Vision Ltd (\"SCV\"). The hearing below was confined to liability only, with assessment of damages, if ordered, to proceed separately. The trial judge found that SCV had breached the NLA, but held that SingTel could not recover the damages pleaded due to an exemption clause (\"Art 8.5(a)\") in the NLA. SingTel appealed against the trial judge's interpretation of Art 8.5(a). SCV, on its part, invited this court to endorse the trial judge's interpretation of Art 8.5(a) and further relied on three alternative grounds for affirming the dismissal at first instance of SingTel's claim.\nBackground\n\n2 In June 1994, as part of the Government's plan to promote the use of information technology, SCV was designated as the vehicle through which cable television was to be rolled out in Singapore. To facilitate the speedy implementation of this project as well as to avoid the duplication of expensive resources, SingTel was to lease its extensive island-wide network of optical fibres and underground ducts (\"the Facilities\") to SCV on a long-term basis for the latter's use in transmitting cable television signals.\n3 It is not disputed that as SCV had difficulties confirming its technical requirements for cable television roll-out to commercial and landed properties, the parties decided to proceed with a lease of the Facilities in respect of high-rise residential properties first. Accordingly, Exhibit A of the NLA delineated the types of properties covered by the contract as follows:\n1.2 The building category covered under this lease agreement is only the high-rise residential apartments in public and private housing estates. High-rise residential apartment blocks are defined as having more than 3-storeys. Shop-houses in HDB estates are classified under the high-rise apartment category as well.\n1.3 The building categories which are not included in this lease agreement are single family units or landed properties, schools and other educational institutions, libraries, hospitals, government buildings, commercial buildings, hotels, URA conservation projects and any other category of buildings.\nIn this judgment, we have referred to the properties listed in cl 1.2 as \"Permitted Properties\", and those listed in cl 1.3 as \"Excluded Properties\".\n4 Negotiations on a lease of the Facilities for cable television roll-out to Excluded Properties continued after the NLA was concluded. In a letter dated 8 July 1996, Tan Kwi Yong, SCV's Vice-President (Finance), sought SingTel's confirmation that the lease charges in respect of Excluded Properties would be calculated on an \"incremental costs\" basis. In other words:\n[T]he subsequent \"commercial and landed properties\" lease would be computed based on the additional fibers and ducting requirement only. The common portion of the network already covered under the \"high-rise residential properties\" lease [\"the Common Portion\"], such as the digital ring and the fibers to the MDFs etc., shall not be charged again.\nTan Kwi Yong also requested that the preferential lease rates applicable to Permitted Properties be extended to Excluded Properties under the same terms and conditions.\n5 SingTel replied in a letter dated 17 July 1996 from its Director (Corporate Account Management), Andrew Buay. SingTel confirmed that:\n[T]he pricing for the commercial and landed properties would be based on the additional fibres and ducting, and not include the Common Portion of the network already implemented for the high-rise residential properties. However, [SingTel] would also like to point out that the previous pricing for the Common Portion was contracted on the basis of restricted use. [emphasis added]\nIn addition, Andrew Buay highlighted that the charges for SCV's lease of the Facilities in respect of Excluded Properties would be fixed at \"commercially agreed terms, and no longer based on preferential pricing treatment\".\n6 Andrew Buay wrote to Tan Kwi Yong again on 14 August 1996 with details of SingTel's revised lease charges for landed properties. Although these rates were lower than those earlier offered by SingTel, SCV felt that they were still too high and, in a letter dated 29 August 1996, referred the matter to the Telecommunication Authority of Singapore (\"TAS\") for moderation. Pending its review of the proposed charges for landed properties, TAS wrote to SCV on 27 September 1996 suggesting that it \"seriously consider\" SingTel's offer at least where commercial properties were concerned. TAS also mentioned that SCV had \"a separate option to self-provide\". We shall be discussing the effect of the various communications later (see [39] below).\n7 SCV remained dissatisfied with the terms quoted by SingTel even after they had been moderated by TAS. Following TAS's confirmation that SCV could lay its own telecommunication links, SCV informed SingTel in a letter dated 14 March 1997 that it had decided not to lease the Facilities for cable television roll-out to landed properties, but would instead either build its own infrastructure where necessary or, where such construction would not be viable, lease the Facilities from SingTel on a case-by-case basis. In reply, SingTel sent a letter dated 2 April 1997 stating:\nWe respect SCV's decision in building its own infrastructure to serve the landed property residents, and therefore withdraw all our previous offers on the lease of ducting and fibre for the same said purpose.\n8 As for commercial properties, negotiations on a lease of the Facilities continued, but again, no agreement was eventually concluded.\n9 In November 2001, SingTel discovered that SCV had been using the Facilities leased under the NLA to provide cable television services to Excluded Properties. This led to SingTel's suit against SCV for breach of the NLA. SingTel claimed that its loss and damage by reason of such breach was the \"loss in revenue that [it] would otherwise have earned from [SCV's] lease of commercial dark fibre for the transmission of the Cable Services to the Excluded Properties\".\n10 To understand how SCV conveyed cable television signals to Excluded Properties, it is necessary to first have an overview of the way in which these signals were sent to Permitted Properties. In simplified terms, cable television signals were carried from SCV's headend via the Facilities to SCV's optical receivers (\"ORs\"), which were typically housed in selected high-rise residential apartment blocks. The segment of the transmission infrastructure thus far is termed the Common Portion and is that portion of the Facilities covered by the NLA. From the ORs, the signals were transmitted by SCV's co-axial cables, which were located in SingTel's underground ducts, to SCV's lead-in pipes at individual high-rise residential apartment blocks. The signals reaching each lead-in pipe then travelled through further co-axial cables and ducts constructed and owned by SCV to the various units in each apartment block. This last segment of the transmission infrastructure - ie, the co-axial cables and ducts connecting the lead-in pipe with the individual residential units (\"the Last-Mile Network\") - was constructed and owned by SCV and lay outside the Common Portion. What SCV did was to build extensions from the Last-Mile Network. The cable television signals reaching Permitted Properties were conveyed onwards to Excluded Properties through these extensions.\n11 For ease of reference, we have used the word \"tapping\" in this judgment to describe SCV's transmission of cable television signals to Excluded Properties via its extensions from the Last-Mile Network. In this respect, we note counsel's concern that the use of this term, which carries a connotation of trespass, might prejudice SCV's case. Counsel's fears were unfounded as the key players in this dispute had themselves used the term \"tapping\" without, as far as we could see, attributing any negative connotations to it. We note that SCV itself freely spoke of \"tapping\" in its letter to SingTel dated 10 April 2002. By that time, SCV would have known that there was a possibility of litigation arising from its provision of cable television services to Excluded Properties. That SCV nonetheless referred to its own conduct as \"tapping\" indicated that it could not have been unduly concerned about any negative inferences which might be drawn against it from the use of this term. As stated, we have used this expression strictly as an abbreviated way of describing SCV's method of transmitting cable television to Excluded Properties.\nThe decision at first instance\n\n12 At the trial, SCV advanced several lines of defence. Those which are relevant to this appeal are the following.\n13 First, SCV submitted that the NLA, on its true construction, did not contain any express or implied prohibition on tapping.\n14 Second, SCV invoked the doctrine of estoppel by convention to preclude SingTel from challenging the tapping which was carried out, claiming that the parties' dealings rested on two underlying common assumptions. The first related to the charges which SCV was to pay under the envisaged lease of the Facilities in respect of Excluded Properties. SCV alleged that the parties had agreed at a meeting on 7 September 1994 to calculate these charges on an incremental costs basis (\"the Incremental Costs common understanding\"). This agreement was later reaffirmed by SingTel in its letter dated 17 July 1996 (see [5] above). The second common assumption concerned SCV's right to \"self-provide\" (\"the Self-Provide common understanding\"). It was said that SingTel had by the letter dated 2 April 1997 (see [7] above) confirmed SCV's right to \"self-provide\" - ie, to \"extend its own co-axial network from the high-rise nodes to serve landed properties\".\n15 Third, SCV argued that the damages pleaded by SingTel were irrecoverable in principle.\n16 Fourth, it was said that the pleaded damages were in any case excluded by Art 8.5(a) of the NLA.\n17 The trial judge dismissed all but the last of the above submissions. He held that tapping, although not expressly prohibited under the NLA, was not authorised. This was because \"matters outside the [NLA] were excluded from it, and had to be brought in by further agreement\". In support of this view, the trial judge pointed to para 2.4 of the draft minutes of the meeting on 7 September 1994 (\"the Draft Minutes\") which read:\nAny extension into the areas currently excluded from the Sing Tel Lease will be based on incremental costs i.e. ignoring the facilities already included in this Sing Tel Lease.\n18 The trial judge also relied on two other documents to support his ruling that tapping was not allowed under the NLA. One of these was a footnote to para 3.3 of TAS's paper on \"SingTel's Lease of Ducts/Fibre to SCV for its Roll-out to Landed Properties\" which stated that \"the current lease term for high-rise prohibit[ed] tapping off to serve landed and commercial estates\". The other document was an internal e-mail dated 16 October 2001 from Vivien Chow, SCV's Senior Manager (Regulatory Affairs and Operations), to Thomas Ee, the company's Senior Vice-President (Broadband Engineering Services), stating, inter alia, that:\n... SingTel's NLA is for the sole purpose of serving residential properties only. As such, SCV may tap/extend from OR[s] to serve residential properties and not commercial properties.\n19 With regard to the defence of estoppel by convention, the trial judge was not convinced that there was an agreement to charge SCV only incremental costs when it used the Facilities to transmit cable television services to Excluded Properties. He regarded the phrase \"restricted use\" in SingTel's letter dated 17 July 1996 (see [5] above) as indicative that the lease rates previously quoted by SingTel were for cable television roll-out to Permitted Properties only. Commercial rates would apply where Excluded Properties were concerned. Thus, when SCV used the Facilities to provide cable television services to such properties, it would have to make additional payment even if it utilised only those optical fibres and ducts already comprised in the Common Portion. The trial judge also noted that under the NLA, SingTel was not charging SCV purely on a cost recovery basis. When the rent payable by SCV exceeded the Minimum Guaranteed Rent set out in Exhibit F of the NLA, SingTel would receive additional payment without having to incur any additional expenditure. In the trial judge's view, this belied SCV's arguments on the incremental costs basis of charging. It was further held that even if the parties had agreed on this method of charging, it was of no avail to SCV because \"exemption from further payment [did] not operate as authority to tap\".\n20 The trial judge was likewise unconvinced by the argument that SingTel had affirmed SCV's right to \"self-provide\" and was thus estopped from challenging the latter's tapping. He held that the letter dated 2 April 1997 (see [7] above) did not represent SingTel's unequivocal consent to SCV's tapping because SingTel, in referring to SCV's construction of its \"own infrastructure\", might have meant SCV's construction of a separate transmission network independent of SingTel's existing network, as opposed to a network connected to the Facilities leased under the NLA. (SCV's extensions from the Last-Mile Network were of the latter nature.) It was further held that SCV could not in any event invoke the letter dated 2 April 1997 as the basis of an estoppel since the relevant facts had not been pleaded with the proper particulars.\n21 The trial judge thus found that SCV had breached the NLA by tapping, and that such breach had caused SingTel to lose revenue in the form of the additional charges which SCV would have had to pay for using the Facilities to transmit cable television signals to Excluded Properties. The loss of revenue pleaded by SingTel was not, however, recoverable since it was specifically excluded by Art 8.5(a) of the NLA, the text of which is reproduced in [51] below. The trial judge held that the classes of damages listed in Art 8.5(a) had to be read \"disjunctively\". Since SingTel's claim fell within the \"lost revenues, or lost profits\" part of the excluded liabilities in Art 8.5(a), no damages could be recovered for such loss.\nSCV's alternative grounds for affirming the trial judge's decision\n\n22 SCV's alternative grounds for affirming the judgment at first instance are essentially a reiteration of the defences outlined above (at [13]-[16]), namely:\n(a) tapping was not prohibited under the NLA;\n(b) SingTel was estopped by convention from challenging SCV's right to serve Excluded Properties by tapping;\n(c) the damages pleaded by SingTel were irrecoverable in principle.\nIn essence, Mr Philip Jeyaratnam SC on behalf of SCV sought to overturn the trial judge's ruling that SCV was in breach of the NLA. Since the issue of liability necessarily precedes the question of the recoverability of damages, we shall consider SCV's alternative grounds first before dealing with SingTel's appeal on the interpretation of Art 8.5(a).\n23 We propose to deal with grounds (a) and (b) together as they both come under the purview of the construction of the NLA and the extent to which the court may have regard to extrinsic facts and circumstances for this purpose. In its pleaded case and submissions on estoppel by convention, SCV sought to rely on evidence both pre-dating and post-dating the NLA.\n24 The general rule is that extrinsic evidence is not admissible for the construction of a written contract; the parties' intentions must be determined, on legal principles of construction, from the words they have used: per Lord Wilberforce in L Schuler AG v Wickman Machine Tool Sales Ltd\n[1974] AC 235\nat 261. Under the contextual approach to construction which this court has in the past adopted, the court looks at the language of the contract together with the context in which the words are used. This is because, as Lord Wilberforce pointed out in Reardon Smith Line Ltd v Yngvar Hansen-Tangen\n[1976] 1 WLR 989\nat 995-996 (approved by this court in Mt Elizabeth Hospital Ltd v Allan Ng Clinic for Women\n[1994] 3 SLR 639\nat 652, [35]):\nNo contracts are made in a vacuum: there is always a setting in which they have to be placed. The nature of what is legitimate to have regard to is usually described as \"the surrounding circumstances\" but this phrase is imprecise: it can be illustrated but hardly defined. In a commercial contract it is certainly right that the court should know the commercial purpose of the contract and this in turn presupposes knowledge of the genesis of the transaction, the background, the context the market in which the parties are operating.\n25 The general principles which underline the contextual approach to the interpretation of contracts were summarised by Lord Hoffmann in Investors Compensation Scheme Ltd v West Bromwich Building Society\n[1998] 1 WLR 896\n(\"ICS v West Bromwich\") at 912-913 as follows:\n(1) Interpretation is the ascertainment of the meaning which the document would convey to a reasonable person having all the background knowledge which would reasonably have been available to the parties in the situation in which they were at the time of the contract.\n(2) The background was famously referred to by Lord Wilberforce as the \"matrix of fact,\" but this phrase is, if anything, an understated description of what the background may include. Subject to the requirement that it should have been reasonably available to the parties and to the exception to be mentioned next, it includes absolutely anything which would have affected the way in which the language of the document would have been understood by a reasonable man.\n(3) The law excludes from the admissible background the previous negotiations of the parties and their declarations of subjective intent. They are admissible only in an action for rectification. The law makes this distinction for reasons of practical policy and, in this respect only, legal interpretation differs from the way we would interpret utterances in ordinary life. The boundaries of this exception are in some respects unclear. But this is not the occasion on which to explore them.\n(4) The meaning which a document (or any other utterance) would convey to a reasonable man is not the same thing as the meaning of its words. The meaning of words is a matter of dictionaries and grammars; the meaning of a document is what the parties using those words against the relevant background would reasonably have been understood to mean. The background may not merely enable the reasonable man to choose between the possible meaning of words which are ambiguous but even (as occasionally happens in ordinary life) to conclude that the parties must, for whatever reason, have used the wrong words or syntax ...\n(5) The \"rule\" that words should be given their \"natural and ordinary meaning\" reflects the common sense proposition that we do not easily accept that people have made linguistic mistakes, particularly in formal documents. On the other hand, if one would nevertheless conclude from the background that something must have gone wrong with the language, the law does not require judges to attribute to the parties an intention which they plainly could not have had.\nThis court endorsed the above principles in Pacific Century Regional Development Ltd v Canadian Imperial Investment Pte Ltd\n[2001] 2 SLR 443.\nWe also note that Lord Hoffmann subsequently clarified in Bank of Credit and Commerce International SA v Ali\n[2002] 1 AC 251\n(\"BCCI v Ali\") at [39] that the words \"absolutely anything\" which he used in ICS v West Bromwich referred to \"anything which a reasonable man would have regarded as relevant\".\n26 In the present appeal, two principles of contractual interpretation are particularly apposite. The first is that the law differentiates between (a) admissible background evidence of the nature and objectives of a contract and (b) inadmissible evidence of negotiations and of the parties' subjective intentions (ie, the third principle identified by Lord Hoffmann in ICS v West Bromwich). The second is that subsequent conduct cannot be taken into account as an aid to construction (see James Miller & Partners Ltd v Whitworth Street Estates (Manchester) Ltd\n[1970] AC 583\nat 603, followed in Re Lin Securities (Pte)\n[1988] SLR 340\nat 350, [37]). The subsequent conduct of the parties (including any words they use) may however be sufficient to show that they have made a new contract or to constitute the basis of an estoppel (as to which see L Schuler AG v Wickman Machine Tool Sales Ltd ([24] supra) at 261 per Lord Wilberforce and James Miller & Partners Ltd v Whitworth Street Estates (Manchester) Ltd at 603 per Lord Reid). The effect of this second principle is, as Lord Denning MR commented in Amalgamated Investment & Property Co Ltd v Texas Commerce International Bank Ltd\n[1982] QB 84\nat 120:\n[W]e have available to us - in point of practice if not in law - evidence of subsequent conduct to come to our aid. It is available - not so as to construe the contract - but to see how [the parties] themselves acted on it. Under the guise of estoppel we can prevent either party from going back on the interpretation they themselves gave to it.\n27 SCV's claim of estoppel by convention in the present case is based on the alleged existence of an agreement or a common assumption prior to (and not after) the execution of the NLA, which is quite different from evidence of subsequent conduct of the kind referred to by Lord Denning. SCV relied on the Draft Minutes and the parties' post-contractual communication to support the existence of the agreement or common assumption alleged. Is such evidence admissible to aid in the interpretation of the NLA? We are mindful, and we agree with Jonathan Parker J in Philip Collins Ltd v Davis [2000] 3 All ER 808 at 824, that the doctrine of estoppel by convention should not be used as a means to admit, as it were by the back door, evidence of the parties' alleged subjective intentions or negotiations to ascertain the meaning of contractual documents where such evidence would otherwise be inadmissible. However, a proven common assumption prior to the NLA is admissible factual background and as such forms part of the context of that document (as to which see Lord Hoffmann in BCCI v Ali at 269, [39]). In other words, a proven common assumption is an objective fact that the court can and should take into account as part of the \"factual matrix\" in which the contract was made.\n28 The minimum requirements for the doctrine of estoppel by convention to apply are, on the authority of Republic of India v India Steamship Co Ltd (No 2)\n[1998] AC 878\nat 913, that:\n(a) the parties to a transaction act on an assumed state of facts or law;\n(b) the assumption is either one which both parties share or one which is made by one party and acquiesced in by the other; and\n(c) in the case of a shared assumption, there is either an \"agreement or something very close to it\" in respect of the assumption.\nIf these requirements are satisfied, the parties are precluded from denying the truth of that assumption if it would be unjust or unconscionable to allow them (or one of them) to go back on it: see Chitty on Contracts vol 1 (Sweet & Maxwell, 29th Ed, 2004) at para 3-107.\n29 With these principles in mind, we first turn to the question of whether the doctrine of estoppel by convention applies to bar SingTel from arguing that there was a prohibition against tapping. Mr Jeyaratnam contends that as a consequence of the application of this doctrine, SCV was entitled to tap signals sent to Permitted Properties by building extensions from the Last-Mile Network to transmit such signals to Excluded Properties. In essence, SCV seeks to rely on the doctrine of estoppel by convention to preclude SingTel from asserting a different interpretation of the NLA. The meeting of 7 September 1994 is vital to SCV's case on estoppel as it would show either that (a) the parties negotiated the NLA on an antecedent agreed basis or (b) the parties accepted a particular state of things which was the foundation of the dealings between them.\n30 The alleged common assumption, as pleaded in para 18 of the Re-Amended Defence and Counterclaim, is as follows:\nFurther or alternatively, the parties shared the common assumption particularised below so that the Plaintiffs are estopped by convention from asserting that the Defendants were not entitled to:\n(1) Extend their own fibre or co-axial distribution network and/or ducts network to serve properties not included in Clause 1.2 of Exhibit A or set out in Clause 1.3 of Exhibit A; and/or\n(2) Transmit Cable Services to any property in Singapore utilising the Defendants' fibre or co-axial distribution network and ducts.\nPARTICULARS OF COMMON ASSUMPTION\n(a) As evidenced by the Defendants' letter dated 8 July 1996 and the Plaintiffs [sic] reply dated 17 July 1996, the understanding at the date of the Agreement was that the Defendants\n(i) could serve commercial and landed properties,\n(ii) would pay only for additional fibres and ducting leased from the Plaintiffs for this purpose, and\n(iii) would not pay any additional sum for the Leased Facilities in relation to serving such commercial and landed properties.\n31 In its Further and Better Particulars filed on 24 September 2003, SCV elaborated:\n(iii) In so far as it [the above common assumption] was oral, the understanding was reached during negotiations between the Defendants' and the Plaintiffs' respective commercial teams prior to entry into the Agreement as evidenced by the Defendants' letter dated 8 July 1996 and the Plaintiffs' reply dated 17 July 1996 which expressly agree that this was the understanding reached during negotiations. This understanding was reflected in the discussions during the negotiation meeting held on 7 September 1994 attended by Chua Sock Koong, Yvonne Kwek, Lian Bee Leng, Lim Yang Kim and Robert Tan of the Plaintiffs, Lee Theng Kiat, Kwek Buck Chye, Sio Tat Hiang, Yong Lum Sung, Tay Kiong Hong, Terry Wee, Tan Kwi Yong and Daniel Goh of the Defendants as well as Mr Goh Boon Wah from [TAS]. In addition, the Defendants rely on the discussions which took place in the meeting between TAS, the Plaintiffs, and the Defendants on 27 September 1996 referred to in the letter dated 27 September 1996 as reflecting and/or evidencing this understanding.\n32 The Incremental Costs common understanding (as alleged by SCV) is the parties' mutual understanding that when SCV leased the Facilities for cable television roll-out to Excluded Properties, it would not be charged again for its use of the Common Portion. SCV says that the Incremental Costs common understanding was reached at the 7 September 1994 meeting. As evidence of this common understanding, SCV relies on para 2.4 of the Draft Minutes ([17] above), SCV's letter of 8 July 1996 ([4] above) and SingTel's letter dated 17 July 1996 ([5] above). As further evidence of this common understanding, SCV cites two letters which were written after 7 September 1994. The first is SCV's letter dated 13 October 1994 asking SingTel for the \"incremental rates\" for hotels, hospitals, commercial buildings, schools and public buildings. SCV claims that at the trial, Chua Sock Koong (SingTel's Chief Financial Officer) agreed that SingTel understood \"incremental rates\" to mean the costs of extending the use of the Facilities to these building categories, without any additional charge for the use of the Common Portion. The second is SingTel's letter dated 20 July 1998. SCV points out that during cross-examination, Chua Sock Koong confirmed that the rates quoted in that letter were \"based on the additional duct and fibre required for commercial properties\" and did not include duplicate charges for the Common Portion.\n33 SCV further argues that the trial judge was wrong to conclude that SingTel could, without supplying any extra optical fibres and ducts, receive additional payment when SCV used the Common Portion to transmit cable television signals to Excluded Properties. SCV's criticisms of this holding are as follows. First, the trial judge misunderstood the expression \"restricted use\" in the letter of 17 July 1996 which referred not to the types of buildings to which SCV could provide cable television services, but to the type of cable services which SCV could provide pursuant to Art 2.3(b) of the NLA. Second, the trial judge erred in regarding the lease rates for Permitted Properties as preferential rates. Third, the trial judge's finding that there was never any Incremental Costs common understanding contradicted Chua Sock Koong's evidence that this understanding was reflected in the letter of 17 July 1996.\n34 Counsel for SingTel, Mr Tan Kok Quan SC, conceded at the hearing of the appeal that SVC was right in saying that the trial judge misunderstood the words \"restricted use\" in the letter dated 17 July 1996. Nonetheless, we agree with the trial judge's conclusion that in the present case, there was no agreement or common assumption or anything close to one as to the incremental costs basis of charging. SCV has not shown on a balance of probabilities that there was such an agreement or common assumption. The portions of Chua Sock Koong's cross-examination which SCV relies on were taken out of context. The evidence is that at the meeting on 7 September 1994, the parties were focusing on Permitted Properties and thus could not have, as Mr Tan argues, come to any Incremental Costs common understanding at that time. Besides, SingTel never agreed to para 2.4 of the Draft Minutes, which SCV says reflected the Incremental Costs common understanding. We note that on 14 September 1994, SingTel wrote to SCV requesting that para 2.4 of the Draft Minutes be deleted and replaced with a differently worded version. SCV replied by fax on 19 September 1994 stating that \"further discussions\" on SingTel's proposed changes to para 2.4 were needed. It is not clear whether further discussions were in fact held. SCV witnesses gave inconsistent evidence on this issue. We do not agree with SCV that SingTel's letter of 17 July 1996 changed the situation. We accept Mr Tan's submission that this letter was written on the underlying basis that there was going to be a separate agreement for the lease of the Facilities in respect of Excluded Properties. It would be an expansive and skewed reading of the evidence to give the letter its literal effect in the absence of such an agreement.\n35 In addition, both parties' conduct after 7 September 1994 was inconsistent with the existence of the alleged Incremental Costs common understanding. It is significant that an internal memo dated 20 December 1994 to SCV's Chairman stated that the parties had not agreed on how commercial and landed properties were to be counted and charged for the purpose of cable television roll-out. This internal memo belies SCV's claim that the Incremental Costs common understanding had already been reached by then. Internal e-mails within SCV dated 26 January 1995 provide further support for our conclusion. The last sentence of one such internal e-mail stated that there was \"[n]o agreement on [l]anded and commercial building rates yet\". Again, from the meeting between TAS and SCV on 13 March 1995, it can be seen that the lease rates applicable to Excluded Properties had not been fixed yet as at that date. In fact, as late as 22 April 1996, the parties had still not settled the lease rates for Excluded Properties, and SingTel, at least, had still not agreed to the incremental costs basis of charging. This can be seen from an internal e-mail within SCV of the same date.\n36 Even if the Incremental Costs common understanding existed on 7 September 1994, it does not advance SCV's case on estoppel. At most, this common understanding shows that the parties had agreed that for the lease to be concluded in respect of Excluded Properties, the lease charges would be based on incremental costs. This does not, however, translate into a common understanding that SCV could, under the NLA, use the Facilities to provide cable television services to Excluded Properties without more; neither does it entail that SCV could use the Facilities for this purpose without entering into a separate agreement with SingTel.\n37 The Self-Provide common understanding (as alleged by SCV) is the parties' mutual understanding that SCV could extend its own co-axial network from the Last-Mile Network so as to transmit cable television signals to Excluded Properties. SCV argues that the trial judge was wrong to hold that \"self-provide\" might have meant the construction of a transmission infrastructure independent of the Facilities (see [20] above) since:\n(a) the approach for cable television roll-out island-wide was that SCV was to lease optical fibres and ducts from SingTel instead of building its own; and\n(b) SingTel's President and Chief Executive Officer, Lee Hsien Yang, had admitted during cross-examination that:\n(i) SingTel understood the letter dated 14 March 1997 to mean that SCV intended to build a transmission network connected to SingTel's infrastructure; and\n(ii) SingTel did not object to SCV's plan.\n38 As an adjunct to its arguments on the Self-Provide common understanding, SCV cites its provision of cable television services to libraries, community centres and schools under the Government's SingaporeOne initiative launched in June 1997 as evidence that SingTel knew about SCV's tapping but did not raise any objections. Although SingTel's witnesses testified that they thought SCV might have been using the Multi-point Multi-channel Distribution system (\"MMDS\") to provide cable television services under the SingaporeOne initiative, SCV contends that such evidence is unbelievable given the limitations of MMDS. With respect, we found no merit in the arguments. The evidence of SingTel's witnesses is plausible since MMDS has not been totally written off despite its limitations. Indeed, SCV was still using MMDS at the time of the trial, albeit on a limited scale. As for Lee Hsien Yang's testimony, the witness clarified that when he said SingTel knew SCV meant to use a network connected to the Facilities for cable television roll-out to Excluded Properties, his reply was based on SingTel's knowledge at the time of the trial after extensive rounds of discovery, and not based on SingTel's knowledge as at 1997. Lee Hsien Yang's evidence falls short of an admission that SingTel knew of SCV's tapping and acquiesced in it.\n39 If anything, the Self-Provide argument is a distraction just like the Incremental Costs common understanding. Looking at the letter of 27 September 1996 from TAS to SCV (see [6] above) when TAS first mentioned SCV's option to self-provide, we note that this suggestion was raised in the context of cable television roll-out to commercial properties. Prior to that, when dealing with landed properties, the letters from SingTel to SCV dated 14 August 1996 and the letter from SCV to TAS dated 29 August 1996 talked about the use of SingTel's underground pipes to install co-axial cables for landed properties. Thus, when TAS stated in its letter of 1 March 1997 that it had no objections to SCV laying \"its own telecommunications links\" for landed property, TAS must have been referring to the building of separate underground ducts by SCV. This view is borne out by SCV's letter of 14 March 1997 (see [7] above), in which SCV talked about building its own infrastructure to serve landed properties and to lease from SingTel on a case-by-case basis. Besides, the parties had very different notions of what \"self-provide\" meant. SCV understood \"self-provide\" to mean building extensions from the Last-Mile Network which would still be linked to the Facilities even though they were located outside the Common Portion. In essence, SCV equated \"self-provide\" with \"tapping\". In contrast, SingTel did not regard \"self-provide\" and \"tapping\" as being the same. From SingTel's perspective, \"self-provide\" meant that SCV would construct its own network of fibres and ducts all the way from its headend to the properties to be served without any connection or link to SingTel's network. In our view, there was no shared assumption as to what sort of self-provision SCV could resort to, which is fatal to SCV's arguments on estoppel by convention.\n40 We are thus not persuaded that in signing the NLA, SCV was acting on the assumption that it would be entitled to extend its own co-axial distribution network from the Last-Mile Network to serve Excluded Properties. At the time the NLA was signed, the parties were not concerned with the aforesaid extension, as the undisputed arrangement was to cover Excluded Properties in another agreement (see [44] below). If the question of tapping had been raised in terms, SingTel would never have agreed to it. Furthermore, if it was the case, as argued, that SCV had throughout assumed that it was entitled to self-provide by tapping, this was not an assumption which SingTel was aware of, still less one which it shared; nor, in the circumstances, can there be any question of SingTel having acquiesced in any such assumption. In our judgment, the defence of estoppel by convention fails.\n41 As an aside, the trial judge was right on the pleading point. The Self-Provide common understanding allegedly evidenced by SingTel's letter of 2 April 1997 and the SingaporeOne initiative were not raised in the pleadings.\n42 With the plea of estoppel by convention out of the way, we turn to consider the scope of the NLA and the question of whether the use of the Facilities leased under the NLA by tapping was in violation of the NLA. SingTel's pleaded case is that given the language of cll 1.2 and 1.3 of Exhibit A of the NLA (see [3] above), such use of the Facilities amounted to a breach of Art 4.3 which stipulates:\nThe Company [SCV] hereby agrees that during the term of this Agreement it shall not use the Leased Facilities in violation of:-\n(i) this Agreement ...\n43 In response, SCV argues that in the absence of an express or implied prohibition on tapping in the NLA, SCV could do what it wanted with the cable television signals after they left the Common Portion. This was because SCV's tapping did not involve any trespass, any interference with Sing Tel's property, any additional strain on the Facilities or any interference with another party's cable television signals. SCV emphasises that it used its own resources in the form of extensions from the Last-Mile Network to transmit cable television signals which had left the Common Portion to more destinations other than just Permitted Properties alone.\n44 In deciding between these competing views of the NLA, it is necessary to look at the contractual background. In this case, the relevant contractual background is that the Facilities (and by inference, the cable television signals transmitted by those Facilities) were to be used in respect of Permitted Properties only. This was at the parties' choice as SCV at the relevant time was not in a position to provide cable television services to other types of properties. Crucially, at the time the NLA was signed, a lease for Excluded Properties was mutually envisaged. This is evident from the fact that in the same month of June 1995, shortly after the NLA was signed, SCV's Chairman directed the negotiating team to proceed to negotiate the lease concerning Excluded Properties. These instructions were acted upon.\n45 Thus, it would be lacking in commercial sense or logic for there to be in existence or in tandem alongside the NLA any sort of arrangement whereby SCV was allowed to extend its own co-axial distribution network from the Facilities to Excluded Properties. To paraphrase Lord Hoffmann in ICS v West Bromwich ([25] supra), a reasonable person reading cll 1.2 and 1.3 of Exhibit A of the NLA with knowledge of the relevant background would not construe the contract as allowing SCV to extend its own co-axial distribution network from the Facilities to serve Excluded Properties. Such an extension would plainly be contrary to the parties' decision at the material time to enter into a separate lease for the Excluded Properties. Consequently, the use of the Facilities leased under the NLA beyond what was delineated by cll 1.2 and 1.3 of Exhibit A would be a clear breach of what had been agreed by the parties in the NLA, particularly Art 4.3.\n46 SCV's analogy of a carrier of goods - ie, that delivery by the carrier to a specific addressee does not of itself prohibit onward carriage by the latter to someone else - is inapt as it is based on the premise that the NLA did not restrict what SCV could do with the cable television signals after they left the Facilities leased under the NLA. Bearing in mind that SCV could only use the Facilities subject to the conditions imposed by SingTel, one of which was that the leased Facilities were to be used to transmit cable television to Permitted Properties only, any use of the Facilities beyond the limits of cl 1.2 read with cl 1.3 of Exhibit A was not permitted. We note that SCV could not have transmitted cable television signals to Excluded Properties if those signals had not been so conveyed through the Facilities leased under the NLA to the Permitted Properties to begin with. As such, in building extensions to the Last-Mile Network so as to carry cable television signals from Permitted Properties to Excluded Properties, SCV was still making use of the Facilities leased under the NLA to serve the latter category of properties. From this perspective, it does not matter that the transmission of cable television signals from Permitted Properties to Excluded Properties was through extensions built by SCV.\n47 For completeness, we should comment on SCV's argument that read in the light of Art 2.1(b) of the NLA, Exhibits A and B simply describe \"the requirements and configuration\" of the Facilities to be provided by SingTel to SCV. In other words, Exhibit A (including cll 1.2 and 1.3) deals with technical matters only (the optical fibres and ducts which SingTel is to provide) and does not prescribe what SCV can or cannot do with the Facilities leased to it. We disagree with SCV on this point. Other provisions in the Exhibit indicate that it was meant to cover supplementary non-technical issues as well. For instance, cl 2.5 sets out some of SCV's obligations under the lease (see cll 2.5.1 and 2.5.3) and also imposes some restrictions on SCV (see cl 2.5.2).\n48 The third alternative ground relied upon by SCV is that the damages pleaded by SingTel were irrecoverable in principle. It should be noted that SingTel is seeking compensatory and not restitutionary damages. Mr Jeyaratnam argues that SingTel is not entitled to damages as it has suffered no loss. SCV's tapping did not impose any additional strain on the Facilities; neither did it deprive SingTel of any opportunity to provide cable television services since SingTel was not licensed to do so. SingTel did not lose any revenue from SCV's tapping either as:\n(a) there was no evidence that SCV would have agreed to lease additional optical fibres and ducts from SingTel if the latter had sought to stop the tapping; and\n(b) SingTel would have had to incur costs by supplying additional fibres and ducts to SCV before it could earn the revenue allegedly lost.\n49 With respect, SCV's arguments miss the point. It is trite law that a right to damages arises on proof of the breach of the contract itself because a legal right has been violated. SingTel's legal right has been violated and the secondary obligation to pay damages arises. The quantum of damages which SingTel may recover for breach of contract is distinct from its right to damages for such a breach, and is to be determined at the assessment of damages stage. As for whether SingTel recovers nominal or substantial damages, much will depend on what loss SingTel, at the assessment of damages stage, is able to successfully prove. The contention in this appeal that SingTel has suffered no loss is not only misconceived but also premature given that the trial was limited to the issue of liability.\n50 A subsidiary argument of SCV is that damages are to be assessed on the basis that the contract is performed in the manner most advantageous to the party liable. This argument does not advance SCV's case for it rests on the premise that the common assumption as pleaded existed which, we have found, was not the case.\nWhether SingTel's pleaded head of loss is excluded by the terms of Article 8.5(a)\n\n51 We now turn to the appeal proper. The principal issue concerns the correct interpretation of Art 8.5(a) which reads as follows:\nNotwithstanding any other provisions of this Agreement and regardless of any fault or negligence of [SCV] or [SingTel], neither Party shall be liable to the other for any indirect, incidental, consequential, or special damages (including, without limitation, damages for harm to business, lost revenues, or lost profits) regardless of the form of action or whether such Party had reason to know of such damages ...\nAs stated (in [21] above), the trial judge construed the words in parenthesis in Art 8.5(a) as representing different types of damages which were to be read disjunctively. He thus concluded that SingTel's claim for damages, being characterised as loss of revenue, was caught by the express exclusion of \"lost revenues\" in Art 8.5(a). With respect, the trial judge fell into error in two separate and independent respects.\n52 First, the trial judge overlooked the importance of adopting in this case a contextual approach when interpreting a contractual term. Under the contextual approach, the scope of Art 8.5(a), which is very broadly worded, may be cut down in the light of \"the purpose of the contract and the circumstances in which the contract was made\" (per Lord Nicholls in BCCI v Ali at [26]). Article 8.5(a) should be construed in the context of the contract as a whole. The focus on the purpose of the contract and the circumstances in which it was made is particularly apt where exemption clauses are concerned. The general rule should be applied that if a party otherwise liable is to exclude or limit his liability or to rely on an exemption, he must do so in clear words; any ambiguity or lack of clarity must be resolved against that party: per Lord Hobhouse in Homburg Houtimport BV v Agrosin Private Ltd\n[2004] 1 AC 715\nat [144]. The principle that exemption clauses must be construed strictly entails, as this court held in Hong Realty (Pte) Ltd v Chua Keng Mong\n[1994] 3 SLR 819\n(\"Hong Realty\") at 825, [19], that the application of such clauses must be restricted to the particular circumstances the parties had in mind at the time they entered into the contract.\n53 In Hong Realty, the respondent's stock-in-trade, which was stored in the appellants' warehouse, was damaged by water leaking from the cut ends of an uncapped overhead water pipe. The pipe had been cut as part of the appellants' renovation works in the warehouse. The appellants' maintenance officer, having been previously informed by the workmen carrying out the renovation works that the main valve to the pipe in question had been shut, left the cut ends of the pipe uncapped over the weekend. When the warehouse was re-opened after the weekend, it was found that water had leaked from the cut ends of the pipe, thereby soaking the respondent's stock-in-trade. The Court of Appeal affirmed the trial judge's decision that the appellants, in leaving the cut ends of the pipe uncapped without putting a pail beneath to catch any dripping water while the warehouse was closed for the weekend, had breached their duty of care as bailees of the respondent's goods. The Court of Appeal accepted that before the water pipe was cut, the place where the respondent's goods were kept was a fit and proper storage place. It became unfit, however, by reason of the renovation works done. This finding was important in dealing with the exemption clauses relied on by the appellants. Karthigesu JA (delivering the judgment of the court) said at 825, [17]:\nNow, when the respondent entered into the contract of bailment with the appellants, which included exemption cll (ii) and (iii), it could not have been in the contemplation of either of them that these exemption clauses would apply in circumstances other than [those] in which the storage area in the warehouse was prior to the intervention of the works undertaken on 20 December 1986. Thus had there been a leakage of water in the overhead water supply system through some patent defect before 20 December 1986 and the respondent's goods had been damaged we have no doubt that exemption cll (ii) and (iii) would have relieved the appellants of liability. It will be remembered that exemption cl (ii) provides that the goods stored at the appellants' warehouse are stored there 'at owner's risk' and cl (iii), inter alia, exempts the appellants from the negligence or default of their servants or agents and any person acting for or under the employ of the appellants. On the other hand since the water damage to the respondent's goods occurred between 20 and 22 December 1986, a period during which the works undertaken in the storage area of the warehouse had intervened, and in the circumstances of the learned judge's finding (above referred to), with which we have concurred, thereby rendering the storage area, between 20 and 22 December 1986 unfit as a proper place for the storage of goods, exemptions cll (ii) and (iii) cannot, in our judgment, operate to relieve the appellants of liability. To give another example, if for instance owing to the negligence of Thanapal [the appellants' maintenance officer], the door to the warehouse was not securely locked and third parties entered and stole or vandalized the respondent's goods such negligence would come within exemption cll (ii) and (iii).\n54 Karthigesu JA continued at 825-826, [19]:\nIt is trite law that exemption clauses must be construed strictly and this mean[s] that their application must be restricted to the particular circumstances the parties had in mind at the time they entered into the contract. On any view of the matter the respondent and the appellants could not have intended that the exemption clauses in the contract of bailment would apply when some act had intervened to alter the circumstances in which the exemption clauses would ordinarily apply.\n55 As stated (at [44] above), the contractual structure of the NLA was expressed in terms of the Facilities leased under the NLA (and as a corollary, the signals transmitted by those Facilities) being used in respect of Permitted Properties. A separate agreement on the lease of the Facilities in relation to Excluded Properties was envisaged. In these circumstances, it would be astonishing (unless compelled to do so by the words used in the NLA) to attribute to the parties an intention to exclude a liability for tapping, a subject matter which they never thought about. By analogy with Hong Realty, the application of Art 8.5(a) (also an exclusion clause) must be restricted to the particular circumstances the parties had in mind at the time they entered into the NLA. Tapping was not under consideration at the material time and thus, Art 8.5(a) cannot be taken to exclude liability for such act or conduct. That Art 8.5(a) does not apply, extend to or embrace tapping accords with the commercial purpose and construction of this provision. The commercial purpose of Art 8.5(a) was to protect each party to the NLA against the risk of non-performance or mis-performance by the other in relation to Permitted Properties. Put another way, Art 8.5(a) was meant to apply only where the types of damages listed arose while the parties were doing what was contemplated under the NLA, ie, using the Facilities to provide cable television services to Permitted Properties. We therefore hold that SingTel is not precluded by Art 8.5(a) from claiming damages from SCV.\n56 Given our analysis of Art 8.5(a), it is not strictly necessary for us to rule on the trial judge's interpretation that this provision excluded all claims for \"harm to business\", \"lost revenues\" or \"lost profits\", whether direct or indirect. However, we should say something about the article given the lengthy arguments canvassed by the parties. This is the second point on which, with respect, we disagree with the trial judge. As a matter of construction, the true scope and effect of Art 8.5(a) is more restricted than what the trial judge, with respect, appreciated.\n57 SingTel argues that the trial judge was wrong to interpret Art 8.5(a) as excluding all claims for \"harm to business\", \"lost revenues\" or \"lost profits\". Such a ruling, SingTel argues, not only defies commercial logic, but also runs contrary to the trial judge's finding of fact that the parties envisaged a separate lease of the Facilities for cable television roll-out to Excluded Properties and that SingTel would be paid commercial rates under that lease. Besides, the trial judge's interpretation is at odds with the express wording of Art 8.5(a), especially the word \"including\" at the start of the phrase in parenthesis. In addition, SingTel's contends that its loss is outside the ambit of Art 8.5(a) which only excludes indirect and consequential loss, ie, damages that come within the second limb of Hadley v Baxendale (1854) 9 Exch 341; 156 ER 145. This is because SingTel's claim is for \"direct\" loss arising naturally from the breach.\n58 SCV, on the other hand, submits that the trial judge was right in concluding that SingTel's claim was precluded by the express exclusion of \"lost revenue\". Mr Jeyaratnam argues that in Art 8.5(a), the types of damages listed in parenthesis are not to be read subject to the words appearing before since the words \"without limitation\" allow the court to construe Art 8.5(a) as a broad exclusion. It is also said that SingTel's claim, however framed, is indirect as it does not represent the lost value of performance but is instead for loss of a potential gain which is also speculative.\n59 Direct loss is loss that flows directly, naturally and in the ordinary course of events, from the defendant's breach (the first limb of the rule in Hadley v Baxendale), while \"indirect\" or \"consequential\" loss falls within the second limb of the rule. The purpose of the first part of Art 8.5(a) is to exclude contractual claims for indirect and consequential losses or special damages; that is to say, to exclude liability in contract for losses which can only be recovered under the second limb of the rule in Hadley v Baxendale. Before we consider some of the authorities which illustrate these propositions, we find it helpful to set out the following summary from Halsbury's Laws of England vol 12(1) (Butterworths, 4th Ed, 1998 Reissue) at para 812:\n'Consequential' damage or loss usually refers to pecuniary loss consequent on physical damage, such as loss of profit sustained due to fire damage in a factory. ... When used in an exemption clause in a contract, 'consequential' refers to damage which is only recoverable under the second head in Hadley v Baxendale, and does not preclude recovery of loss of profits under the first head in that case.\n60 Saint Line Limited v Richardsons, Westgarth & Co, Limited\n[1940] 2 KB 99\nconcerned the supply of defective ship's engines. The contract in question excluded liability for \"any indirect or consequential damages or claims whatsoever\". The shipowners claimed loss of profits during the time they were deprived of the use of the ship, expenses thrown away and expert superintendents' fees. They recovered all three. In the course of his judgment, Atkinson J said at 103:\nWhat does one mean by \"direct damage\"? Direct damage is that which flows naturally from the breach without other intervening cause and independently of special circumstances, while indirect damage does not so flow. The breach certainly has brought it about, but only because of some supervening event or some special circumstances. ...\nIn my judgment, the words \"indirect or consequential\" do not exclude liability for damages which are the direct and natural result of the breaches complained of.\n61 The English Court of Appeal in Croudace Construction Ltd v Cawoods Concrete Products Ltd [1978] 2 Lloyd's Rep 55 affirmed at 62 that the word \"consequential\" does not cover any loss which directly and naturally results, in the ordinary course of events, from a breach of contract.\n62 Both cases which we have referred to affirm that \"indirect or consequential\" loss covers the second limb of the rule in Hadley & Baxendale. The English Court of Appeal in Hotel Services Limited v Hilton International Hotels (UK) Limited\n[2000] BLR 235\nexpressly rejected the criticism in McGregor on Damages (Sweet & Maxwell, 16th Ed, 1997) at paras 25-26 that such a construction of the term \"consequential\" loss was too narrow. (The author was of the view that \"consequential\" loss could in some cases fall under the first limb of Hadley v Baxendale). We note that in the latest edition of this book (Sweet & Maxwell, 17th Ed, 2003), the author has conceded at para 1-039 that a narrower construction of the term \"consequential\" loss might be justified where exclusion clauses are concerned. The author has maintained his criticism of the English courts' approach whilst recognising that the weight of authority is against his view.\n63 Equally, \"special damages\" in the third line of Art 8.5(a) should be read as being ejusdem generis with the words \"indirect\" or \"consequential\" (which are synonymous) and in effect as referring to damages within the second limb of Hadley v Baxendale. The meaning of \"special damages\" in the context of liability for breach of contract is summarised in Halsbury's Laws of England vol 12(1) ([59] supra) at para 812 as follows:\nA distinction is frequently drawn between the terms 'general' and 'special' damages, which terms have different meanings according to the context in which they are used. In the context of liability for loss (usually in contract), general damages are those which arise naturally and in the normal course of events, whereas special damages are those which do not arise naturally out of the defendant's breach and are recoverable only where they were not beyond the reasonable contemplation of the parties (for example, where the plaintiff communicated to the defendant prior to the breach the likely consequences of the breach).\n64 In Deepak Fertilisers and Petrochemicals Corporation v ICI Chemicals & Polymers Ltd (\"Deepak Fertilisers\") [1999] 1 Lloyd's Rep 387, the exclusion clause in question purported to rule out liability for \"loss of anticipated profits ... or for indirect or consequential damages\". The crucial difference between the exclusion clause in Deepak Fertilisers and Art 8.5(a) is that in the former case, loss of profits was explicitly excluded in addition to all indirect or consequential loss due to the use of the word \"or\". In this case, Art 8.5(a) refers to \"indirect, incidental, consequential, or special damages (including ... lost revenues, or lost profits)\" [emphasis added]. Thus, it is only where lost revenue is indirect or consequential that it is excluded under Art 8.5(a). The decision in Pegler Limited v Wang (UK) Limited\n[2000] BLR 218\n(\"Pegler v Wang\") supports this interpretation.\n65 His Honour Judge Peter Bowsher QC in Pegler v Wang had to consider the meaning of a clause which excluded liability for \"any indirect, special or consequential loss, howsoever arising (including but not limited to loss of anticipated profits or of data) in connection with or arising out of the supply, functioning or use of [the goods and services supplied]\". The judge said at [50] that those words referred to loss under the second limb of Hadley v Baxendale. In his view:\n[T]he reference by the words in brackets to loss of anticipated profits does not mean that the exclusion effected by this clause includes all loss of profits: it is plain from the context that only loss of profits which are of the character of indirect, special or consequential loss are referred to. As was explained in Victoria Laundry (Windsor) Ltd v Newman Industries Ltd\n[1949] 2 KB 528\nat 536, claims for loss of profits may fall into either the first or the second rule in Hadley v Baxendale, depending on the circumstances. [emphasis in original]\n66 As for \"incidental\" damages, we note the English Court of Appeal's decision in Leicester Circuits Limited v Coates Brothers Plc [2003] EWCA Civ 290. In that case, the phrase in question excluded liability for \"consequential or incidental damage of any kind whatsoever ... including without limitation any indirect loss or damage such as operating loss, loss of clientele\". The appellate court held at [63] that:\nThe loss of clientele has to be of a kind which is truly \"consequential\" before it can be excluded. The words \"or incidental\" are too vague to detract from the requirement that the word \"consequential\"is to be understood in the sense adopted by this court in Croudace Construction Ltd v Cawoods Concrete Products Ltd [1978] 2 Lloyds Rep.55, 8 BLR 20.\n67 Likewise, we are of the view that the word \"incidental\" in Art 8.5(a) is superfluous. The phrases in parenthesis - \"harm to business\", \"lost revenues\" or \"lost profits\" - are examples of indirect or consequential loss or special damages, all of which are recognised as claims falling under the second limb of the rule in Hadley v Baxendale. It is \"lost revenues\" that are indirect or consequential which are excluded under Art 8.5(a).\n68 The concluding words of the first part of Art 8.5(a) (\"whether such Party had reason to know of such damages\") is further support that its purpose is to exclude contractual claims for indirect and consequential losses or special damages. Those words appear to have been added out of caution given the strict approach of the courts to exclusion clauses, rather than as a palpable attempt to exclude damages under the first limb of the rule in Hadley v Baxendale.\n69 By way of observation, at the end of the day, the opposing views as to the meaning of Art 8.5 (a) rest on whether the loss is direct or indirect. Assuming for the sake of discussion that Art 8.5(a) applies (we have concluded that it does not in [55] above), a factual analysis of the loss would have been required in order to assess how \"direct\" or \"indirect\" the loss was, and this could not be achieved until assessment of damages when the evidence is before the court. As a split trial was ordered, it is not surprising to find that the affidavits of evidence-in-chief focused primarily on issues of liability.\n70 In conclusion, for the reasons given, we allow this appeal with costs. We also order judgment on liability to be entered in favour of SingTel and for damages to be assessed. The security for costs shall be refunded to SingTel.\nCopyright (c) Government of Singapore.\n", "label": [[2, 34, "PETITIONER"], [37, 61, "RESPONDENT"], [176, 195, "JUDGE"], [199, 212, "JUDGE"], [217, 230, "JUDGE"], [252, 264, "LAWYER"], [269, 282, "LAWYER"], [284, 301, "LAWYER"], [306, 317, "LAWYER"], [319, 343, "LAWYER"], [364, 381, "LAWYER"], [386, 400, "LAWYER"], [405, 421, "LAWYER"], [1792, 1811, "JUDGE"], [2058, 2082, "RESPONDENT"], [2253, 2256, "STATUTE"], [2272, 2279, "ORG"], [2347, 2358, "PROVISION"], [2367, 2370, "STATUTE"], [2372, 2379, "ORG"], [2433, 2443, "PROVISION"], [2445, 2448, "ORG"], [2529, 2539, "PROVISION"], [2637, 2644, "ORG"], [2850, 2859, "GPE"], [2977, 2984, "ORG"], [3211, 3214, "ORG"], [3483, 3486, "STATUTE"], [4444, 4447, "COURT"], [4481, 4492, "DATE"], [4494, 4506, "OTHER_PERSON"], [4547, 4554, "ORG"], [5044, 5056, "OTHER_PERSON"], [5215, 5222, "ORG"], [5249, 5261, "DATE"], [5312, 5323, "OTHER_PERSON"], [5325, 5332, "ORG"], [5579, 5586, "ORG"], [5743, 5754, "OTHER_PERSON"], [5788, 5791, "ORG"], [5956, 5967, "OTHER_PERSON"], [5977, 5989, "OTHER_PERSON"], [5999, 6013, "DATE"], [6030, 6037, "ORG"], [6147, 6154, "ORG"], [6156, 6159, "ORG"], [6261, 6301, "ORG"], [6304, 6307, "ORG"], [6392, 6395, "ORG"], [6405, 6408, "ORG"], [6412, 6429, "DATE"], [6470, 6477, "ORG"], [6539, 6542, "ORG"], [6563, 6566, "ORG"], [6698, 6701, "ORG"], [6749, 6756, "ORG"], [6795, 6798, "ORG"], [6810, 6813, "ORG"], [6834, 6837, "ORG"], [6881, 6884, "ORG"], [6894, 6901, "ORG"], [6920, 6933, "DATE"], [7179, 7186, "ORG"], [7222, 7229, "ORG"], [7250, 7262, "DATE"], [7283, 7286, "ORG"], [7636, 7643, "ORG"], [7660, 7663, "ORG"], [7711, 7714, "STATUTE"], [7788, 7795, "ORG"], [7811, 7814, "ORG"], [7833, 7836, "STATUTE"], [7838, 7845, "ORG"], [7973, 7976, "ORG"], [8104, 8107, "ORG"], [8341, 8344, "ORG"], [8628, 8631, "ORG"], [8724, 8731, "ORG"], [8756, 8759, "ORG"], [8951, 8954, "ORG"], [9213, 9216, "ORG"], [9258, 9261, "ORG"], [9535, 9538, "ORG"], [9779, 9782, "ORG"], [9987, 9990, "ORG"], [10041, 10048, "ORG"], [10084, 10087, "ORG"], [10769, 10772, "ORG"], [10874, 10877, "ORG"], [10937, 10944, "ORG"], [11211, 11214, "ORG"], [11267, 11283, "DATE"], [11428, 11435, "ORG"], [11525, 11528, "ORG"], [11615, 11622, "ORG"], [11647, 11659, "DATE"], [11686, 11689, "ORG"], [11861, 11868, "ORG"], [11979, 11989, "PROVISION"], [11997, 12000, "STATUTE"], [12140, 12143, "STATUTE"], [12204, 12207, "STATUTE"], [12380, 12396, "DATE"], [12723, 12726, "STATUTE"], [12771, 12774, "ORG"], [12787, 12794, "ORG"], [13034, 13049, "DATE"], [13055, 13066, "OTHER_PERSON"], [13129, 13138, "OTHER_PERSON"], [13241, 13248, "ORG"], [13328, 13331, "ORG"], [13710, 13717, "OTHER_PERSON"], [13733, 13745, "DATE"], [13818, 13825, "ORG"], [13973, 13976, "ORG"], [14234, 14237, "STATUTE"], [14239, 14246, "ORG"], [14326, 14329, "ORG"], [14395, 14398, "STATUTE"], [14400, 14407, "ORG"], [14698, 14701, "ORG"], [14847, 14854, "ORG"], [14989, 15001, "DATE"], [15036, 15043, "ORG"], [15069, 15072, "ORG"], [15091, 15098, "ORG"], [15116, 15119, "ORG"], [15181, 15184, "ORG"], [15250, 15257, "ORG"], [15347, 15350, "STATUTE"], [15353, 15356, "ORG"], [15450, 15453, "ORG"], [15501, 15513, "DATE"], [15652, 15655, "ORG"], [15673, 15676, "STATUTE"], [15721, 15728, "ORG"], [15932, 15939, "ORG"], [16008, 16018, "PROVISION"], [16026, 16029, "STATUTE"], [16137, 16147, "PROVISION"], [16186, 16193, "ORG"], [16287, 16297, "PROVISION"], [16344, 16347, "ORG"], [16612, 16615, "STATUTE"], [16621, 16628, "ORG"], [16753, 16760, "ORG"], [16809, 16826, "OTHER_PERSON"], [16921, 16924, "STATUTE"], [17093, 17100, "ORG"], [17135, 17145, "PROVISION"], [17266, 17269, "STATUTE"], [17438, 17441, "ORG"], [17505, 17508, "STATUTE"], [17740, 17751, "OTHER_PERSON"], [17755, 17821, "PRECEDENT"], [18039, 18050, "OTHER_PERSON"], [18066, 18139, "PRECEDENT"], [18167, 18250, "PRECEDENT"], [18913, 18921, "OTHER_PERSON"], [18925, 19043, "PRECEDENT"], [19377, 19388, "OTHER_PERSON"], [21414, 21510, "PRECEDENT"], [21535, 21543, "OTHER_PERSON"], [21570, 21636, "PRECEDENT"], [21714, 21733, "PRECEDENT"], [22170, 22178, "OTHER_PERSON"], [22182, 22201, "PRECEDENT"], [22302, 22394, "PRECEDENT"], [22408, 22459, "PRECEDENT"], [22659, 22724, "PRECEDENT"], [22893, 22900, "OTHER_PERSON"], [22917, 23017, "PRECEDENT"], [23545, 23548, "COURT"], [23643, 23650, "OTHER_PERSON"], [23868, 23871, "STATUTE"], [23907, 23922, "JUDGE"], [23928, 23981, "PRECEDENT"], [24319, 24322, "COURT"], [24433, 24441, "OTHER_PERSON"], [24445, 24468, "PRECEDENT"], [24752, 24822, "PRECEDENT"], [25564, 25571, "ORG"], [25634, 25644, "OTHER_PERSON"], [25713, 25716, "ORG"], [25885, 25888, "ORG"], [25957, 25964, "ORG"], [26014, 26017, "STATUTE"], [26034, 26050, "DATE"], [26063, 26066, "ORG"], [26146, 26149, "COURT"], [26836, 26845, "GPE"], [27468, 27485, "DATE"], [28026, 28041, "OTHER_PERSON"], [28043, 28054, "OTHER_PERSON"], [28056, 28069, "OTHER_PERSON"], [28071, 28083, "OTHER_PERSON"], [28088, 28098, "OTHER_PERSON"], [28118, 28132, "OTHER_PERSON"], [28134, 28148, "OTHER_PERSON"], [28150, 28163, "OTHER_PERSON"], [28165, 28178, "OTHER_PERSON"], [28180, 28194, "OTHER_PERSON"], [28196, 28205, "OTHER_PERSON"], [28207, 28219, "OTHER_PERSON"], [28224, 28234, "OTHER_PERSON"], [28267, 28279, "OTHER_PERSON"], [28384, 28387, "OTHER_PERSON"], [29051, 29058, "OTHER_PERSON"], [29074, 29086, "DATE"], [29197, 29213, "DATE"], [29270, 29277, "ORG"], [29411, 29426, "OTHER_PERSON"], [29428, 29435, "ORG"], [29475, 29482, "ORG"], [29680, 29687, "ORG"], [29703, 29715, "DATE"], [29763, 29778, "OTHER_PERSON"], [30039, 30046, "ORG"], [30140, 30143, "ORG"], [30364, 30376, "DATE"], [30431, 30434, "ORG"], [30546, 30556, "PROVISION"], [30564, 30567, "STATUTE"], [30786, 30801, "OTHER_PERSON"], [30909, 30921, "OTHER_PERSON"], [30969, 30972, "ORG"], [31406, 31421, "OTHER_PERSON"], [31528, 31544, "DATE"], [31627, 31630, "OTHER_PERSON"], [31713, 31720, "ORG"], [31853, 31870, "DATE"], [31872, 31879, "ORG"], [31889, 31892, "ORG"], [32020, 32037, "DATE"], [32076, 32083, "ORG"], [32277, 32284, "ORG"], [32297, 32309, "DATE"], [32346, 32349, "OTHER_PERSON"], [32710, 32726, "DATE"], [32884, 32887, "ORG"], [33081, 33084, "ORG"], [33199, 33202, "ORG"], [33209, 33224, "DATE"], [33433, 33436, "ORG"], [33441, 33444, "ORG"], [33448, 33461, "DATE"], [33593, 33606, "DATE"], [33687, 33694, "ORG"], [33819, 33822, "ORG"], [33906, 33922, "DATE"], [33944, 33947, "ORG"], [34229, 34232, "ORG"], [34250, 34253, "STATUTE"], [34376, 34379, "ORG"], [34470, 34477, "ORG"], [34535, 34538, "ORG"], [34582, 34585, "ORG"], [34718, 34721, "ORG"], [34977, 34980, "ORG"], [35024, 35031, "ORG"], [35069, 35076, "ORG"], [35118, 35132, "OTHER_PERSON"], [35182, 35189, "ORG"], [35218, 35231, "DATE"], [35245, 35248, "ORG"], [35303, 35310, "ORG"], [35338, 35345, "ORG"], [35364, 35367, "ORG"], [35452, 35455, "ORG"], [35635, 35642, "ORG"], [35654, 35657, "ORG"], [35711, 35718, "ORG"], [35759, 35762, "ORG"], [35916, 35919, "ORG"], [36061, 36068, "ORG"], [36256, 36270, "WITNESS"], [36324, 36331, "ORG"], [36469, 36476, "ORG"], [36568, 36575, "ORG"], [36600, 36614, "OTHER_PERSON"], [36659, 36666, "ORG"], [36675, 36678, "ORG"], [36872, 36875, "ORG"], [36879, 36882, "ORG"], [36904, 36907, "ORG"], [36924, 36927, "ORG"], [37133, 37140, "ORG"], [37144, 37147, "ORG"], [37154, 37168, "DATE"], [37189, 37192, "ORG"], [37196, 37199, "ORG"], [37206, 37220, "DATE"], [37245, 37252, "ORG"], [37334, 37337, "ORG"], [37362, 37374, "DATE"], [37404, 37407, "ORG"], [37549, 37552, "ORG"], [37580, 37583, "ORG"], [37596, 37609, "DATE"], [37636, 37639, "ORG"], [37730, 37737, "ORG"], [37841, 37844, "ORG"], [38098, 38105, "ORG"], [38174, 38181, "ORG"], [38373, 38380, "ORG"], [38601, 38604, "COURT"], [38606, 38609, "ORG"], [38786, 38789, "COURT"], [39018, 39025, "ORG"], [39215, 39222, "ORG"], [39325, 39332, "ORG"], [39563, 39570, "ORG"], [39758, 39761, "STATUTE"], [39833, 39836, "STATUTE"], [39872, 39875, "STATUTE"], [39877, 39884, "ORG"], [39966, 39969, "STATUTE"], [40038, 40045, "PROVISION"], [40317, 40320, "STATUTE"], [40322, 40325, "ORG"], [40437, 40440, "ORG"], [40631, 40634, "ORG"], [40918, 40921, "ORG"], [41365, 41368, "COURT"], [41522, 41525, "COURT"], [41538, 41541, "ORG"], [41799, 41802, "STATUTE"], [41835, 41838, "ORG"], [41962, 41970, "OTHER_PERSON"], [41974, 41993, "PRECEDENT"], [42072, 42075, "STATUTE"], [42162, 42165, "ORG"], [42471, 42474, "STATUTE"], [42604, 42607, "STATUTE"], [42622, 42633, "PROVISION"], [42853, 42856, "STATUTE"], [42974, 42977, "STATUTE"], [43000, 43003, "ORG"], [43071, 43078, "ORG"], [43315, 43318, "ORG"], [43476, 43479, "STATUTE"], [43670, 43673, "ORG"], [43730, 43733, "STATUTE"], [43951, 43954, "ORG"], [43998, 44001, "ORG"], [44039, 44049, "PROVISION"], [44057, 44060, "STATUTE"], [44168, 44175, "ORG"], [44179, 44182, "ORG"], [44308, 44315, "ORG"], [44431, 44434, "ORG"], [44765, 44768, "ORG"], [44800, 44807, "ORG"], [44865, 44872, "ORG"], [44932, 44942, "OTHER_PERSON"], [44955, 44962, "ORG"], [45018, 45021, "ORG"], [45111, 45118, "ORG"], [45181, 45188, "ORG"], [45216, 45223, "ORG"], [45254, 45257, "ORG"], [45310, 45313, "ORG"], [45382, 45389, "ORG"], [45444, 45451, "ORG"], [45526, 45529, "ORG"], [45762, 45769, "ORG"], [45883, 45890, "ORG"], [46058, 46065, "ORG"], [46137, 46144, "ORG"], [46248, 46255, "ORG"], [46709, 46716, "ORG"], [46768, 46786, "PROVISION"], [46880, 46890, "PROVISION"], [47411, 47421, "PROVISION"], [47525, 47532, "ORG"], [47652, 47662, "PROVISION"], [47933, 47943, "PROVISION"], [48100, 48108, "OTHER_PERSON"], [48112, 48122, "PRECEDENT"], [48133, 48147, "PROVISION"], [48596, 48604, "OTHER_PERSON"], [48608, 48676, "PRECEDENT"], [48773, 48828, "PRECEDENT"], [49021, 49032, "ORG"], [50291, 50301, "JUDGE"], [50472, 50490, "PROVISION"], [50731, 50747, "DATE"], [50858, 50874, "DATE"], [51773, 51791, "PROVISION"], [51933, 51941, "PETITIONER"], [52171, 52181, "JUDGE"], [52763, 52766, "COURT"], [52825, 52828, "COURT"], [53144, 53147, "STATUTE"], [53323, 53333, "PROVISION"], [53470, 53473, "STATUTE"], [53542, 53552, "PROVISION"], [53620, 53630, "PROVISION"], [53774, 53784, "PROVISION"], [53818, 53821, "ORG"], [53944, 53954, "PROVISION"], [54080, 54083, "STATUTE"], [54195, 54202, "ORG"], [54223, 54233, "PROVISION"], [54291, 54301, "PROVISION"], [54756, 54766, "PROVISION"], [54843, 54850, "ORG"], [54902, 54912, "PROVISION"], [55011, 55018, "ORG"], [55245, 55252, "ORG"], [55383, 55393, "PROVISION"], [55483, 55490, "ORG"], [55540, 55550, "PROVISION"], [55652, 55700, "PRECEDENT"], [55718, 55725, "ORG"], [55875, 55882, "ORG"], [55952, 55962, "OTHER_PERSON"], [55978, 55988, "PROVISION"], [56155, 56165, "PROVISION"], [56209, 56216, "ORG"], [56531, 56549, "PRECEDENT"], [56668, 56678, "PROVISION"], [56895, 56913, "PRECEDENT"], [57436, 57454, "PRECEDENT"], [57987, 57995, "JUDGE"], [58543, 58624, "PRECEDENT"], [58916, 58934, "OTHER_PERSON"], [58967, 59047, "PRECEDENT"], [59782, 59792, "PROVISION"], [60793, 60921, "PRECEDENT"], [61123, 61141, "ORG"], [61146, 61156, "PROVISION"], [61322, 61332, "PROVISION"], [61557, 61567, "PROVISION"], [61585, 61634, "PRECEDENT"], [61637, 61650, "PRECEDENT"], [61703, 61716, "JUDGE"], [61723, 61736, "PRECEDENT"], [62129, 62147, "PRECEDENT"], [62483, 62553, "PRECEDENT"], [62642, 62660, "PRECEDENT"], [62799, 62867, "PRECEDENT"], [63391, 63481, "PRECEDENT"], [63545, 63555, "PROVISION"], [63807, 63825, "PRECEDENT"], [63909, 63919, "PROVISION"], [63966, 63976, "PROVISION"], [64366, 64384, "PRECEDENT"], [64475, 64486, "PROVISION"], [64576, 64586, "PROVISION"], [65140, 65147, "ORG"], [65224, 65231, "ORG"], [65247, 65270, "ORG"]]}
