{"text": "\n\nIN THE COURT OF APPEAL OF THE REPUBLIC OF SINGAPORE\n[2020] SGCA 43\n\nCriminal Appeal No 46 of 2017\nBetween\nSaravanan Chandaram\n\n... Appellant\nAnd\nPublic Prosecutor\n\n... Respondent\nCriminal Motion No 15 of 2018\nBetween\nPublic Prosecutor\n\n... Applicant\nAnd\nSaravanan Chandaram\n\n... Respondent\nIn the matter of Criminal Case No 36 of 2017\nBetween\nPublic Prosecutor\n\nAnd\nSaravanan Chandaram\nJUDGMENT\n\n[Constitutional Law] -- [Equal protection of the law] -- [Equality before the law]\n[Criminal Law] -- [Offences] -- [Statutory offences] -- [Misuse of Drugs Act]\n[Statutory Interpretation] -- [Construction of statute] -- [Definitions] -- [Purposive approach]\nSaravanan Chandaram\nv\nPublic Prosecutor and another matter\n[2020] SGCA 43\n\nCourt of Appeal -- Criminal Appeal No 46 of 2017 and Criminal Motion No 15 of 2018\nSundaresh Menon CJ, Andrew Phang Boon Leong JA and Steven Chong JA\n22 March 2018, 7 May 2019\n29 April 2020 Judgment reserved.\nSundaresh Menon CJ (delivering the judgment of the court):\nIntroduction\n\n1 The present appeal arises out of the prosecution of the appellant, Saravanan Chandaram (\"the Appellant\"), for two separate charges involving the importation of cannabis and cannabis mixture respectively under s 7 of the Misuse of Drugs Act (Cap 185, 2008 Rev Ed) (\"the MDA\", which abbreviation will also denote the corresponding predecessor version of this Act where the context so requires). Ten wrapped bundles were found in the car that the Appellant had driven into Singapore from Malaysia. Each of these bundles was analysed by the Health Sciences Authority (\"the HSA\") and reported to contain both cannabis and cannabis mixture. The determination of the existence of cannabis mixture was made in line with the interpretation of the statutory definition of \"cannabis mixture\" that was laid down in Public Prosecutor v Manogaran s/o R Ramu [1996] 3 SLR(R) 390 (\"Manogaran\"). It was on this basis that the Prosecution preferred one charge of importing cannabis (\"the Importation of Cannabis Charge\") and one charge of importing cannabis mixture (\"the Importation of Cannabis Mixture Charge\") against the Appellant. According to the Prosecution, this is in line with its current charging practice, which may be summarised thus: where a single compressed block of cannabis-related plant material is certified by the HSA as containing (a) cannabis as well as (b) fragmented vegetable matter containing cannabinol (\"CBN\") and tetrahydrocannabinol (\"THC\"), the Prosecution will consider preferring a charge of trafficking in, importing or exporting cannabis in respect of the portion certified by the HSA as consisting purely of cannabis, and a charge of trafficking in, importing or exporting cannabis mixture in respect of the portion consisting of fragmented vegetable matter that, while not specifically certified by the HSA as cannabis, has been found to contain CBN and THC. We refer to this charging practice as the Prosecution's \"Dual Charging Practice\".\n2 This appeal offers us the opportunity to revisit the judicial interpretations of the definition and classification of \"cannabis\" and \"cannabis mixture\" enacted in the MDA, and to determine, in that light, whether the elements of both the Importation of Cannabis Charge and the Importation of Cannabis Mixture Charge have been proved beyond reasonable doubt. We consider this in the light of the testing and analytical procedures and practices adopted by the HSA. Before turning to these issues, we will first address the Appellant's primary case, which is that he believed the ten bundles that he brought into Singapore to contain nothing other than contraband tobacco. We begin with the facts.\nThe undisputed facts\n\n3 The Appellant, a Malaysian citizen who was residing in Malaysia at the material time, was tried and convicted in the High Court of the Importation of Cannabis Charge and the Importation of Cannabis Mixture Charge. These two charges read as follows:\nThat you ...\n[Importation of Cannabis Charge:]\non the 6th day of November 2014, at about 10.40 a.m., at Woodlands Checkpoint, Singapore, did import into Singapore a Class A controlled drug listed in the First Schedule to the [MDA], to wit, by bringing into Singapore ten (10) bundles containing not less than 1383.6 grams of vegetable matter which was analysed and found to be cannabis, without any authorisation under the said Act or the Regulations made thereunder, and you have thereby committed an offence under Section 7 of the [MDA] and punishable under Section 33(1) of the said Act, and alternatively, upon conviction, you may be liable to be punished under Section 33B(1) of the [MDA].\n[Importation of Cannabis Mixture Charge:]\non the 6th day of November 2014, at about 10.40 a.m., at Woodlands Checkpoint, Singapore, did import into Singapore, a Class A controlled drug listed in the First Schedule to the [MDA], to wit, by bringing into Singapore ten (10) bundles containing not less than 3295.7 grams of fragmented vegetable matter which was analysed and found to contain [CBN] and [THC], without any authorisation under the said Act or the Regulations made thereunder, and you have thereby committed an offence under Section 7 of the [MDA] and punishable under Section 33(1) of the said Act, and alternatively, upon conviction, you may be liable to be punished under Section 33B(1) of the [MDA].\n[emphasis in bold in original]\n4 The Appellant was arrested at Woodlands Checkpoint on 6 November 2014 after driving a Malaysian-registered rental car (\"the Car\") from Malaysia into Singapore through the checkpoint. The Car was searched at the checkpoint, and ten bundles, concealed in two areas of the Car, were discovered by the enforcement authorities: six bundles were in the armrest of the left rear passenger seat, and four bundles were in that of the right rear passenger seat. These ten bundles were subsequently reported by the HSA to contain an aggregate of not less than 1,383.6g of cannabis and not less than 3,295.7g of fragmented vegetable matter containing CBN and THC. These bundles are the subject of the two charges brought against the Appellant. The ten bundles that are referred to in each of these charges are the same bundles.\n5 An agreed statement of facts (\"the Statement of Facts\") was tendered at the trial pursuant to s 267(1) of the Criminal Procedure Code (Cap 68, 2012 Rev Ed) (\"the CPC\"). There, it was stated that sometime in August 2014, the Appellant met an unidentified Malaysian man called \"Aya\". The Appellant knew that Aya was a drug syndicate leader in Malaysia who arranged deliveries of drug consignments to Singapore and accepted Aya's offer to employ him as his driver.\n6 On 5 November 2014, the Appellant agreed, at Aya's direction, to deliver ten bundles to a client in Singapore, for which he was to be paid S$5,000. On the witness stand, the Appellant testified that Aya had instructed him to collect the Car from a specified venue in Johor Bahru and then get its windows tinted. The Appellant followed these instructions. Subsequently, he met Aya, who handed him a blue bag containing the ten bundles. Aya allegedly told him that the bundles contained tembakau (meaning tobacco in the Malay language) and were to be concealed in the Car. The Appellant then consumed some methamphetamine with Aya. According to the Appellant, this was the first time he had consumed that drug, and having done so, he felt \"very brave\". On Aya's instructions, the Appellant placed four of the ten bundles in the armrest of the right rear passenger seat and the remaining six bundles in the armrest of the left rear passenger seat. He then parked the Car near his residence and handed the keys of the Car to Aya. The next morning, a relative of Aya handed the keys back to the Appellant, and on Aya's instructions, the Appellant drove the Car to Singapore. The Appellant admitted bringing the ten bundles into Singapore. After entering Singapore, he was to call a Malaysian number to obtain instructions from Aya pertaining to the delivery of the bundles to the intended recipient in Singapore.\n7 After his arrest, two statements were recorded from the Appellant, one under s 22 of the CPC on 6 November 2014, and one under s 23 of the CPC on 7 November 2014.\nThe parties' respective cases at the trial\n\n8 The matter was heard before a High Court Judge (\"the Judge\"). The main dispute at the trial centred on the Appellant's knowledge of the nature of the contents of the ten bundles that he had imported into Singapore. There was no dispute as to the act of importation since the Appellant had admitted bringing these bundles into Singapore.\nThe Appellant's version of the events\n\n9 The Appellant denied knowing that the ten bundles contained controlled drugs. He said that his involvement in the transportation of the ten bundles to Singapore arose out of his need to repay a loan he had obtained from Aya for an operation that his son had to undergo. Aya was willing to have the loan repaid by way of deductions from his salary and presumably from other payments due to him, and he therefore agreed to deliver tembakau. According to the Appellant, Aya had initially asked him to transport controlled drugs to Singapore, but he had declined to do so. He had made it clear to Aya that he would not deliver controlled drugs to Singapore because of the severe penalties for bringing such drugs into Singapore. He claimed that in discussing the delivery of tembakau with Aya, Aya had said to him, \"No problem, even if you get caught, you will serve a few months\". He claimed that in this instance, he had been deceived by Aya into bringing \"ganja\" (meaning cannabis) into Singapore, and that he would never have done so knowingly because he was aware that he could face the death penalty if he were caught. He also claimed that Aya had told him not to open the bundles because the intended customer in Singapore might complain if he received bundles that had been tampered with. Thus, when the officers at Woodlands Checkpoint asked him what was inside the bundles, he replied tembakau because, not having opened the bundles, that was what he thought they contained. We note in passing that the Appellant's claim that he thought he was only transporting contraband tobacco was not reflected in any of his statements, and the first time he was recorded to have advanced this defence was when he was giving evidence at the trial. On the witness stand, the Appellant also changed his position regarding the payment he stood to receive for the delivery, from the sum of S$5,000 stated in the Statement of Facts to a sum of RM2,000, which was around a seventh of the amount that he had initially stated.\nThe Prosecution's case\n\n10 The Prosecution submitted that the presumptions of possession and knowledge under ss 18(1) and 18(2) respectively of the MDA applied and had not been rebutted. We digress to observe that there was no need for the Prosecution to have relied on the presumption of possession under s 18(1) at all, given that the Appellant was in control of the Car and had himself concealed the ten bundles there.\n11 In respect of the Appellant's knowledge of the nature of the drugs in the ten bundles, the Prosecution relied on the presumption under s 18(2) of the MDA and contended that the Appellant had not rebutted this presumption. It submitted that the Appellant's bare defence that he thought he was only bringing contraband tobacco into Singapore was not credible or believable, having regard to all the circumstances, including these: (a) the Appellant was to be paid a disproportionately high sum of S$5,000 for making the delivery, which was much higher than the typical sale price of ten bundles of tobacco; (b) the delivery was arranged at short notice despite there being no apparent reason for any urgency; (c) the Car was rented for this purpose, its windows were tinted and the ten bundles were then concealed in it, evidencing the considerable lengths that the Appellant went to in order to evade detection or, at least, conceal the true nature of the venture; (d) parts of the contents of the ten bundles were clearly visible to the Appellant, and the Appellant had admitted to being able to distinguish between cannabis and tobacco by sight; (e) the Appellant had no reason to trust or accept any assertion by Aya as to the contents of the bundles because they had only met about three months earlier, their relationship was confined to the work the Appellant did for Aya, and anything that Aya told the Appellant in relation to making deliveries in covert circumstances had to be seen in the light of the fact that the Appellant knew that Aya was a drug dealer; and (f) the fact that the Appellant had seen bundles of tobacco packed in a broadly similar way on a previous occasion could not have given rise to a belief that the ten bundles that he was to bring into Singapore merely contained tobacco. In all the circumstances, the Appellant's claim that he genuinely believed he was transporting nothing other than contraband tobacco was simply unbelievable.\n12 The Prosecution also pointed out that the Appellant had admitted to knowing that he was transporting drugs in his contemporaneous and his cautioned statements. In his contemporaneous statement, which was recorded in Malay, the Appellant said that \"[d]rugs were found\" in the Car; and in his cautioned statement, which was recorded in English, the Appellant stated that he \"admit[ted] to bringing drugs into Singapore\". The Prosecution submitted that this belied the Appellant's claim that he in fact believed the ten bundles only contained contraband tobacco. In response to the Appellant's claim that he had been suffering from drug withdrawal symptoms at the time the statements were recorded and that he was not conversant in the languages used to record the statements, the Prosecution contended that these claims were baseless and should be rejected. The Appellant also claimed that he had identified the contents of the ten bundles as drugs in his statements only because the Central Narcotics Bureau (\"CNB\") officers had torn open two of the bundles and informed him that drugs were found. The Prosecution pointed out that contrary to this assertion, there were no signs of tampering of the bundles and none of the bundles had been torn open. Further, the Appellant could not identify the CNB officers who had allegedly said or done any of this.\n13 The Prosecution also urged the Judge to draw an adverse inference against the Appellant pursuant to s 261(1) of the CPC because he had failed to state in any of his statements the defence that he later attempted to run.\nThe Defence's case\n\n14 The Defence, on the other hand, submitted at the trial that the presumption of knowledge under s 18(2) of the MDA had been successfully rebutted. The crux of the case for the Defence was that the Appellant believed he was only transporting contraband tobacco, having relied on assurances that he claimed to have received from Aya that he would not be tasked to transport controlled drugs. The Appellant claimed that he could reasonably trust and believe what Aya told him. The Defence maintained that the Appellant did not of his own accord state that the ten bundles contained drugs, and that he had used the word \"drugs\" in his statements only because the CNB officers had informed him that the bundles contained drugs. The Appellant also claimed that he could not see through the wrapping of the bundles to discern what was in them. The Defence contended that the Appellant's version of the events should be preferred as he was a truthful and consistent witness.\nThe decision below\n\n15 After examining the evidence, the Judge convicted the Appellant of both charges. The Judge was satisfied that the Appellant was a mere courier, and as the Public Prosecutor had issued him with a Certificate of Substantive Assistance, the Judge sentenced him under s 33B(1)(a) of the MDA to life imprisonment and the minimum 15 strokes of the cane per charge, resulting in an aggregate sentence of life imprisonment and the statutory maximum of 24 strokes of the cane under s 328(6) of the CPC: see Public Prosecutor v Saravanan Chandaram [2017] SGHC 262 (\"GD\") at [80].\n16 On the law, the Judge held at [34] of the GD that to establish the offence of importation under s 7 of the MDA, the Prosecution had to prove that: (a) the accused person brought the drugs into Singapore; (b) knowing that he was doing so, or intending to do so (citing Ng Kwok Chun and another v Public Prosecutor [1992] 3 SLR(R) 256 at [39]). The second element required the Prosecution to establish that the accused person knew the nature of what he was importing. On the facts, the act of importation was not in issue, and the Defence did not dispute the type of drugs found in the ten bundles. In particular, the drug analysis by the HSA, the chain of custody of the bundles and the integrity of the HSA's testing process were all not challenged (at [27]).\n17 What was disputed was whether the Appellant knew that the ten bundles contained cannabis and cannabis mixture. As the Prosecution relied on the presumption of knowledge under s 18(2) of the MDA, it was for the Appellant to establish that he did not in fact know the nature of the drugs (at [28]). Having considered the evidence, the Judge found that the presumption under s 18(2) had not been rebutted (at [40]-[54]).\n18 The Judge went further and found that the Appellant had actual knowledge that he was carrying cannabis and cannabis mixture (at [37] and [63]). For the purpose of his analysis, the Judge proceeded on the basis of the Defence's contention that the Appellant's use of the word \"drugs\" in his contemporaneous and his cautioned statements flowed from what he had been shown or told by the CNB officers (at [30] and [75]). The Judge therefore did not place weight on these statements insofar as they were relied upon to show the Appellant's knowledge of the nature of the drugs in the ten bundles at the material time (at [75]). However, this did not affect the Judge's conclusion on the issue of actual knowledge.\n19 The Judge found on the basis of the following facts and evidence that the Appellant actually knew that he was carrying cannabis and cannabis mixture:\n(a) There was insufficient basis to believe that the Appellant truly trusted Aya. The Appellant's relationship with Aya was short, and given that the Appellant knew about Aya's involvement in smuggling drugs, he must have been wary of any assurances given by Aya to the effect that the delivery he was being asked to make did not involve drugs. Moreover, the Appellant testified that Aya had initially asked him to transport drugs to Singapore but he had declined to do so. He had then allegedly been asked to deliver contraband tobacco instead. In these circumstances, the Appellant's contention that he genuinely believed he was transporting something other than drugs was not believable (at [31] and [48]).\n(b) There were many opportunities for the Appellant to check and verify the contents of the ten bundles with Aya, but he evidently did not do so despite the circumstances pointing against his belief that the bundles contained contraband tobacco rather than drugs (at [33] and [49]).\n(c) The other surrounding circumstances, including the Appellant's lack of control over the Car and its contents on the night prior to his departure for Singapore, the measures taken in respect of the Car such as the fact that it was rented and its windows then had to be tinted, and the concealment of the ten bundles in the Car's armrests, should all have raised further concerns. The reward of S$5,000 for delivering the ten bundles, which was \"significantly higher\" than the sale value of the quantity of tobacco that could be contained in the bundles, was seriously problematic because it wholly undermined the Appellant's claim that he believed the ten bundles contained nothing other than contraband tobacco. Even if the reward were RM2,000 instead, it was still a significant amount for delivering tobacco that, on the Appellant's own evidence, was supposedly worth RM7,000 (at [32], [51] and [58]). The amount of effort undertaken in preparation for the delivery was implausible and disproportionate if it had truly been for the smuggling of contraband tobacco only (at [58]).\n(d) The Appellant failed to mention in any of his statements the version of the events that he advanced at the trial. This gave rise to the inference that that version of the events was not the truth but merely an afterthought (at [52] and [53]).\n(e) Having rejected the case for the Defence, the Judge found that what was left was only the version of the events put forward by the Prosecution, namely, that the Appellant knew he was carrying Class A controlled drugs into Singapore (at [61]).\n20 For the same reasons, the Judge found that the Appellant had failed to rebut the presumption under s 18(2) of the MDA that he knew the nature of the drugs in the ten bundles (at [54]; see also [17] above).\n21 For the purpose of sentencing, as we noted at [15] above, the Appellant was eligible to be and was in fact sentenced under s 33B(1)(a) of the MDA to imprisonment for life and 24 strokes of the cane, instead of to capital punishment (at [78]).\nThe appeal\n\n22 The Appellant appealed against both his conviction and his sentence. The focus of his appeal was on his knowledge of the nature of the drugs in the ten bundles. He again contended that his relationship with Aya was one rooted in trust. Relying on our judgment in Harven a/l Segar v Public Prosecutor [2017] 1 SLR 771 (\"Harven\"), the Appellant submitted that in considering whether there was such a relationship of trust, the court was required to go beyond the duration of the relationship and consider all the surrounding facts and circumstances. In this connection, he highlighted the fact that Aya had given him a job and lent him money for his son's operation. He claimed in turn to have earned Aya's trust and to have even become his bodyguard. Thus, he could reasonably trust Aya's assurance that he would only be transporting contraband tobacco to Singapore. He argued that the intended recipient of the bundles, who was also arrested, ought to have been called by the Prosecution and could have given evidence that the bundles were meant to contain tobacco.\n23 The Appellant also submitted that the suspicious circumstances relied on by the Judge were not in fact suspicious from his perspective. He claimed that Aya had kept the keys to the Car overnight on the night of 5 November 2014 because he had previously misused Aya's cars for his own purposes, and therefore, Aya's keeping of the keys overnight did not strike him as odd. Further, it was not the first time that he had been asked to rent a car for Aya's use, and the tinting of the Car's windows did not arouse any suspicion because he believed that he would be transporting contraband tobacco, which would necessitate the taking of some concealing measures. He also claimed that the Car was tinted primarily for Aya's private use and not for the delivery trip. In addition, he repeated his claim that the payment of S$5,000 for making the delivery, which was the amount stated in the Statement of Facts, was incorrect, and that he was in fact supposed to receive just RM2,000.\n24 The Prosecution, on the other hand, defended the Judge's decision and relied on the reasons that led him to conclude that the Appellant had actual knowledge of the nature of the drugs in the ten bundles, and that, in any case, the presumption of knowledge under s 18(2) of the MDA had not been rebutted.\nOur decision on the Importation of Cannabis Charge\n\n25 We heard the parties on 22 March 2018, and dismissed the Appellant's appeal against his conviction on the Importation of Cannabis Charge at the end of that hearing because we did not find his claims plausible for the following reasons.\nActual knowledge\n\n26 We start with the Judge's finding that the Appellant had actual knowledge that the ten bundles that he imported into Singapore contained drugs (meaning, for the purpose of this charge, cannabis) (GD at [55]-[61]). The Judge found that \"the evidence disclosed showed actual knowledge, including wilful blindness\" (GD at [37]). In his view, the deficiencies in the Appellant's evidence which led him to conclude that the Appellant had failed to rebut the presumption of knowledge under s 18(2) of the MDA were also grounds for finding actual knowledge on the Appellant's part (GD at [55]). The Judge held that the Appellant, knowing that there was contraband in the Car, had failed to raise a reasonable doubt as to his knowledge of the nature of that contraband (GD at [60]). Having rejected the Appellant's version of the events, the Judge observed that that left only the version put forward by the Prosecution, namely, that the Appellant knew he was carrying Class A controlled drugs into Singapore (GD at [61]; see also [19(e)] above).\n27 In his analysis, the Judge seemed to conflate the treatment of actual knowledge, wilful blindness in the extended sense outlined at [28] below and the rebuttal of the s 18(2) presumption. This was unsatisfactory, although we recognise that he did not have the benefit of the analytical framework on wilful blindness set out in our decision in Adili Chibuike Ejike v Public Prosecutor [2019] 2 SLR 254 (\"Adili\"), which was issued only after the Appellant had been convicted and sentenced.\n28 In Adili, we held that wilful blindness has been used in two distinct senses, namely, in the evidential sense and in the extended sense (at [44] and [50]). The evidential conception of the term is \"in truth nothing more than a convenient shorthand for an inference that the accused person actually knew that which he is accused of knowing\" [emphasis in original] (at [45]). In contrast, the extended conception of the term extends the element of knowledge beyond actual knowledge to the point where \"it can almost be said\" [emphasis in original] that the accused person actually knew the fact in question (at [47] and [50]). In short, the extended conception covers a case where an accused person does not in fact know the true position, but sufficiently suspects what it is and deliberately refuses to investigate in order to avoid confirmation of his own suspicions. In Adili, we held that such an accused person should, in certain circumstances, be treated as though he did know the true position (at [47]).\n29 In our judgment, the reasons that the Judge relied on in finding that the Appellant had actual knowledge of the nature of the drugs in the ten bundles that he brought into Singapore (see above at [19]) did not in fact afford a basis for such a finding. Rather, the Judge's reasoning entailed finding weaknesses in the Appellant's contentions, which together provided a patchwork of suspicious circumstances. These, in our respectful view, could not suffice in and of themselves to prove actual knowledge. After all, it is incumbent on the Prosecution to prove the fact of actual knowledge. Unless the Prosecution is relying on the presumption of knowledge under s 18(2) of the MDA, which would entail a separate analysis altogether, it cannot rely on the Defence's failure to prove the accused person's ignorance of a relevant fact, to thereby say that the Prosecution has discharged its burden to prove the accused person's knowledge of that fact. This just does not follow, and it also has the effect of shifting the burden of proof impermissibly. This was where, with respect, the Judge fell into error when he observed (at [61] of the GD) that because he rejected the Appellant's version of the events, that left only the version advanced by the Prosecution. That might be so, but if the case against the Appellant rested on actual knowledge, such knowledge still had to be proved by the Prosecution. In this regard, we note that at the trial, the Prosecution only relied on the s 18(2) presumption and the Appellant's failure to rebut this presumption. The Judge nevertheless found that the Appellant had actual knowledge of the nature of the drugs in the ten bundles that he brought into Singapore and relied on that finding as an additional basis for convicting the Appellant.\n30 As to the patchwork of suspicious circumstances arising from the weaknesses in the Appellant's case, these went towards proving wilful blindness in the extended conception. That could have been a basis upon which the Appellant's conviction could rest, but we prefer not to rely on it in this case because in Adili, we left open the interplay between wilful blindness and the presumption of knowledge under s 18(2) of the MDA, and we prefer to address that on a subsequent occasion where it is necessary for us to do so (see Adili at [42], [62] and [67]-[69]).\nThe presumption of knowledge under s 18(2) of the MDA\n\n31 Instead, we agree with the Judge's alternative finding that the Appellant had failed to rebut the s 18(2) presumption that he had actual knowledge of the nature of the drugs in the ten bundles that he brought into Singapore. Under s 18(2), \"[a]ny person who is proved or presumed to have had a controlled drug in his possession shall, until the contrary is proved, be presumed to have known the nature of that drug\".\n32 In Obeng Comfort v Public Prosecutor [2017] 1 SLR 633 (\"Obeng\"), we set out the principles on the application of the presumption under s 18(2). When this presumption applies, the accused person stands before the court presumed to have known the nature of the drug that he was carrying, and if he leads no or inadequate evidence to rebut the presumption, he can be convicted (at [38]).\n33 We also said in Obeng that, as a matter of common sense and practical application, where the accused person seeks to rebut the presumption of knowledge under s 18(2), he ought to be able to say what he thought or believed he was carrying. It would not suffice in such circumstances for the accused person simply to claim that he did not know what he was carrying, save that he did not think it was drugs. The presumption under s 18(2) operates to vest the accused person with knowledge of the nature of the drug of which he is in possession, and to rebut this, he must give an account of what he thought the item in his possession was (at [39]).\n34 Where the accused person has stated what he thought that item was, the court will assess the veracity of his assertion against the objective facts and examine his actions relating to the item in that light (at [40]). This assessment will naturally be a highly fact-specific inquiry, and the court will consider factors such as the nature, the value and the quantity of the item and any reward for transporting it (at [40]).\n35 We turn to apply the principles articulated in Obeng to the present facts. The Appellant's contention is that he thought he was only transporting contraband tobacco. Any assessment of the credibility of this claim must be undertaken in the light of the following facts, which the Appellant accepted were true. Viewed in that light, the Appellant's claim was, in our judgment, simply incredible, as we will explain below:\n(a) The Appellant knew of Aya's drug activities, and also knew that Aya was, in his own words, a \"drug boss\". He had also previously helped Aya to collect \"drugs money\" from his clients.\n(b) The Appellant knew that he would be transporting contraband items to Singapore (GD at [60]). Aya had initially asked him to transport drugs, which he had ostensibly refused to do. His claim that Aya then asked him to transport contraband tobacco instead seemed a glib and convenient way to explain how his purported resistance to transporting drugs was overcome.\n(c) The Appellant admitted to having been \"scared\" prior to the delivery, as a result of which he consumed methamphetamine \"to feel brave\". This was something he had not felt the need to do when he collected \"drug and illegal tobacco money\" for Aya on previous occasions.\n(d) The Appellant was to be paid a large sum for transporting the ten bundles to Singapore, which would have been wholly disproportionate if the task had entailed transporting only contraband tobacco. The Statement of Facts indicated that the monetary reward was S$5,000, which the Appellant later said was incorrect, but even the sum of RM2,000 that was later put forth by the Appellant at the trial wholly undermined the economics of a deal that purportedly involved tobacco that, on the Appellant's own evidence, was worth at most RM7,000.\n(e) The Appellant claimed that he knew of the harsh penalties for drug trafficking under Singapore law, and said that because of this, he would not knowingly have brought controlled drugs into Singapore. If this were indeed a genuine concern, then, in our judgment, he would have considered most carefully Aya's purported assurance that he would only be transporting contraband tobacco to Singapore, especially given what he knew about Aya.\n(f) The various steps that the Appellant took, under Aya's directions, to avoid detection, including renting the Car, tinting its windows and concealing the ten bundles in its armrests, all made it implausible that such elaborate arrangements would be undertaken for a transaction involving just the delivery of contraband tobacco. While it was possible that a person seeking to traffic in contraband tobacco might resort to some of these measures, seen in the totality of all the circumstances, including the Appellant's knowledge of Aya's work as a \"drug boss\", his unconvincing attempt to change his case on several points during the trial and his failure to mention in his statements his defence that he believed he was only transporting contraband tobacco, it was simply not believable that he genuinely thought he was merely transporting contraband tobacco.\n36 We specifically find the Appellant's contention that he trusted Aya and relied on his assurance that the ten bundles did not contain illicit drugs incredible. We begin with the observation that any finding that an accused person believed the assurance of another person as to what he would be transporting for and at the request of that person because he trusted that person will invariably be highly dependent on the entirety of the context in which the assurance was given. We illustrate this by reference to the facts in Harven ([22] supra), which was relied on by the Appellant and which, in our judgment, can be readily distinguished from the present case. In Harven, the accused person, who lived in Johor Bahru and travelled to Singapore daily to work, was found in possession of drugs. He contended that his colleague, who likewise lived in Johor Bahru and whom he had known for just three weeks, had asked him to deliver a package to a friend in Singapore as a favour, and he had agreed to do so because he never thought there was anything sinister in the request. While we accepted his claim, it is important to note the context in which this transpired. In truth, Harven was not so much a case that rested on the trust placed by the accused person in the person who had asked him to transport what turned out to be drugs, as a case where the accused person had no reason to suspect that anything was amiss. On the face of it, the accused person in Harven had been asked to do an innocuous favour - namely, to deliver something to a friend in Singapore - by a colleague whom he had no reason to think was involved in illicit activities, without mention of any reward for doing the favour (at [64]). This much was never challenged by the Prosecution, and we found the absence of any discussion or contemplation of any payment or benefit for carrying out the \"favour\" to be strongly exculpatory. It is generally not in the nature of drug dealers to do favours for one another, especially in the context of a lucrative trade that carries high risks of detection and severe punishment. The accused person in Harven also explained that his colleague's request had seemed to him to be routine and innocuous because his colleague had told him that he had lost his passport and was temporarily unable to enter Singapore himself (at [26]).\n37 In contrast to the facts in Harven, the circumstances in which the Appellant had come to know Aya and what he knew about Aya are considerably more important than the length of his relationship with Aya. These circumstances include: (a) his knowledge that Aya was a drug dealer; (b) the fact that he himself had previously done jobs for Aya in connection with Aya's drug deals, including collecting payments for Aya; and (c) the very substantial monetary reward that was promised to him for bringing the ten bundles into Singapore. When one examines the nature of the relationship between the Appellant and Aya, it becomes evident that the Appellant only came to know Aya through \"a friend's friend\", and did not even know Aya's actual name. In truth, their relationship was confined to the work that the Appellant did for Aya. Taking the Appellant's case at its highest, the fact that Aya had lent him RM4,000 for his son's operation and offered him a livelihood simply did not change the analysis. These might be factors that disposed the Appellant to feel beholden to do what Aya asked him to do. However, they did not advance his case that he would therefore accept whatever Aya told him as true, regardless of how implausible it was, especially in the light of his knowledge of Aya's drug dealing activities and his professed concerns over the harsh penalties facing drug traffickers under Singapore law.\n38 In these circumstances, when Aya asked the Appellant to deliver the ten bundles to a recipient in Singapore in highly suspicious circumstances and purportedly told the Appellant that the bundles only contained contraband tobacco, it was simply incredible that the Appellant would accept this at face value. We therefore do not accept the Appellant's contention that he believed he was merely transporting contraband tobacco.\n39 As a separate point, the Appellant was familiar with illicit drugs, admitted to having consumed methamphetamine with Aya on 5 November 2014 (see [6] above) and testified that he would have been able to tell by sight whether the ten bundles contained cannabis or tobacco if he had checked their contents. Given what the Appellant had said about how worried he supposedly was about being involved in drug trafficking activities because of the harsh penalties facing drug traffickers under Singapore law, we find it incredible that he would not have checked the ten bundles if his claim that Aya had told him they contained contraband tobacco is indeed to be believed.\n40 Finally, we deal with a stray point that was raised in the course of the arguments, namely, that the Appellant should be believed because the Prosecution failed to adduce the evidence of the intended recipient of the ten bundles as to what he had been expecting to receive (see [22] above). We are not persuaded by this argument. In our judgment, the question in this context is whether the Appellant's case has sufficient weight such that it shifts the evidential burden to the Prosecution to rebut his claim that he believed he was merely transporting contraband tobacco. Where an accused person's defence is patently and inherently incredible to begin with, his defence would not have properly come into issue at all, and there would be no question of the Prosecution having any evidential burden to call material witnesses to rebut his defence (see Muhammad Nabill bin Mohd Fuad v Public Prosecutor [2020] SGCA 25 at [70]-[71]). In the present case, because the Appellant's claim that he thought he was only transporting contraband tobacco is incredible for the reasons outlined above, the evidential burden has not shifted to the Prosecution to rebut his claim. It follows that the Prosecution's failure to call the intended recipient of the ten bundles as a witness is not material, and the presumption of knowledge under s 18(2) of the MDA remains unrebutted.\n41 In the circumstances, the Judge was correct to convict the Appellant of the Importation of Cannabis Charge based on his failure to rebut the s 18(2) presumption. We therefore dismissed the Appellant's appeal against his conviction on this charge at the end of the hearing before this court on 22 March 2018.\nOur decision on the Importation of Cannabis Mixture Charge\n\n42 We turn now to the Importation of Cannabis Mixture Charge. This concerned the 3,295.7g of fragmented vegetable matter that was analysed by the HSA and found to contain CBN and THC. In analysing this charge, we had to determine the correct interpretation of the definition of \"cannabis\" and \"cannabis mixture\" set out in s 2 of the MDA, the appropriate sentencing framework for the offences of trafficking in, importing and exporting cannabis mixture and the constitutionality of the current sentencing framework for these offences. To this end, we asked the Prosecution to address the following questions at the hearing on 22 March 2018, and in due course, Professor Kumaralingam Amirthalingam (\"Prof Amirthalingam\") was appointed as amicus curiae to address the same questions:\n(a) The MDA differentiates between \"cannabis\", \"tetrahydrocannabinol\" and \"cannabinol\". What is the distinction between these three controlled drugs?\n(b) Section 2 of the MDA defines \"cannabis mixture\" as \"any mixture of vegetable matter containing [THC] and [CBN] in any quantity\". It also defines \"cannabis resin\" as \"any substance containing resinous material and in which is found [THC] and [CBN] in any quantity\". Is the HSA able to ascertain and certify the precise quantity of THC and CBN contained in a given lot of cannabis mixture/resin?\n(c) If the HSA is able to do so, should the sentencing approach to the offences of trafficking in and importing cannabis mixture/resin take into account the amount of THC and CBN contained therein (as opposed to the gross weight of the cannabis mixture/resin)? How should the amount of THC and CBN factor in sentencing?\nIf the HSA is unable to do so, should the sentencing approach be calibrated to take into account the possibility that the amount of THC and CBN contained in a given lot of cannabis mixture/resin might be small or large? If so, how should the sentencing approach be calibrated?\n(d) The Second Schedule to the MDA sets out the sentencing bands for the offences of trafficking in and importing cannabis mixture/resin according to the gross weight of the cannabis mixture/resin concerned. These sentencing bands are not contingent on the amount of THC and CBN in the cannabis mixture/resin. Accordingly:\n(i) Two persons who traffic in or import cannabis mixture/resin of the same gross weight but containing different amounts of THC and CBN are liable to be subject to the same sentencing bands under the Second Schedule to the MDA.\n(ii) Two persons who traffic in or import cannabis mixture/resin of different gross weights but containing the same amount of THC and CBN are liable to be treated differently under the Second Schedule to the MDA.\nTaking the above into consideration, does the sentencing framework under the Second Schedule to the MDA raise constitutional issues in relation to the provision on equal protection in Art 12(1) of the Constitution of the Republic of Singapore (1985 Rev Ed, 1999 Reprint) (\"the Constitution\")?\n43 In response to our questions, the Prosecution tendered an affidavit dated 20 June 2018 of Dr Yap Tiong Whei, Angeline (\"Dr Yap\"), the Assistant Group Director of the HSA's Forensic Science, Applied Sciences Group, and the Division Director of the HSA's Illicit Drugs Division, Applied Sciences Group. The Prosecution also filed CA/CM 15/2018 to admit the affidavit dated 22 June 2018 of Deputy Superintendent Qamarul Zaman Bin Hussin (\"Deputy Supt Qamarul\") of the CNB, in which he testified on aspects of how illicit cannabis is sold in Singapore. We allowed this criminal motion.\n44 After hearing the parties and the learned amicus curiae on 7 May 2019, we invited submissions on some further questions:\n(a) Is the HSA prepared to certify that the fragments in a particular cannabis mixture are unadulterated cannabis?\n(b) Is it the case that only cannabis plant branches with leaves, flowers or fruits attached will be treated by the HSA as cannabis, and that cannabis plant parts such as leaves, flowers and fruits, once detached from branches, will be treated by the HSA as cannabis mixture (whether or not these detached plant parts are fragmented)?\nIf the answer to the question is yes, can Dr Yap clarify whether her statement in court on 7 May 2019, suggesting that what are believed to be extracts from the cannabis plant will only be treated as cannabis mixture where the plant fragments are too small to be conclusively established as extracts from the cannabis plant, should be modified?\n(c) Is it constitutional to set sentencing ranges for the offences of trafficking in and importing cannabis mixture based on the gross weight of the cannabis mixture concerned if the components of the mixture cannot be quantified?\n45 A further issue arose during the hearing on 7 May 2019 as to whether the Importation of Cannabis Mixture Charge was permissible as a separate charge notwithstanding the fact that the subject matter of this charge consisted of the very same bundles that gave rise to the subject matter of the Importation of Cannabis Charge. We framed the question in these terms: whether the Prosecution may prefer two separate charges of dealing in cannabis and cannabis mixture respectively in relation to a single block of compressed cannabis-related plant material of the kind typically encountered by the HSA. The learned amicus curiae, Prof Amirthalingam, helpfully responded to the Prosecution's further submissions on this latter question. Dr Yap too filed three further affidavits dated 18 September 2018, 28 June 2019 and 2 September 2019 respectively.\n46 In this regard, we wish to state how deeply grateful we are to Prof Amirthalingam for the meticulous and thoroughly researched submissions that he furnished for our consideration. We are also most grateful to Dr Yap for her detailed explanations of the scientific process involved in the tests carried out by the HSA to analyse plant matter for the presence of cannabis and cannabis mixture.\nThe issues raised and our analytical approach\n\n47 In order to determine whether the Importation of Cannabis Mixture Charge could be established, and if so, the appropriate sentence to be imposed on the Appellant for this charge, it was necessary for us to first consider a number of sub-issues pertaining to three broad issues which arose for our determination in this appeal. We outline below these broad issues and the corresponding sub-issues, as well as the approach that we will take in this judgment to resolve them.\n48 The first broad issue pertains to the definition of \"cannabis\" and \"cannabis mixture\" in s 2 of the MDA. This requires us to examine the competing interpretations of the statutory definition of \"cannabis mixture\" applied by this court in Abdul Raman bin Yusof and another v Public Prosecutor [1996] 2 SLR(R) 538 (\"Abdul Raman\") and in Manogaran ([1] supra), which we now set out in brief to provide the relevant context. We will discuss these competing interpretations in greater detail below.\n49 In Abdul Raman (at [32]), this court determined that \"cannabis mixture\" must mean a mixture of two or more distinct types of vegetable matter. In Manogaran, this court overturned the ruling in Abdul Raman and held that the term \"cannabis mixture\" had two meanings - a primary meaning and an extended meaning. It held that the primary meaning was \"an unadulterated mixture of vegetable matter of entirely cannabis origin\" (at [43]), while the extended meaning contemplated \"the co-existence of vegetable matter of cannabis origin as well as non-cannabis vegetable matter\" (at [45]). The court held that Abdul Raman mistakenly confined the meaning of \"cannabis mixture\" to only the extended meaning. The question that needs to be answered by us in this appeal is whether the term \"cannabis mixture\" should be confined only to the extended meaning (as was held in Abdul Raman), or whether it should also encompass the primary meaning (which would include a mixture of various parts of a cannabis plant, as was held in Manogaran at [43]). In coming to our decision, a purposive interpretation of the definition of \"cannabis mixture\" in s 2 of the MDA will be undertaken applying the three-step framework on statutory interpretation set out in Tan Cheng Bock v Attorney-General [2017] 2 SLR 850 (\"Tan Cheng Bock\"). We will further consider whether the definition of \"cannabis mixture\" should be confined to vegetable matter consisting of components that cannot be easily distinguished or separated from each other.\n50 Having determined the correct interpretation of the statutory definition of \"cannabis\" and \"cannabis mixture\", the second broad issue pertains to the applicable sentencing framework for the offences of trafficking in, importing and exporting cannabis mixture. There are three sub-issues to be explored:\n(a) First, we will determine whether cannabis mixture should be classified as a Class A controlled drug or a non-Class A controlled drug. It is crucial to examine which classification is the correct one, given its consequences on the question of sentencing.\n(b) Second, we will examine whether it is correct and appropriate to calibrate the sentences for the offences of trafficking in, importing and exporting cannabis mixture according to the gross weight of the cannabis mixture concerned. In this regard, we will examine: (i) whether calibrating the sentences according to the gross weight of the cannabis mixture is supported by the MDA; and (ii) whether the sentencing framework should also take into account the amount of THC and CBN contained in the cannabis mixture.\n(c) Third, we will consider whether calibrating the sentences according to the gross weight of the cannabis mixture violates Art 12 of the Constitution. This issue arises because cannabis mixtures of the same gross weight but with different proportions of cannabis could attract the same sentence.\n51 The third broad issue that arises pertains to whether the Importation of Cannabis Mixture Charge can be made out in the light of the manner in which a block of cannabis-related plant material is dealt with in the course of the HSA's testing and certification process. Before addressing that issue, it would be helpful to provide some context on the HSA's practice. The most important point to note is that in the course of the HSA's testing and certification process, vegetable fragments are generated as the HSA analyst breaks up the block of plant material into three parts: individual plant branches, fragments of plant parts and observable extraneous matter. In short, some of what are treated as vegetable fragments distinct from the pure cannabis only come into existence as a result of the HSA's testing procedure. The problem with bringing a separate charge in respect of the vegetable fragments and treating them as cannabis mixture is that these fragments existed in a different form at the time of trafficking, importation or exportation (as the case may be), and it appears that the change of form may affect the classification of these fragments as either cannabis or cannabis mixture. It is the fragmentation that occurs in the course of the HSA's testing process, which might never have been intended by the accused person, that gives rise to the possibility of two separate charges - one pertaining to cannabis and the other, cannabis mixture - being filed in respect of a single block of cannabis-related plant material, and that might then in turn give rise to the possibility of consecutive sentences being meted out to the accused person. In the light of this situation, the following sub-issues arise:\n(a) The first sub-issue is whether the by-product of the HSA's testing process can be said to fall within the definition of \"cannabis mixture\".\n(b) The second sub-issue pertains to the Prosecution's Dual Charging Practice, which we outlined earlier at [1] above. In respect of a single compressed block of cannabis-related plant material that is found to contain (i) cannabis as well as (ii) fragmented vegetable matter containing CBN and THC (which cannot be certified as cannabis by the HSA), can two separate charges of trafficking in, importing or exporting cannabis and trafficking in, importing or exporting cannabis mixture be pressed by the Prosecution? If not, what are the charging options for the Prosecution?\n52 We turn to consider each of these issues in sequence.\nIssue 1: The definition of \"cannabis\" and \"cannabis mixture\"\n\n53 The first issue, as we mentioned at [48] above, concerns the interpretation of the statutory definition of \"cannabis\" and \"cannabis mixture\".\n54 The terms \"cannabis\" and \"cannabis mixture\" are defined in s 2 of the MDA as follows:\n(a) \"cannabis\" is \"any part of a plant of the genus Cannabis, or any part of such plant, by whatever name it is called\"; and\n(b) \"cannabis mixture\" is \"any mixture of vegetable matter containing [THC] and [CBN] in any quantity\".\n55 Dr Yap testified that THC is the psychoactive compound in the cannabis plant that is responsible for its pharmacological properties and the effects associated with the abuse of cannabis. THC is primarily present in its acidic form, tetrahydrocannabinolic acid (\"THCA\"). THCA converts to THC when cannabis is harvested and dried, or when cannabis is exposed to heat or light. THC is unstable and further converts to CBN when cannabis is kept for a period of time, a phenomenon that is accelerated by the presence of heat or light. CBN is a non-psychoactive compound. There are no plants, other than cannabis, that are known to contain THC and CBN naturally, but THC and CBN can be synthesised, and synthesised THC and CBN are chemically identical to their naturally occurring counterparts.\nThe HSA's practice in certifying cannabis and cannabis mixture\n\n56 To provide some context, we think it helpful to first understand the process that the HSA applies when it undertakes to test and certify cannabis and cannabis mixture. Following our decision in Manogaran ([1] supra), the HSA adopted a comprehensive testing mechanism for the certification of cannabis and cannabis mixture which, as Dr Yap explained to us, may be summarised in the following flowchart:\n(1) Weighing of the block of cannabis-related plant material\n\n57 First, upon receiving a block of compressed cannabis-related plant material, the HSA analyst weighs the entire block to determine its gross weight.\n(2) Separation of the block into three groups\n\n58 Thereafter, the HSA analyst proceeds to prise the block apart, with a screwdriver if necessary, in order to examine the plant material, and it is then separated into three groups:\n(a) Individual plant branches (\"Group 1\"): these are typically plant branches ranging from about 2cm to 15cm in length.\n(b) Fragments of plant parts (\"Group 2\"): these are obtained when small plant parts break off from the plant branches during the separation process due to their dry and brittle state as well as their highly compressed form. The fragments obtained will generally be less than 2cm long and can be as small as half a millimetre.\n(c) Observable extraneous matter (\"Group 3\"): namely, distinct non-cannabis vegetable matter (such as a hibiscus leaf), plastic pieces, foil and string, all of which, if present, are separated. The weight of these items are measured separately and discounted altogether when computing the weight of the cannabis or the cannabis mixture concerned.\n(3) Examination of the plant material\n\n59 Up to three independent and conjunctive tests are conducted in the course of examining the plant material to determine its nature:\n(a) Macroscopic examination: Macroscopic examination is conducted simultaneously during the separation of the block into plant material forming Groups 1, 2 and 3. The HSA analyst looks for botanical features consistent with those of the cannabis plant, including the colour, the presence of cannabis stalks or stems, leaves, female flowering branches, fruiting branches, female flowers or bracts and fruits. All plant branches in Group 1 must be at least 2cm in length and must have sufficient leaves, flowers or fruits attached to them as would allow the HSA analyst, on a macroscopic examination, to conclude that they have the botanical features of cannabis. If the plant parts are detached from each other (for instance: (i) branches with no leaves, flowers or fruits attached; or (ii) leaves, flowers or fruits detached from branches), they will be assigned to Group 2 (fragments of plant parts). In such cases, although some macroscopic botanical features of cannabis may be observed on some of these plant parts or fragments, the observed features would be insufficient for these plant parts or fragments to meet the criteria for the macroscopic test for cannabis.\nThereafter, two further analytical processes are applied to both the individual plant branches and the fragments of plant parts (meaning Groups 1 and 2), but obviously, this is not done for the observable extraneous matter (meaning Group 3), which would have been separated prior to the examination of the plant material.\n(b) Microscopic examination: The HSA analyst examines the plant material under a microscope to observe whether the characteristic botanical features of cannabis are present. These features include bear claw-shaped unicellular trichomes on the upper surface of the leaves, long slender unicellular trichomes on the lower surface of the leaves, multicellular stalked glandular trichomes and long curved unicellular trichomes on the outer surface of bracts or female flowers, long unicellular upward-pointing trichomes on the stems and reticulate pattern on the fruits. Every single plant branch in Group 1 is subject to this microscopic examination, and those that do not exhibit microscopic botanical features of cannabis are excluded and moved to Group 3. Similarly, the plant parts or fragments in Group 2 are microscopically examined to detect the presence of at least some botanical features of cannabis.\n(c) Qualitative analysis: Thin Layer Chromatography and Gas Chromatography-Mass Spectrometry are then carried out to qualitatively analyse the plant material and determine the presence of THC and CBN in Groups 1 and 2.\n60 Dr Yap explained that these three tests are internationally accepted. Indeed, they are set out by the United Nations Office on Drugs and Crime in Recommended Methods for the Identification and Analysis of Cannabis and Cannabis Products: Manual for Use by National Drug Analysis Laboratories (United Nations, 2009) at para 5.2.\n(4) Classification of the plant material\n\n61 The HSA will classify plant material as \"cannabis\" if and only if three criteria are fulfilled:\n(a) the plant branches in Group 1 must exhibit the botanical features of the cannabis plant under a macroscopic examination;\n(b) each plant branch in Group 1 must exhibit characteristic botanical features of cannabis under a microscopic examination; and\n(c) THC or CBN must be found to be present in the tested material.\n62 The HSA classifies as \"cannabis mixture\" any fragmented vegetable matter from Group 2 that does not meet the criteria for cannabis in the course of a macroscopic or microscopic examination, but that is found, upon analysis, to contain THC and CBN. Cannabis mixture certified by the HSA would have the following features:\n(a) Upon a macroscopic examination, the fragmented vegetable matter may be found to comprise: (i) a mixture consisting solely of cannabis plant parts (stems, leaves, flowers, bracts or fruits); or (ii) a mixture of cannabis plant parts and some other type of vegetable matter (such as tobacco).\n(b) Under a microscopic examination, the characteristic microscopic botanical features of cannabis may be observed in at least some part of the fragmented vegetable matter. Due to the small size of the plant parts or fragments, each plant part or fragment may not exhibit sufficient microscopic botanical features of cannabis for identification. It would also not be possible to examine every piece of plant part or fragment due to the small size of each piece and the copious amount of plant parts or fragments.\n(c) The presence of THC and CBN must be detected.\n63 The fragmented vegetable matter in Group 2 typically consists of bare branches and detached leaves, flowers or fruits which come from the cannabis plant, and other fragments of plant material. Such plant material will generally be less than 2cm long and may be as small as half a millimetre in length (see [58(b)] above), although some bare branches may be longer than 2cm. Typically, some macroscopic botanical features of cannabis may be observed on some of these plant parts or fragments, but the observed features would be insufficient for the plant parts or fragments to meet the criteria for the macroscopic test for cannabis (see [59(a)] above).\n64 As noted above, the testing procedure applied by the HSA typically results in three groups of material emanating from a single compressed block of cannabis-related plant material: (a) material that can be identified and certified as cannabis; (b) fragmented vegetable matter that cannot be certified as cannabis, but with THC and CBN detected therein; and (c) observable extraneous matter that is discarded and disregarded.\n65 This was the testing procedure that was adopted in the present case with regard to the ten bundles that the Appellant brought into Singapore.\n66 Dr Yap testified that for cases involving cannabis trafficking, the cannabis is most commonly encountered by the HSA in the form of compressed blocks. These typically consist of only material identifiable as cannabis, but in the course of testing, parts of the block are broken into fragments. To her knowledge, there was only one case in 1996 where the compressed block consisted of only fragmented vegetable matter that could not be certified as cannabis but where the presence of THC and CBN was established. She explained that this was a unique instance where the compressed block was made up of cannabis fragments only without any cannabis branches. She also testified that, at least in her experience, the HSA had never encountered compressed blocks of cannabis that had been adulterated or mixed with other non-cannabis vegetable matter such as tobacco.\n67 This was also the position with regard to the ten bundles imported by the Appellant: all ten bundles were found to comprise only cannabis plant material, and no other type of plant material was detected. Upon being pressed as to why the HSA was unable, in such circumstances, to classify the fragmented vegetable matter as cannabis, Dr Yap explained that while it would be evident to the HSA analyst, through observation, that the plant material was homogenous in colour and texture, and that the fragments were likely to be from the cannabis plant, he would not be able to certify the fragments as cannabis because it would be impossible for him to examine every fragment, many of which would be too small for macroscopic and microscopic examination, and so would not exhibit sufficient botanical features of cannabis on a macroscopic examination to meet the required criteria for cannabis. Dr Yap also explained that there was a theoretical possibility that non-cannabis plant material could be present in a block of cannabis-related drugs. Where such material was spiked with THC and CBN, it would satisfy the first and third criteria for cannabis, but not the second (see above at [61]). Therefore, the HSA required the second criteria to be fulfilled before it would certify the fragments as cannabis.\n68 Given the grave consequences that may arise for an accused person if plant material were improperly certified as cannabis, it is unsurprising that the HSA adopts such rigorous testing standards, which are to be commended.\nThe legislative history pertaining to cannabis mixture\n\n69 We turn now to examine the legislative history pertaining to the inclusion of cannabis mixture as a drug under the MDA and the criminalisation of dealings in it.\n(1) The 1993 amendments to the MDA\n\n70 Trafficking in, importing and exporting cannabis mixture were made offences under the MDA with the enactment of the Misuse of Drugs (Amendment) Act 1993 (Act 40 of 1993) (\"the 1993 amendments\"). The 1993 amendments, among other things, redefined the terms \"cannabis\" and \"cannabis resin\" and introduced the term \"cannabis mixture\". The rationale for the introduction of cannabis mixture as a drug and the criminalisation of dealings in it was explained by the then Minister for Home Affairs, Prof S Jayakumar (\"the Minister\"), as follows (see Singapore Parliamentary Debates, Official Report (10 November 1993) vol 61 (\"the 1993 Second Reading Speech\") at cols 928-929):\n... The Central Narcotics Bureau has detected some cases in which cannabis was trafficked in mixed form, ie, the plant is broken up and mixed with other vegetable matter such as tobacco. Currently, this does not attract the death penalty.\nTo deter traffickers from trafficking in large amounts of cannabis in this form, a new capital offence will be created for this type of drug. As the amount of cannabis in such a mixture does not usually fall below 50%, it is proposed that for the purpose of capital offences, trafficking in a cannabis mixture should be in amounts of more than 1,000 grammes (as compared to more than 500 grammes in the case of cannabis alone). This will give an allowance of 500 grammes for any non-cannabis material in the mixture. For this purpose, clause 6(c) of this Bill amends the Second Schedule to provide for capital punishment for trafficking in more than 1,000 grammes of cannabis mixture. To be consistent with the penalties provided for other types of drugs, the same clause also provides that trafficking in between 660 grammes and 1,000 grammes of cannabis mixture will attract a penalty of between 20 and 30 years of imprisonment and 15 strokes of the cane.\n...\nAs explained earlier, tetrahydrocannabinol and cannabinol are the two main alkaloids distinguishing cannabis from other hallucinogenic drugs. Detection of these two substances by the DSS [the Department of Scientific Services, the precursor to the HSA] chemist is sufficient scientific proof that the substance is cannabis mixture.\n[emphasis added]\n71 The Minister also touched on the testing process for cannabis in the same speech (see the 1993 Second Reading Speech at col 928):\nIn practice, the DSS relies on three types of tests to prove that the substance seized is cannabis as defined. First, there is a visual examination to establish the physical appearance and characteristic odour of cannabis. Next, a microscopic examination is carried out to detect the presence of resin, cystolithic trichomes and noncystolithic trichomes which are unique to cannabis. Lastly, chemical tests are carried out to detect the presence of tetrahydrocannabinol and cannabinol. ...\n72 Following the 1993 amendments, this court had the occasion to interpret the term \"cannabis mixture\" in Abdul Raman ([48] supra) and again in Manogaran ([1] supra).\n(2) The decision in Abdul Raman\n\n73 In Abdul Raman, this court determined the meaning of the phrase \"any mixture of vegetable matter\" in the statutory definition of \"cannabis mixture\" (see [54(b)] above), placing primary reliance on the 1993 Second Reading Speech and the dictionary meaning of \"mixing\" (at [32]):\nIt is clear to us that what Parliament was seeking to deter was the camouflaging of cannabis by mixing the cannabis in broken form with another vegetable matter such as tobacco. This is the example the Minister gave. \"Mixing\" as used by the Minister in his speech in Parliament and by dictionary meaning involves two separate substances; in the instant case two separate vegetable matter. Indeed the dictionary meaning of \"mixture\" referred to us by Mr Ismail Hamid [counsel for the first appellant] was \"the mechanical mixing of two substances involving no change in their character\". Hence, the crucial words in the definition of cannabis mixture are: \"any mixture of vegetable matter\" and this can only mean two or more separate vegetable matters. ... [emphasis in original in italics; emphasis added in bold italics]\n74 On the facts, the court held that there was no question of a \"mixture\" or of any \"mixing\" because it was clear from the evidence of the Department of Scientific Services (\"DSS\") analyst (the DSS being the then equivalent of the HSA) who examined the drug exhibit in question that \"the block of compressed greenish vegetable matter was composed of one and only one vegetable matter and no more\" (at [33]). The DSS analyst had prised open the block using a screwdriver and separated it into individual intact branches with stems and leaves. Because the vegetable matter was dry and brittle, some of it had broken into small pieces, which the DSS analyst classified as \"fragmented vegetable matter\". He certified this as cannabis mixture because he was not satisfied from the macroscopic and microscopic examinations that it exhibited the characteristic features of cannabis. However, he did detect the presence of THC and CBN (at [33] and [35]). The court opined that because the fragmented vegetable matter was not certified to be a \"mixture of vegetable matter\", the DSS analyst should not have certified it as cannabis mixture (at [35]). At the same time, however, reliance could be placed on the evidence that the intact branches with stems and leaves satisfied the test for cannabis. The court held on this basis that the appellants had been rightly charged with trafficking in cannabis, as opposed to cannabis mixture (at [38]).\n(3) The decision in Manogaran\n\n75 Approximately three months later, in Manogaran, this court overturned its decision in Abdul Raman and held that the term \"cannabis mixture\" as defined in s 2 of the MDA had two meanings - a primary meaning and an extended meaning. It held that the primary meaning was \"an unadulterated mixture of vegetable matter of entirely cannabis origin\" (at [43]), while the extended meaning contemplated \"the co-existence of vegetable matter of cannabis origin as well as non-cannabis vegetable matter\" (at [45]). The court found that Abdul Raman had mistakenly confined the meaning of \"cannabis mixture\" to only the extended meaning.\n76 In explaining its conclusion that the term \"cannabis mixture\" also bore the primary meaning, the court noted that a mixture could well be \"a mixture of different grades or purity levels of cannabis, or a mixture of various parts from different cannabis plants\"; alternatively, it could be \"a mixture of what has been loosely termed 'crushed cannabis', which is not susceptible to visual examination to detect the characteristics of the cannabis plant\" (at [43]). The court reasoned that there was nothing in s 2 of the MDA that suggested that scientific proof in any other respect was needed before a substance could be called cannabis mixture, nor was there any requirement for a mixture of vegetable matter to be from different species (at [42]).\n77 In this respect, the court found that what the Minister said in the 1993 Second Reading Speech ([70] supra) - namely, that \"[d]etection of [THC and CBN] by the DSS [analyst] is sufficient scientific proof that the substance is cannabis mixture\" (at col 929) - justified treating as cannabis mixture anything that failed to qualify as cannabis, so long as it was found to contain THC and CBN (at [41] and [42]). The court also noted that in the 1993 Second Reading Speech, the Minister did not suggest that once it was found that there was no mixture of different types of vegetable matter, the resultant substance would cease to be a \"mixture of vegetable matter\" within the meaning of s 2 of the MDA. The court considered that in explaining the rationale for the extended meaning of \"cannabis mixture\", the Minister was \"obviously directing his explanatory speech solely to the extended meaning of the term\", but could not have intended thereby to oust its primary meaning (at [46]-[47]).\n78 In addition, the court found that s 17 of the MDA supported its conclusion that the term \"cannabis mixture\" included the primary meaning (at [48]):\n... As a consequence of the 1993 amendment[s] introducing \"cannabis mixture\", [s 17] now contains a dual reference to \"mixture\":\nAny person who is proved to have had in his possession more than --\n...\n(da) 30 grammes of cannabis mixture;\n...\nwhether or not contained in any substance, extract, preparation or mixture shall be presumed to have had that drug in [his] possession for the purpose of trafficking ...\n[emphasis in original omitted; emphasis added in italics]\nThe court considered that this formulation supported the existence of both the primary meaning and the extended meaning of \"cannabis mixture\". The term could on its face bear the primary meaning of \"any mixture of cannabis vegetable matter\" (at [49]). Additionally, the term could also bear the extended meaning of any mixture of cannabis and non-cannabis vegetable matter, the latter scenario being clearly contemplated by the concept of a \"mixture within a mixture\" (at [49]). Whilst the court recognised that its approach would give rise to an overlap between the definition of \"cannabis\" and \"cannabis mixture\", it concluded that this was not a real cause for concern as \"[o]verlapping definitions, and indeed overlapping offences, are not anathema to enacted legislation\" (at [44]).\nThe definition of \"cannabis\"\n\n79 As we have stated above at [54(a)], \"cannabis\" is defined in s 2 of the MDA as \"any part of a plant of the genus Cannabis, or any part of such plant, by whatever name it is called\" [emphasis added]. This definition is clear on its face - it includes as cannabis any part of the cannabis plant.\n80 However, the HSA currently certifies as cannabis only plant branches that are at least 2cm in length and that have sufficient leaves, flowers or fruits attached to them as would allow the HSA analyst, on a macroscopic examination, to conclude that they have the botanical features of cannabis (see [59(a)] above). Dr Yap explained that once cannabis leaves, flowers and fruits are detached from the branches, the HSA will not classify either the bare branches or the detached plant parts as cannabis because:\n(a) There would be insufficient observable botanical features of cannabis to enable a positive determination. This follows from the fact that plant parts such as a bare plant branch or detached leaves, flowers or fruits have limited observable botanical features of cannabis. Even if some of these individual plant parts are found to possess microscopic botanical features of cannabis, this would not be sufficient to identify them as cannabis because they would not have satisfied the macroscopic test for cannabis: see [59(a)] above.\n(b) It is physically impossible to examine each and every plant part given their very small size and their copious quantity.\n81 While we recognise that the HSA's practice accords with the interpretation set out in Manogaran ([1] supra), it seems to us that this does not cohere with the definition of \"cannabis\" under s 2 of the MDA, which includes \"any part\" of the cannabis plant. In our view, under the MDA, cannabis leaves, flowers and fruits, even if detached from the branches, nonetheless fall within the definition of \"cannabis\" set out in s 2. That said, we recognise that this is ultimately a question of evidence and proof. The bare branches and detached leaves, flowers and fruits may fall within the statutory definition of \"cannabis\" in a physical sense, but that does not aid the Prosecution absent admissible evidence to satisfy the court that they are in fact cannabis. We will return to this momentarily when we consider the interpretation of the term \"cannabis mixture\".\nThe definition of \"cannabis mixture\"\n\n82 Turning to the definition of \"cannabis mixture\", we first observe that this term is a creature of statute. Cannabis mixture is not a specific type of drug. Its existence as a drug is entirely due to the 1993 amendments to the MDA. It is therefore a matter of paramount importance to examine the statutory definition of \"cannabis mixture\" and the context of its enactment.\n83 Section 2 of the MDA defines \"cannabis mixture\" as \"any mixture of vegetable matter containing [THC] and [CBN] in any quantity\". We note that the term \"mixture\" is not defined in the MDA, but it is common ground that, employing a purposive interpretation, this term should be interpreted in a way that gives effect to the intent and will of the Parliament. Parliament's intention in enacting the 1993 amendments to the MDA was (among other things) to criminalise the trafficking, importation and exportation of cannabis mixture as well as lay down sentencing bands for these offences where specified quantities of cannabis mixture were involved.\n84 In our judgment, the term \"cannabis mixture\" can bear the following possible interpretations:\n(a) a mixture where cannabis plant matter is commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin (the latter is the meaning that was held to be the true meaning in Abdul Raman ([48] supra) and described as the extended meaning in Manogaran);\n(b) a mixture of different grades or purity levels of cannabis, or the commingling of various different parts of the cannabis plant (this is the primary meaning adopted in Manogaran); and\n(c) a mixture where non-cannabis vegetable matter is infused or spiked with THC and CBN and commingled.\n(1) The submissions of the Prosecution and Prof Amirthalingam\n\n85 Before we consider which of these interpretations of the term \"cannabis mixture\" is correct under the Tan Cheng Bock framework on statutory interpretation, we first summarise the submissions that were advanced by the Prosecution and Prof Amirthalingam on this issue.\n86 Prof Amirthalingam supported the definition of \"cannabis mixture\" that was adopted in Abdul Raman, which is that it must be a mixture of cannabis and some other vegetable matter. He accordingly maintained that Manogaran was wrongly decided. His argument proceeded as follows:\n(a) The Court of Appeal in Manogaran (at [18]) was persuaded by the argument that there was a lacuna in the law that needed to be plugged urgently as the meaning adopted in Abdul Raman was thought to have been unduly restrictive, in that it would lead to the unintended result whereby the absence of some non-cannabis vegetable matter in a block of cannabis-related plant material would allow the accused person to escape conviction. Prof Amirthalingam maintained that if there truly was a lacuna, then, as a general rule, it was the responsibility of Parliament, and not the court, to rectify the situation. This was especially so where, as here, the offence carried the death penalty: see Public Prosecutor v Lam Leng Hung and others [2018] 1 SLR 659 (\"Lam Leng Hung\").\n(b) In fact, Abdul Raman did not create a gap in the law. Instead, the court there properly avoided the extension of capital offences beyond the strict bounds provided for in the legislation. If a particular block of plant material could not be classified as either cannabis or cannabis mixture, the presence of THC or CBN in the block meant that it would nonetheless give rise to an offence of unauthorised possession of these controlled drugs, albeit that this offence would not carry the death penalty.\n(c) Parliament clearly introduced cannabis mixture as a drug to deal with individuals who camouflaged cannabis in other vegetable matter such as tobacco. The express language of the definition of \"cannabis mixture\" in s 2 of the MDA and the clear statements of the Minister in the 1993 Second Reading Speech ([70] supra) pointed to the interpretation of \"cannabis mixture\" that was adopted in Abdul Raman.\n(d) The current practice of treating a mixture of different parts of the cannabis plant as cannabis mixture was far removed from the concerns that drove the 1993 amendments to the MDA, which created offences concerning dealings in cannabis mixture. Today, almost every case involving cannabis mixture in Singapore included a separate charge involving cannabis. The concerns that led to the 1993 amendments appeared not to have materialised, and the charging practice in respect of dealings in cannabis mixture had evolved in a way that was not envisaged at the time Parliament enacted the 1993 amendments.\n87 As against this, the Prosecution supported the ruling in Manogaran, where the Court of Appeal held that the definition of \"cannabis mixture\" in s 2 of the MDA encompassed both: (a) a mixture of unadulterated cannabis fragments (the primary meaning); and (b) a mixture of cannabis and some other vegetable matter (the extended meaning). It submitted that this in fact accords with the legislative intent:\n(a) First, the Court of Appeal in Manogaran correctly pointed out (at [47]) that the exclusive reference by the Minister to the extended meaning and not the primary meaning of \"cannabis mixture\" in the 1993 Second Reading Speech (see above at [70]) did not imply that he did not consider the primary meaning to be applicable. The 1993 Second Reading Speech, after all, was not a statute, and there was no reason to apply the maxim of construction that the Minister's express mention of one meaning implied that he intended to exclude other meanings when considering the definition of \"cannabis mixture\". Instead, it was more reasonable to expect the Minister to focus on the extended meaning of \"cannabis mixture\" in the 1993 Second Reading Speech because it might otherwise be thought that Parliament did not intend to include non-cannabis plant material in its definition of \"cannabis mixture\".\n(b) Second, contrary to Prof Amirthalingam's argument, the Court of Appeal came to its decision in Manogaran on the interpretation of the statutory definition of \"cannabis mixture\" after concluding that its interpretation was supported by the language and the structure of the provision and after determining the legislative intent, and not as an impermissible exercise in judicial legislation.\n(c) Third, the Court of Appeal made its decision in Manogaran in 1996, three years after cannabis mixture came into being in the MDA, and some 22 years have since passed. The fact that Parliament has not effected further amendments relating to the definition of \"cannabis mixture\" in s 2 of the MDA notwithstanding the significant shift made in this regard in Manogaran supports the view that the interpretation adopted in Manogaran represents the correct interpretation and accords with Parliament's intent.\n(2) Purposive interpretation\n\n88 We turn to consider the various interpretations of the term \"mixture\" in s 2 of the MDA. As this is ultimately a question of statutory interpretation, it is appropriate for us to begin by setting out the applicable principles in this regard. A court's task when undertaking a purposive interpretation of a legislative provision involves three steps (see Tan Cheng Bock ([49] supra) at [37], [38], [41], [43] and [54]):\n(a) First, the court should ascertain the possible interpretations of the provision in question, having regard not just to the text of the provision but also to the context of that provision within the written law as a whole. The court should undertake this task by determining the ordinary meaning of the words of the provision.\n(b) Second, the court should ascertain the legislative purpose or object of the statute. The statute's individual provisions must then be read consistently with both the specific and the general purposes of the statute as far as possible. The specific purpose behind a particular provision may be distinct from the general purpose underlying the statute as a whole, and it may therefore be necessary to consider separately the specific purpose of a particular provision when the court endeavours to ascertain the legislative intent, given that different provisions may target different mischiefs (see Attorney-General v Ting Choon Meng and another appeal [2017] 1 SLR 373 at [61]). In seeking to draw out the legislative purpose behind a provision, primacy should be accorded to the text of the provision and its statutory context over any extraneous material.\n(c) Third, the court should compare the possible interpretations of the text against the purposes or objects of the statute. An interpretation which furthers the purpose of the written text is to be preferred over one which does not.\n89 The text of the statutory provision is always the starting point. Purposive interpretation must be done with a view toward determining the purpose and object of the provision or statute in question, \"as reflected by and in harmony with the express wording of the legislation\" (see Tan Cheng Bock at [50], citing Public Prosecutor v Low Kok Heng [2007] 4 SLR(R) 183 at [50]). Where there is genuine ambiguity in the meaning of a provision even after the court has attempted to interpret it purposively, recourse may be had to the strict construction rule as a last resort (see Nam Hong Construction & Engineering Pte Ltd v Kori Construction (S) Pte Ltd [2016] 4 SLR 604 at [28(b)] and Yuen Ye Ming v Public Prosecutor [2019] 5 SLR 225 (\"Yuen Ye Ming\") at [44]). This rule has also been referred to as the principle against doubtful penalisation, and it typically results in a construction that favours leniency to the accused (see Yuen Ye Ming at [44], where reference was made to Kong Hoo (Pte) Ltd and another v Public Prosecutor [2019] 1 SLR 1131 (\"Kong Hoo\") at [140] and [141]).\n(A) STEP 1: THE POSSIBLE INTERPRETATIONS OF \"CANNABIS MIXTURE\"\n\n90 As we stated at [54(b)] above, s 2 of the MDA defines \"cannabis mixture\" as \"any mixture of vegetable matter containing [THC] and [CBN] in any quantity\". We have set out the three possible interpretations of this at [84] above.\n91 In assessing which of these possible interpretations is the correct one, we begin by determining the ordinary meaning of the words in the statutory definition of \"cannabis mixture\" (see Tan Cheng Bock at [38]). The Oxford English Dictionary (Oxford University Press, 2nd Ed, 1989) defines \"mixture\" as a \"[m]ixed state of condition; coexistence of different ingredients or of different groups of classes of things mutually diffused through each other\" and \"[a] product of mixing; a complex unity or aggregate (material or immaterial) composed of various ingredients or constituent parts mixed together\". At the core of the meaning of \"mixture\" lies the commingling of two or more different components.\n92 In our judgment, the ordinary meaning of \"mixture\" militates against the second of the three interpretations of \"cannabis mixture\" set out at [84] above. It seems to us counterintuitive to speak of a \"mixture\" in the context of a \"mixture of vegetable matter\" that does not entail the combination of more than one type of such matter. Vegetable matter that comes from different parts of the cannabis plant would seem, at first blush, to be the same sort of vegetable matter and, thus, not to be a \"mixture\".\n93 In our judgment, the plain meaning of the term \"cannabis mixture\" likewise does not support the third interpretation. Parliament shuns tautology and courts generally proceed on the premise that Parliament uses words purposefully (see Tan Cheng Bock at [38]). The inclusion of the word \"cannabis\" in the term \"cannabis mixture\" indicates that the mixture must necessarily be composed of some cannabis plant matter.\n94 Hence, it seems to us that the ordinary meaning of \"cannabis mixture\" as defined in s 2 of the MDA points towards the first interpretation, as was held to be the case in Abdul Raman.\n(B) STEPS 2 AND 3: THE LEGISLATIVE PURPOSE OR OBJECT AND A COMPARISON OF THE POSSIBLE INTERPRETATIONS\n\n95 To determine whether the first interpretation of \"cannabis mixture\" is indeed the correct one, we turn to the second and third steps of the Tan Cheng Bock framework on statutory interpretation collectively in this section. To reiterate, at the second step of this framework, we determine the specific and the general purposes of s 2 of the MDA, which defines the term \"cannabis mixture\" (see [88(b)] above); and at the third step, the possible interpretations of the text are assessed in the light of the purposes or objects of the MDA. An interpretation which furthers the purpose of the written text is to be preferred over one which does not (see [88(c)] above).\n96 To determine the legislative purpose behind a provision, primacy should be accorded to the text of the provision and its statutory context over any extraneous material (see Tan Cheng Bock at [43]; see also [88(b)] above).\n(I) THE TEXT OF THE PROVISION AND ITS STATUTORY CONTEXT\n\n97 We begin with the text of s 2 of the MDA and its statutory context. The long title of the MDA states that its general purpose is \"for the control of dangerous or otherwise harmful drugs and substances and for purposes connected therewith\". This does not seem to us to advance the analysis materially.\n(II) THE EXTRANEOUS MATERIAL\n\n98 We turn then to the extraneous material to ascertain the specific purpose of Parliament's criminalisation of dealings in \"cannabis mixture\" as defined in s 2 of the MDA.\n99 Of course, before deciding whether to consider the extraneous material, the court will necessarily make a preliminary assessment of whether it is capable of giving assistance (see Tan Cheng Bock at [46]). In the present case, we are satisfied that the 1993 Second Reading Speech ([70] supra) is more than capable of giving assistance. It confirms that the ordinary meaning that we have arrived at upon considering the text and the context of the provision is indeed the correct meaning intended by Parliament. Most crucially, the 1993 Second Reading Speech elucidates the specific purpose behind the criminalisation of dealings in cannabis mixture (see [70] above).\n100 In the 1993 Second Reading Speech, the Minister explained that the purpose behind the inclusion of cannabis mixture as a drug under the MDA and the criminalisation of dealings in it was to deter \"cases in which cannabis was trafficked in mixed form, ie, the plant is broken up and mixed with other vegetable matter such as tobacco\". This move was prompted by the CNB's detection of such cases, which did not attract the death penalty under the law as it then stood. It was thought that this was a loophole that could be exploited by traffickers who wished in fact to deal in large quantities of cannabis. The purpose of the legislation was presented as being to \"deter traffickers from trafficking in large amounts of cannabis in this form\" by enacting \"a new capital offence\" for this \"mixed form\" of cannabis, in order to prevent traffickers from evading the severe penalties for trafficking in cannabis by adulterating it in the manner described. This is what led to the statutory creation of cannabis mixture as a drug and the criminalisation of dealings in it, with specific sentencing ranges (including the death penalty) stipulated for trafficking in, importing and exporting certain quantities of that drug. Significantly, these quantities were pegged at twice the corresponding quantities of cannabis in order to cater for the fact that cannabis mixture would feature a non-cannabis component. We therefore agree with Prof Amirthalingam that the statements of the Minister clearly point towards the interpretation of \"cannabis mixture\" that was adopted in Abdul Raman ([48] supra), meaning a mixture of cannabis and some other vegetable matter. The specific purpose behind the 1993 amendments pertaining to cannabis mixture was to deter the trafficking, importation and exportation of cannabis mixed with other vegetable matter such as tobacco. In our judgment, this confirms the first interpretation set out at [84] above, which accords with the plain meaning of \"mixture\" (see [91] above), and points against treating different parts of the cannabis plant or different purity grades of cannabis as distinct components of cannabis mixture (as is the case with the second interpretation). The first interpretation also furthers the purpose of the written text of s 2 of the MDA. In our judgment, the first interpretation is therefore to be preferred over the second and third interpretations of the term \"cannabis mixture\".\n101 We turn now to address the Prosecution's arguments and the reasons that led this court to adopt a contrary interpretation in Manogaran ([1] supra).\n102 First, we disagree with the Prosecution's averments that: (a) it was reasonable to expect the Minister to address only the extended meaning of \"cannabis mixture\" in the 1993 Second Reading Speech; and (b) the exclusive reference by the Minister to the extended meaning but not the primary meaning of \"cannabis mixture\" did not imply that he did not consider the primary meaning to be applicable. It should be reiterated that prior to the 1993 amendments to the MDA, cannabis mixture did not exist as a drug. It was statutorily created, and one would expect that in explaining this move, the Minister would have provided whatever reasons existed for it. Having considered the Minister's statement to Parliament explaining this move, it is clear that the Minister's explanation simply does not support the primary meaning of \"cannabis mixture\" that was adopted in Manogaran. There, the court placed reliance on the Minister's observation that the detection of THC and CBN in a substance would constitute sufficient scientific proof that that substance was cannabis mixture (see above at [70]). With respect, we consider that what the Minister said was quoted out of context. That remark was made in the context of explaining the second half of the definition of \"cannabis mixture\" in s 2 of the MDA, which reads \"containing [THC] and [CBN] in any quantity\", and it was immediately preceded by the Minister's explanation that the reason for including cannabis mixture in s 2 of the MDA was to bring within the MDA offenders who camouflaged cannabis with other plant material such as tobacco. In our judgment, the Minister's remark on the detection of THC and CBN in a substance could not, in and of itself, be suggestive of anything to undermine or qualify the unequivocal intention to specifically target the trafficking, importation and exportation of a mixture of cannabis and non-cannabis plant material.\n103 Second, we are not convinced by the Prosecution's contention that the absence of further amendments relating to the definition of \"cannabis mixture\" in s 2 of the MDA, for more than 20 years after Manogaran was decided in 1996, is evidence that the decision in Manogaran was consistent with Parliament's intent. The absence of legislative action may be explained by any of a multitude of reasons including the Legislature's own priorities. Drawing an inference from this that the interpretation of the statutory definition of \"cannabis mixture\" that was adopted in Manogaran was correct would be entirely speculative and dangerous, and we reject this proposition.\n104 For these reasons, applying a purposive interpretation, we are satisfied that \"cannabis mixture\" as defined in s 2 of the MDA encompasses only the first interpretation set out at [84] above. In short, cannabis mixture consists of cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin. There would be no \"mixture\" if the plant matter consists solely of cannabis. In our judgment, this is preferred to the primary meaning coined by the court in Manogaran because, as we have noted, where one is faced with plant material that is unadulterated and entirely of cannabis origin, there is simply no mixture to speak of. Therefore, the holding in Abdul Raman ([48] supra) that the term \"cannabis mixture\" only encompasses drugs containing cannabis plant material and some other vegetable matter is correct, and we overrule Manogaran to this extent.\n105 That said, we return to a point that we alluded to at [81] above. The correct interpretation of cannabis mixture that we have arrived at may not always make a difference in practice. It is important to distinguish physical realities from what can be proved in court. It is evident from Dr Yap's evidence that the HSA's insistence upon rigour in testing leads its analysts at times to decline to certify particular plant material as cannabis even if, as a matter of observation, they might subjectively believe it to be cannabis. We think this is an entirely correct stance for the HSA to take. But as a result of this, even if the HSA analyst might subjectively believe that a given batch of plant material is entirely derived from the cannabis plant, he would be unable to certify it as cannabis because of the testing criteria that are in place. As a court seeking the best evidence, and having regard to (a) the gravity of the consequences of improper certification on the liberty, and perhaps even the life, of an offender as well as (b) the fact that the HSA's testing criteria are in line with international standards (for instance, those reflected in the guidance provided by the United Nations Office on Drugs and Crime), we think that absent the HSA's certification of a block of cannabis-related plant material as cannabis, the correct factual conclusion to be drawn in such circumstances is this: it may or may not be possible to rule out, in such circumstances, that the plant fragments from the block are of a non-cannabis origin. If, as a scientific matter, that possibility can be ruled out, then logically, the entire block should be treated as cannabis. But where that possibility remains, then the block would be a combination of cannabis and other plant material of indeterminate origin; and provided that other plant material contains THC and CBN, there would be no difficulty with treating the block as cannabis mixture.\n106 Significantly, in response to our query as to whether the HSA would be able to certify fragmented vegetable matter from a block of cannabis-related plant material as unadulterated cannabis, Dr Yap testified that even where the HSA analyst subjectively believed that the entire block was unadulterated cannabis, the HSA would not be able to certify it as such and would only be able to certify it as follows:\nnot less than [] grams of fragmented vegetable matter which was analysed and found to contain [CBN] and [THC]. Within this vegetable matter: (i) there is evidence of plant parts/fragments bearing features of the cannabis plant; and (ii) there is no evidence of another plant type being present, although the possibility of another type of plant material being present cannot be completely excluded. [emphasis in original omitted; emphasis added in italics]\nIn short, as a matter of scientific evidence, the fragmented vegetable material, as far as the court is concerned, is ultimately of indeterminate origin.\n107 It should be noted that the effect of our holding in the previous two paragraphs would not in any case prejudice the offender. Its effect is to treat as cannabis mixture even vegetable matter which the HSA analyst subjectively believes to consist solely of cannabis. It is uncontroversial that the penalties for offences involving cannabis mixture are less severe than those for offences involving pure cannabis of the same weight because Parliament took into account the circumstance that cannabis mixture would commonly include a proportion of non-cannabis plant material (see above at [70]).\n108 This leads to our final point in this connection. Prof Amirthalingam submitted that the decision in Manogaran ([1] supra) was inappropriate because its effect was to create a new capital offence. He submitted that any lacuna in the law should have been filled by Parliament and not the court, especially where the offence created attracted the death penalty. As this court warned in Lam Leng Hung ([86(a)] supra) at [276]-[277]:\n276 ... [T]he court cannot arrogate to itself the legislative function that belongs exclusively to Parliament by adding to or taking away from language in a statutory provision in a manner that goes beyond the boundaries of what is permissible in statutory construction. The impulse to see crime punished to what the court considers to be the appropriate extent cannot, within the tenets of our constitutional framework, be permitted to surge beyond the borders of the judicial function.\n277 ... As a matter of constitutional principle and public policy, we are firmly of the view that, in the present case, the shaping of a remedy should be left to Parliament.\n[emphasis in original omitted; emphasis added in italics]\nProf Amirthalingam submitted that the court in Abdul Raman ([48] supra) properly restricted the definition of \"cannabis mixture\", a creature of statute, to the narrow category of drugs specifically intended by Parliament to deter offenders who trafficked in, imported or exported large amounts of cannabis mixed with other vegetable matter such as tobacco.\n109 While we agree with how Prof Amirthalingam has characterised the holding in Abdul Raman, we do not accept the conclusion that he seeks to draw from this. In the course of his submissions, we explained to Prof Amirthalingam that we found this part of his submissions somewhat counterintuitive, and indeed, it is. The court in Manogaran did not create a new capital offence; that was done by Parliament. What the court in Manogaran did was to give effect to Parliament's reasons, as articulated by the Minister in the 1993 Second Reading Speech (see [70] above), for raising the threshold weights applicable to cannabis mixture. The effect of the decision in Manogaran was to give the offender the benefit of the doubt in respect of that part of a block of cannabis-related plant material that could not be certified as cannabis, by allowing that part to be treated as cannabis mixture. We agree with this result, but we arrive there by a different process. Unlike the court in Manogaran, which treated the portion that could not be certified as cannabis as other parts of the cannabis plant, we treat it as plant material of indeterminate origin, which is precisely what it is if it cannot be certified as cannabis by the HSA. But, we think the end result will often be the same.\n(3) Ease of distinguishing and separating the components\n\n110 We turn to a related issue of whether cannabis mixture should be confined to matter consisting of components that cannot be easily distinguished or separated from each other.\n(A) THE SUBMISSIONS OF THE PROSECUTION AND PROF AMIRTHALINGAM\n\n111 Both the Prosecution and Prof Amirthalingam submitted that a \"mixture\" must refer to matter that consists of components or substances that cannot be easily distinguished or separated from each other. In this regard, reliance was placed on the decision of the United States Supreme Court in Richard L Chapman, John M Schoenecker and Patrick Brumm v United States 111 S Ct 1919 (1991) (\"Chapman v US\"). There, it was held by a majority of 7:2 that the word \"mixture\" in its ordinary meaning meant \"a portion of matter consisting of two or more components that do not bear a fixed proportion to one another and that however thoroughly commingled are regarded as retaining a separate existence\", and \"may also consist of two substances blended together so that the particles of one are diffused among the particles of the other\" (at 1926). The majority held that blotter paper containing lysergic acid diethylamide (better known as \"LSD\") was a mixture. Thus, for the purpose of sentencing under s 841(b)(1)(B)(v) of Title 21 of the United States Code, which calls for a mandatory minimum sentence of five years' imprisonment for the offence of distributing more than one gram of \"a mixture or substance containing a detectable amount of [LSD]\", the weight of the drug was held to be the total weight of the blotter paper and the LSD, and not just the LSD present in the blotter paper (at 1922). The blotter paper containing LSD fell within the ordinary meaning of \"mixture\" because the LSD crystals left behind when the solvent evaporated were inside the blotter paper, so they were commingled with it. The LSD did not chemically combine with the blotter paper but retained a separate existence, even though it was diffused among the fibres of the blotter paper and could not be distinguished or easily separated from the blotter paper (at 1926). However, Chief Justice Rehnquist, who delivered the opinion of the majority, explained that the term \"mixture\" would not include LSD in a bottle, for instance, because, there, the drug could be easily distinguished and separated from its \"container\" and was clearly not mixed with the glass vial. This interpretation was later followed by the United States Supreme Court in Meirl Gilbert Neal v United States 116 S Ct 763 (1996).\n112 The Prosecution submitted that in the case of a compressed block of cannabis-related plant material, the HSA can easily distinguish and separate what it classifies as the cannabis portion from what it classifies as the cannabis mixture portion. We note that this may need some qualification (as to which, see [114] below), but we address that later. The central contention that the Prosecution advances is that a \"mixture\" should refer to matter consisting of components or substances that cannot be easily distinguished or separated from each other; otherwise, even discernible non-cannabis vegetable matter found in a block of cannabis-related plant material (such as hibiscus flowers or leaves), which the HSA removes during the separation stage of its analysis, would no longer be separated into Group 3 (see above at [58]), but would instead be weighed and counted as part of the cannabis mixture to the detriment of the accused person and contrary to the specific legislative intent.\n113 Prof Amirthalingam agreed with the proposition that obvious non-cannabis vegetable matter that was easily separable and capable of being removed from a block of cannabis-related plant material should be so separated and removed. He submitted that as a matter of statutory interpretation, the court should prefer a narrow construction of \"mixture\" for the purposes of the MDA by applying the principle of doubtful penalisation recently reaffirmed and applied in Kong Hoo ([89] supra) at [140]:\n... This rule is brought into play where penal consequences attach to a person's liability under a provision of a statute and there are two plausible ways of interpreting the provision even after it has been purposively interpreted. The effect of applying the principle against doubtful penalisation is to adopt a strict construction of the provision in question and typically to construe it in a way that is in favour of leniency to the accused: PP v Low Kok Heng [2007] 4 SLR(R) 183 at [31]. [emphasis added]\n(B) THE HSA'S EVIDENCE\n\n114 It is apposite here to note the HSA's evidence on this matter. Dr Yap explained that where another type of plant fragment (such as tobacco) is mixed with cannabis fragments, it is practically impossible to separate the material into cannabis fragments and small non-cannabis fragments (such as tobacco) partly because of the small size of the fragments, and partly because the HSA simply cannot certify as cannabis some of what its analysts might believe to be cannabis. The separation of non-cannabis vegetable matter from cannabis plant branches or cannabis fragments is only possible for obvious non-cannabis vegetable matter (such as a whole hibiscus leaf) and non-vegetable matter (such as small pieces of wood or plastic), which the HSA separates into Group 3 during the separation process (see above at [58]).\n(C) PURPOSIVE INTERPRETATION\n\n115 In that light, we apply the Tan Cheng Bock framework on statutory interpretation to consider whether the term \"cannabis mixture\" should be confined to matter consisting of a mixture of components that cannot be easily distinguished or separated from each other.\n116 At Step 1 of that analytical framework, there are two possible interpretations of the term \"cannabis mixture\" as defined in s 2 of the MDA:\n(a) cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin, where the components cannot be easily distinguished or separated from each other; and\n(b) cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin, where the components may be readily distinguished or separated.\nAs between the two interpretations, while both are possible as a matter of interpreting the language of s 2, we think the latter would be illogical. Where any plant matter that is of either indeterminate or non-cannabis origin can be easily and readily separated from cannabis plant matter, there is simply no reason to treat such plant matter as part of a cannabis mixture.\n117 Turning to Step 2, the specific purpose of criminalising dealings in \"cannabis mixture\" as defined in s 2 of the MDA was to deter the trafficking, importation and exportation of cannabis mixed with non-cannabis vegetable matter such as tobacco, which, according to Dr Yap's testimony, is practically impossible to separate.\n118 Where Step 3 of the analysis is concerned, reference to the extraneous material is helpful. We find it significant that in response to the perceived threat of drug dealers mixing cannabis with tobacco or other non-cannabis plant material, Parliament's response was to include cannabis mixture as a drug under the MDA and criminalise dealings in it, while raising at the same time the threshold weights applicable to cannabis mixture for sentencing purposes by doubling them from the threshold weights applicable to cannabis, even though there was no certainty as to the precise proportions in which cannabis and non-cannabis material might be mixed in any given case. These measures were thought to be necessary because prior to the 1993 amendments to the MDA, dealings in a mixture of cannabis and non-cannabis material were thought not to attract the penalties applicable to dealings in cannabis. These measures would have been wholly illogical if what was referred to as cannabis mixture included non-cannabis material that could be easily separated from cannabis material since, in that situation, there would be no difficulty with proceeding against the offender for dealing in cannabis. In all the circumstances, we are satisfied that the first interpretation at [116] above is to be preferred over the second because it furthers the specific purpose of the statute. Parliament intended to deter the trafficking, importation and exportation of cannabis mixed with other vegetable matter that would be practically impossible to separate from cannabis fragments, but did not intend to legislate on obvious non-cannabis vegetable matter that could be readily separated from cannabis fragments and therefore disregarded.\nOur conclusion on Issue 1\n\n119 We therefore hold that \"cannabis mixture\" as defined in s 2 of the MDA means cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin, where the components cannot be easily distinguished or separated from each other.\nIssue 2: The sentencing framework for trafficking in, importing and exporting cannabis mixture\n\n120 We next examine the sentencing framework that applies to the offences of trafficking in, importing and exporting cannabis mixture. In this regard, as mentioned at [50] above, we will first deal with whether cannabis mixture should be classified as a Class A controlled drug or a non-Class A controlled drug. We will then consider whether the gross weight of cannabis mixture should be used to calibrate the sentences for these offences. This entails an examination of: (a) whether calibrating the sentences according to the gross weight of the cannabis mixture concerned is supported by the MDA; and (b) whether the sentencing framework should take into account the amount of THC and CBN contained in the cannabis mixture. Finally, we will consider whether calibrating the sentences according to the gross weight of the cannabis mixture violates Art 12 of the Constitution.\nShould cannabis mixture be classified as a Class A controlled drug, a non-Class A controlled drug or a non-controlled drug?\n\n121 It is important first to examine how cannabis mixture should be classified under the MDA. By way of background, sentencing under the MDA for trafficking, importation and exportation offences is generally influenced primarily by the type and the quantity of the drugs involved (see Vasentha d/o Joseph v Public Prosecutor [2015] 5 SLR 122 (\"Vasentha\") at [14]). The First Schedule to the MDA categorises the various types of controlled drugs into three classes, namely, Class A, Class B and Class C, according to their relative harmfulness. Different punishments are prescribed in the Second Schedule to the MDA for different classes of controlled drugs, with the highest maximum and minimum sentences meted out for offences involving Class A controlled drugs. In particular, capital punishment is not prescribed for any offence involving non-Class A controlled drugs. Aside from the harmfulness of the drug in question, it is worth mentioning that the other key factor that affects the prescribed sentence for a trafficking, importation or exportation charge under the MDA is the quantity of drugs involved (see Vasentha at [18]).\n122 Turning specifically to the offences of trafficking in, importing and exporting cannabis mixture, the broad sentencing consequences, depending on how this drug is classified, may be summarised as follows:\nWeight of cannabis mixture\nSpecifically provided pursuant to the 1993 amendments\nMore than 1,000g\nDeath\nNot less than 660g and not more than 1,000g\nMaximum: 30 years' imprisonment or imprisonment for life and 15 strokes of the cane\nMinimum: 20 years' imprisonment and 15 strokes of the cane\nPursuant to provisions predating the 1993 amendments\nIf classified as a Class A controlled drug\nIf not classified as a Class A controlled drug\nLess than 660g\nUnauthorised trafficking:\nMaximum: 20 years' imprisonment and 15 strokes of the cane\nMinimum: 5 years' imprisonment and 5 strokes of the cane\nUnauthorised import or export:\nMaximum: 30 years' imprisonment or imprisonment for life and 15 strokes of the cane\nMinimum: 5 years' imprisonment and 5 strokes of the cane\nUnauthorised trafficking:\nMaximum: 20 years' imprisonment and 10 strokes of the cane if classified as a Class B controlled drug; 10 years' imprisonment and 5 strokes of the cane if classified as a Class C controlled drug\nMinimum: 3 years' imprisonment and 3 strokes of the cane if classified as a Class B controlled drug; 2 years' imprisonment and 2 strokes of the cane if classified as a Class C controlled drug\nUnauthorised import or export:\nMaximum: 30 years' imprisonment or imprisonment for life and 15 strokes of the cane if classified as a Class B controlled drug; 20 years' imprisonment and 15 strokes of the cane if classified as a Class C controlled drug\nMinimum: 5 years' imprisonment and 5 strokes of the cane if classified as a Class B controlled drug; 3 years' imprisonment and 5 strokes of the cane if classified as a Class C controlled drug\n(1) Classification as a controlled drug\n\n123 We first consider whether cannabis mixture is a controlled drug.\n(A) THE STATUTORY DEFINITION\n\n124 The term \"controlled drug\" is defined in s 2 of the MDA to mean \"any substance or product which is for the time being specified in Part I, II or III of the First Schedule or anything that contains any such substance or product\" [emphasis added].\n(B) THE SUBMISSIONS OF THE PROSECUTION AND PROF AMIRTHALINGAM AND OUR DECISION\n\n125 The Prosecution submitted that cannabis mixture fulfils the definition of a controlled drug, while Prof Amirthalingam disagreed with this.\n126 The Prosecution pointed out that \"cannabis mixture\" is defined in s 2 of the MDA as \"any mixture of vegetable matter containing [THC] and [CBN] in any quantity\", and that THC and CBN are controlled drugs specified in Part I of the First Schedule. Therefore, the Prosecution submitted, cannabis mixture would be a controlled drug under the second limb of the definition of \"controlled drug\" because it contains one or more substances specified in Part I of the First Schedule (see above at [124]).\n127 Prof Amirthalingam disagreed with this and suggested that if the court were to approach it in this way, then technically, the definition of \"controlled drug\" in s 2 of the MDA would encompass even a sack of flour, a suitcase or a vehicle that contains a controlled drug. We do not accept Prof Amirthalingam's argument. First, our primary holding is that the term \"cannabis mixture\" should be restricted to cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin, where the components cannot be easily distinguished or separated from each other (see [119] above). This puts paid to Prof Amirthalingam's concerns that it would be possible to bring containers holding controlled drugs within the statutory definition of \"controlled drug\".\n128 Second, as the Prosecution rightly pointed out, ss 18(1)(a) and 21 of the MDA specifically deal with situations where a controlled drug is found in a receptacle or a vehicle, with the law presuming that the person in possession of the receptacle or the owner of the vehicle had the drug in his possession. The definition of \"controlled drug\" would plainly not extend to such receptacles or vehicles.\n129 We are therefore satisfied that cannabis mixture falls within the definition of \"controlled drug\" in s 2 of the MDA.\n(2) Classification as a Class A controlled drug\n\n130 We next consider whether cannabis mixture is a Class A controlled drug.\n(A) THE STATUTORY DEFINITION\n\n131 Class A drugs are a subset of controlled drugs. Under s 2 of the MDA, the term \"Class A drug\" is defined as \"any of the substances and products for the time being specified in [Part] I ... of the First Schedule\".\n132 Under para 1 of Part I of the First Schedule to the MDA, CBN, CBN derivatives, cannabis and cannabis resin are listed as Class A controlled drugs. Under Part IV of the First Schedule, which sets out the meaning of certain terms used in the First Schedule, CBN derivatives are defined as \"the following substances, namely tetrahydro derivatives of cannabinol and their carboxylic acid derivatives, and 3-alkyl homologues of cannabinol or its tetrahydro derivatives\", which would include THC. As such, THC would be included within the substances listed as Class A controlled drugs in para 1 of Part I of the First Schedule.\n133 Further, para 5 of Part I of the First Schedule also includes the following as a Class A controlled drug:\nAny preparation or other products containing a substance or product for the time being specified in any of paragraphs 1 to 4.\nUnder Part IV of the First Schedule, the word \"preparation\" is defined to mean \"a mixture, solid or liquid, containing a controlled drug\". Reading the provisions together, it would appear that a mixture of products containing CBN, CBN derivatives (such as THC), cannabis and/or cannabis resin would be a Class A controlled drug because these specific substances are listed as Class A controlled drugs under para 1 of Part I of the First Schedule, and by virtue of para 5 of Part 1 read with Part IV of the First Schedule, the mixture of products would be a \"preparation\" containing one or more of these substances. This in fact was the essence of the Prosecution's submissions.\n(B) THE SUBMISSIONS OF PROF AMIRTHALINGAM AND THE PROSECUTION AND OUR DECISION\n\n134 As against this, Prof Amirthalingam submitted that cannabis mixture should not be treated as a Class A controlled drug because it is not itself specifically listed as a Class A controlled drug in Part I of the First Schedule. As we have seen, that Part specifically lists (in relation to cannabis-related drugs) only CBN, CBN derivatives (which include THC), cannabis and cannabis resin as Class A controlled drugs, but not cannabis mixture.\n135 Prof Amirthalingam contended that cannabis mixture should not be considered a \"mixture\" and cannot come within the definition of \"preparation\" under Part IV of the First Schedule given the approach taken by the United States Supreme Court in Chapman v US ([111] supra), which contemplates that when dealing with a mixture, the controlled drug must be indistinguishable and not easily separated from the other matter. Prof Amirthalingam pointed out that according to the Prosecution, it is \"relatively easy to separate cannabis components from other vegetable matter\". We have noted (at [112] above) the need to qualify this in the light of the HSA's evidence as summarised at [114] above. Indeed, it seems to us that Prof Amirthalingam's view conflates two distinct aspects of the evidence given by Dr Yap. Dr Yap testified that in a block of cannabis-related plant material of the kind typically analysed by the HSA, there are two types of non-cannabis plant fragments: (a) small non-cannabis plant fragments (such as tobacco) that are practically impossible to separate from cannabis fragments; and (b) obvious non-cannabis vegetable matter (such as a whole hibiscus leaf) which are easily identified and separated into Group 3 during the analytical process. It seems to us that Prof Amirthalingam's objection to treating cannabis mixture as a \"mixture\" or a \"preparation\" would only arise where cannabis is mixed with obvious non-cannabis vegetable matter (such as hibiscus leaves) that can be easily separated and removed. But this, in truth, is not an issue because the HSA's practice is to remove such obvious non-cannabis vegetable matter and disregard its weight when computing the weight of the cannabis mixture concerned (see above at [58]). Indeed, our primary holding that the term \"cannabis mixture\" is restricted to mixtures where the components cannot be easily distinguished or separated from each other again disposes of this concern.\n136 Prof Amirthalingam next submitted that relying on para 5 of Part I of the First Schedule to conclude that cannabis mixture is a Class A controlled drug would entail reasoning that he described as \"tortuous\". He contended that such a construction would render the 1993 amendments to the MDA, which introduced the specific drug cannabis mixture, otiose. If cannabis mixture could be classified as a controlled drug and, more specifically, a Class A controlled drug on the basis of para 5 of Part I of the First Schedule, then there would have been no need for Parliament to enact specific provisions dealing with cannabis mixture.\n137 However, as the Prosecution rightly pointed out, this is incorrect. The 1993 amendments not only created the drug now known as cannabis mixture, but also enacted specific sentencing provisions for the offences of trafficking in, importing and exporting that drug, namely: (a) the death penalty in cases involving more than 1,000g of cannabis mixture; and (b) a maximum of 30 years' imprisonment or imprisonment for life and 15 strokes of the cane, and a minimum of 20 years' imprisonment and 15 strokes of the cane in cases involving not less than 660g and not more than 1,000g of cannabis mixture. Without those amendments, a conviction for trafficking in, importing or exporting what came to be known as cannabis mixture would only have attracted the general sentencing provisions for a Class A controlled drug under the Second Schedule (see above at [122]). It is in fact evident from the extraneous material we have examined above at [70] that the creation of new sentencing provisions for offences involving cannabis mixture and the extension of the death penalty to certain of these offences were a key object of the 1993 amendments.\n138 In our judgment, on a true construction of the relevant provisions, cannabis mixture is a Class A controlled drug even though it is not specifically listed in para 1 of Part I of the First Schedule as a Class A controlled drug. This is the result of giving effect to the plain meaning of para 5 of Part I of the First Schedule. There is no basis at all for construing that paragraph as not including cannabis mixture. Further, to construe cannabis mixture as anything other than a Class A controlled drug would run against the fact that only offences involving Class A controlled drugs attract capital punishment. It is indisputably clear that at the time of the 1993 amendments, Parliament specifically understood that it was enacting capital punishment for certain offences involving cannabis mixture and, indeed, intended to do so. By construing the provisions in question in the manner we have set out above and by giving them their natural meaning, we avoid the incongruity that would result if certain offences involving cannabis mixture were subject to capital punishment without cannabis mixture itself being a Class A controlled drug.\n139 Accordingly, we hold that cannabis mixture is a Class A controlled drug under the MDA.\nWhether the gross weight of cannabis mixture should be used to calibrate sentencing\n\n140 We next consider whether the gross weight of cannabis mixture should be used to calibrate sentencing.\n(1) The current state of the law\n\n141 Specific sentencing ranges for the offences of trafficking in, importing and exporting specific quantities of cannabis mixture are stipulated in the Second Schedule to the MDA. We have set these out in the table at [122] above. For convenience, we reiterate certain points here. For unauthorised traffic in, import or export of cannabis mixture where the quantity is:\n(a) not less than 660g and not more than 1,000g: the prescribed sentencing range is a maximum of 30 years' imprisonment or imprisonment for life and 15 strokes of the cane, and a minimum of 20 years' imprisonment and 15 strokes of the cane; and\n(b) more than 1,000g: the prescribed sentence is death.\nThese provisions were introduced by the 1993 amendments to the MDA.\n142 For unauthorised traffic in, import or export of all other quantities of cannabis mixture, no specific sentencing ranges are provided. There are, however, general sentencing provisions found in the Second Schedule to the MDA, which predate and are independent of the 1993 amendments:\nGeneral nature of the offence\nClass A drug involved\nSpecified drug or quantity thereof\nUnauthorised traffic in a controlled drug except as otherwise provided in the Schedule\nMaximum: 20 years' imprisonment and 15 strokes of the cane\nMinimum: 5 years' imprisonment and 5 strokes of the cane\n-\nUnauthorised import or export of a controlled drug except as otherwise provided in the Schedule\nMaximum: 30 years' imprisonment or imprisonment for life and 15 strokes of the cane\nMinimum: 5 years' imprisonment and 5 strokes of the cane\n-\n143 In Public Prosecutor v Chandrasekran s/o Elamkopan [2016] SGDC 20 (\"Chandrasekran\"), the District Court set out (at [20]) the following indicative starting points for sentencing a first-time offender for trafficking in cannabis mixture in quantities of up to 600g (meaning the framework set out at [142] above) based on the weight involved in any given case:\nImprisonment\nCaning\nEquivalent weight of cannabis mixture\n\n5-6 years\n5-6 strokes\nApproximately up to 200g\n6-7 years\n6-7 strokes\nApproximately 200-300g\n7-8 years\n7-8 strokes\nApproximately 300-450g\n8-9 years\n8-9 strokes\nApproximately 450-530g\n10-13 years\n9-10 strokes\nApproximately 530-600g\n13-15 years\n10-11 strokes\nApproximately 600-599.99g\nThe District Judge derived the aforesaid indicative starting points from the equivalent indicative starting points set out in Vasentha ([121] supra) for a first-time offender trafficking in diamorphine. The District Judge based his decision on the principle espoused in Vasentha (at [19]) that the quantity of drugs trafficked would have a direct correlation with the degree of harm to society and would therefore serve as a reliable indicator of the seriousness of the offence. In this regard, the applicable weight used by the District Judge was the gross weight of the cannabis mixture concerned.\n144 In that light, we turn to examine the submissions made on this issue by the Prosecution and Prof Amirthalingam respectively.\n(2) The submissions of the Prosecution and Prof Amirthalingam\n\n145 The Prosecution submitted that the indicative sentencing starting points laid down in Chandrasekran for the offence of trafficking in cannabis mixture were \"roughly in line\" [emphasis in original omitted] with those in the Prosecution's table of proposed indicative starting points, and in particular, that it was appropriate to have regard to the gross weight of the particular lot of cannabis mixture in any given case and to disregard other possible factors relating to the composition of that lot for the following reasons:\n(a) Parliament was cognisant of the fact that there would be no precision in the different proportions of cannabis and non-cannabis material that might be present in any given lot of cannabis mixture. This was implicit in the Minister's observation that the amount of cannabis in cannabis mixture \"did not usually fall below 50%\" [emphasis by the Prosecution in original]. As we have already noted above, Parliament's solution to the difficulty in accounting for the proportion of non-cannabis material present in cannabis mixture was to double the threshold weights for cannabis mixture from those applicable in respect of cannabis. Parliament was aware that the amount of cannabis in cannabis mixture might be less than 50%, but nevertheless made the policy decision to deal with sentencing by simply doubling the threshold gross weights for cannabis mixture.\n(b) Further, the fact that THC and CBN are necessary constituents for a mixture of vegetable matter to constitute cannabis mixture does not mean that these substances are relevant for the purpose of sentencing. On the contrary, these substances were specified in the statutory definition of \"cannabis mixture\" in s 2 of the MDA because they are unique identifiers of the presence of cannabis.\n146 Prof Amirthalingam disagreed with the Prosecution's position for the following reasons:\n(a) Cannabis mixture is not specified as a controlled drug under the MDA and its gross weight is not a reliable proxy for the amount of cannabis present in cannabis mixture. We pause to note that this point has been disposed of as we have held at [129] above that cannabis mixture is a controlled drug for the reasons we have given. We will deal with the second point as to gross weight below.\n(b) Even if cannabis mixture is a controlled drug, there is too much variation in the meaning of \"cannabis mixture\" under the law pronounced in Manogaran ([1] supra). We note that this too is no longer relevant given our holding at [119] above on the correct interpretation of the statutory definition of \"cannabis mixture\".\n(c) There is significant overlap in the definition of \"cannabis\" and \"cannabis mixture\" under the law pronounced in Manogaran, as a result of which it is unclear whether a given lot of vegetable matter would be classified as cannabis or cannabis mixture. This has similarly largely been overtaken by our holding on the proper interpretation of the statutory definition of \"cannabis mixture\". Any overlap that persists would be to the benefit of the offender for the reasons we have canvassed at [107] above.\n147 Prof Amirthalingam also suggested that using the amount of THC or CBN to calibrate the sentencing ranges for the offences of trafficking in, importing and exporting less than 660g of cannabis mixture might be more principled because THC and CBN are controlled drugs. However, he did recognise that Dr Yap had testified that the HSA was not able to ascertain and certify accurately and precisely the amount of THC and CBN present in cannabis mixture.\n148 Prof Amirthalingam also referred us to the positions in Hong Kong and the United Kingdom:\n(a) In Hong Kong, the courts have held that the sentencing ranges are to be calibrated according to the weight of the cannabis oil, cannabis resin or herbal cannabis involved, as the case may be. However, the court may take into account the purity of the drug, meaning the concentration of THC, in arriving at the final sentence (citing Attorney General v Chan Chi-man [1987] HKLR 221 and Attorney General v Tuen Shui-ming and Another [1995] 2 HKCLR 129).\n(b) In the United Kingdom, the Sentencing Council's Drug Offences Definitive Guideline (2012) (\"the Guideline\") provides that the first step is to determine the offence category, which involves an assessment of the offender's culpability and the potential harm caused. Harm is assessed based on the quantity of drugs involved, and the Guideline states explicitly that the quantity of the drug is to be determined by its weight and not its purity, although the purity of the drug may be considered at the second step as a mitigating factor. In Regina v Martin Francis Cooper [2017] EWCA Crim 558, the English Court of Appeal affirmed the position under the Guideline that the primary consideration in determining harm in drug trafficking cases was the weight of the drug involved, regardless of its purity, but it also cautioned that the mitigating factor of low purity should not be routinely applied because the Guideline did not proceed \"on the basis of the quantity of drugs assessed at 100 per cent purity\" (at [46]).\n149 As to this, the Prosecution pointed out that the legislative frameworks in Hong Kong and the United Kingdom are different from ours. The Prosecution therefore maintained that the approaches taken there may not be relevant for our purposes.\n(3) Our decision\n\n150 Having regard to the provisions in the MDA, we agree with the Prosecution that the sentencing ranges for the offences of trafficking in, importing and exporting cannabis mixture should be calibrated according to the gross weight of cannabis mixture. Section 2 of the MDA provides that \"cannabis mixture\" is \"any mixture of vegetable matter containing [THC] and [CBN] in any quantity\" [emphasis added]. The words in italics point away from having regard to the concentration of THC and CBN in cannabis mixture for sentencing purposes. This, taken together with the fact that the various sentencing thresholds set out at [141] and [142] above are all based on the gross weight of cannabis mixture, suggests instead that the legislative intent is for the gravity of the offence to be assessed by reference to the gross weight of cannabis mixture. As the Prosecution rightly argued, the presence of THC and CBN in a mixture of vegetable matter, regardless of their quantity, simply brings that mixture within the statutory definition of \"cannabis mixture\". Having stipulated that THC and CBN are necessary elements of \"cannabis mixture\" as defined in s 2 of the MDA, Parliament then decided, as we have noted, that in relation to sentencing, the amount of THC and CBN in cannabis mixture is irrelevant. There remains the contention that the gross weight of cannabis mixture is not a reliable proxy indicator of harm. We do not accept this, and we deal with it in the next section.\n151 For these reasons, we hold that for the purpose of sentencing an offender for trafficking in, importing or exporting cannabis mixture, the calibration of the gravity of the offence should be based on the gross weight of the cannabis mixture concerned, and not the amount of THC or CBN contained in the cannabis mixture.\nWhether calibrating sentences according to the gross weight of cannabis mixture breaches Art 12(1) of the Constitution\n\n152 We turn to consider whether such a sentencing framework would offend the constitutional guarantee of equality contained in Art 12(1) of the Constitution. This issue arises because of the possibility that cannabis mixtures containing the same amount of pure cannabis could conceivably attract different sentences if they happen to have different gross weights, all else being equal.\n(1) The constitutional provision on equality\n\n153 Article 12(1) of the Constitution provides: \"All persons are equal before the law and entitled to the equal protection of the law\". It is concerned with equality of treatment, and embodies the principle that \"like should be compared with like\" (see Ong Ah Chuan and another v Public Prosecutor [1979-1980] SLR(R) 70 (\"Ong Ah Chuan v PP\") at [34]-[35]). It prohibits individuals \"within a single class\" from receiving different punitive treatment, but it \"does not forbid discrimination in punitive treatment between one class of individuals and another class in relation to which there is some difference in the circumstances of the offence that has been committed\" (at [35]). It is permissible to group individuals into classes as long as the grouping is based on intelligible differentia that bear a rational or reasonable connection to the object of the impugned legislation (see Public Prosecutor v Taw Cheng Kong [1998] 2 SLR(R) 489 (\"Taw Cheng Kong (CA)\") at [58]). This test, which is commonly known as the \"reasonable classification\" test, was affirmed in Lim Meng Suang and another v Attorney-General and another appeal and another matter [2015] 1 SLR 26 (\"Lim Meng Suang\"), where this court stated that a statute which prescribed a differentiating measure would be consistent with Art 12(1) if (at [63]):\n(a) the classification prescribed by the statute was founded on an intelligible differentia; and\n(b) that differentia bore a rational relation to the purpose and object sought to be achieved by the statute.\n154 Before we turn to analyse the constitutionality of a sentencing framework based on the gross weight of cannabis mixture, we deal with a preliminary point. It has previously been held that legislation attracts a presumption of constitutionality. This is rooted in the view that Parliament knows best the needs of the people and legislates to address the problems that experience makes manifest, such that legislative differentiations may be taken to be based on adequate grounds (see Taw Cheng Kong (CA) at [60], Johari bin Kanadi and another v Public Prosecutor [2008] 3 SLR(R) 422 at [10] and Quek Hock Lye v Public Prosecutor [2015] 2 SLR 563 at [27]; see also Lim Meng Suang at [107], where the court held that the presumption might not operate as strongly for laws enacted before Singapore became an independent sovereign State on 9 August 1965). In our judgment, such a presumption of constitutionality in the context of the validity of legislation can be no more than a starting point that legislation will not presumptively be treated as suspect or unconstitutional; otherwise, relying on a presumption of constitutionality to meet an objection of unconstitutionality would entail presuming the very issue which is being challenged. The enactment of laws undoubtedly lies within the competence of Parliament; but the determination of whether a law that is challenged is or is not constitutional lies exclusively within the ambit and competence of the courts, and this task must be undertaken in accordance with the applicable principles.\n(2) The first limb of the reasonable classification test: Intelligible differentia\n\n155 In that light, we turn to consider the constitutionality of calibrating the sentencing ranges for the offences of trafficking in, importing and exporting cannabis mixture according to the gross weight of the cannabis mixture concerned, beginning with the first limb of the reasonable classification test: whether the classification prescribed by the MDA is founded on an intelligible differentia. The Prosecution submitted that the gross weight of cannabis mixture is objective, clear and understandable, and so is an intelligible differentia. We agree and are satisfied that the gross weight of cannabis mixture is clearly an intelligible differentia.\n(3) The second limb of the reasonable classification test: Rational relation\n\n156 We turn to the second limb of the reasonable classification test and analyse whether the differentia of the gross weight of cannabis mixture bears a rational relation to the purpose and object sought to be achieved by the MDA. It is in relation to this limb that the Prosecution and Prof Amirthalingam disagree on the constitutionality of using the gross weight of cannabis mixture to calibrate sentencing.\n(A) THE SUBMISSIONS OF THE PROSECUTION AND PROF AMIRTHALINGAM\n\n157 The Prosecution submitted that the gross weight of a cannabis product, employed as a differentia, bears a rational relation to the purpose and object of both the MDA generally and the Second Schedule to the MDA specifically:\n(a) The social evil caused by drug trafficking which the MDA seeks to prevent is broadly proportional to the quantity of addictive drugs brought onto the illicit market. In Suventher Shanmugam v Public Prosecutor [2017] 2 SLR 115, it was held that the weight of the drugs trafficked had a direct correlation with the degree of harm to society, and that the quantity of drugs trafficked served as a reliable indicator of the seriousness of the offence (at [21], citing Vasentha ([121] supra) at [19], which we referred to earlier at [143] above).\n(b) The sentencing bands prescribed in the Second Schedule to the MDA provide for a sentencing regime based on the weight of the respective drugs. The gross weight of a cannabis product would, in general, be directly proportionate to the net weight of the cannabis-related material that it contains.\n(c) Cannabis products are transacted by gross weight in Singapore. To illustrate, the pricing of cannabis products by traffickers is based on their gross weight, and the potency of cannabis products does not arise in the manner of pricing. Cannabis products are also not distilled to extract either THC or CBN before they are sold or consumed in Singapore. The harm done through the illicit importation and trafficking of cannabis products in Singapore can be reasonably pegged to the gross weight of the cannabis product involved.\n(d) The gross weight of the cannabis product is also: (i) a key determinant of the profits that can be made from sales and the number of addicts who will be reached in any given instance of trafficking; and (ii) an independent indicia of the scale of a trafficking operation, which necessarily involves the planning and effort required to conceal a package of drugs.\n(e) Whether the gross weight of the cannabis product passes muster as a differentia under the reasonable classification test does not depend on whether any better differentia is available. But in any event, there is no better differentia (such as the quantity of THC in a cannabis product) to adopt for the purposes of setting sentencing bands for the offences of trafficking in, importing and exporting cannabis products. The difficulty of quantifying the amount of THC in a cannabis product would lead to uncertainty, inconsistency and arbitrariness.\n158 Prof Amirthalingam took a mixed view on the constitutionality of a sentencing framework based on the gross weight of cannabis mixture, drawing a distinction between the use of the gross weight of cannabis mixture to: (a) impose the death penalty and develop sentencing ranges in cases involving cannabis mixtures weighing 660g or more; and (b) develop sentencing ranges in cases involving cannabis mixtures weighing less than 660g.\n159 On the one hand, Prof Amirthalingam took the position that there is no constitutional difficulty with stipulating a threshold weight for the imposition of the death penalty and a prescribed sentencing range where the weight of the cannabis mixture is 660g or more. He explained that the determination of a threshold weight of 1,000g beyond which the death penalty is imposed, and the provision of minimum and maximum sentences for cases involving cannabis mixtures weighing between 660g and 1,000g are matters of social policy that are well within the institutional competence of Parliament. He accepted that there is a rational relation between these threshold weights and the legislative object of deterring the trafficking, importation and exportation of large quantities of cannabis mixed with other vegetable matter.\n160 On the other hand, he submitted that using the weight of cannabis mixture to develop sentencing ranges for cases involving cannabis mixtures weighing less than 660g could potentially result in the unequal treatment of offenders. As we mentioned earlier, in Vasentha ([121] supra), it was observed that the MDA sentencing framework with regard to trafficking rests primarily on the type and the quantity of drugs involved (at [14]). Prof Amirthalingam contended that the type of drug must necessarily be based on its pharmacological qualities and not its legal traits. Where the components of different cannabis mixtures cannot be quantified, two cannabis mixtures of the same gross weight could have very different harmful consequences and yet result in the imposition of the same sentence. A sentencing court would be unable to assess the potential harm for the purpose of determining the appropriate sentence because it would not know whether the cannabis mixture in a particular case is composed of, say, a 50-50 or a 70-30 mix of cannabis and non-cannabis plant material. For convenient reference, we term this the \"Different Proportions Argument\". Prof Amirthalingam pointed out that the Prosecution had admitted that it is possible for a particular lot of cannabis mixture to contain any combination of cannabis and non-cannabis matter whose proportions are unknown. Prof Amirthalingam averred that in imposing the same sentence on offenders who traffic in, import or export cannabis mixtures of the same gross weight but with different proportions of cannabis, the gross weight of cannabis mixture would not be a reliable differentia for calibrating sentencing ranges, and would undermine the sentencing approach based on the harm to society as well as render the sentences for offences involving cannabis mixture arbitrary, contrary to Art 12(1) of the Constitution.\n161 In response, the Prosecution submitted that Parliament had recognised that different cannabis mixtures could comprise different proportions of cannabis, as was evident from the Minister's observation in the 1993 Second Reading Speech ([70] supra) that the proportion of cannabis in cannabis mixture did not usually fall below 50%, which observation accepted the possibility that it could sometimes do so. Here, we reproduce the relevant portion of the 1993 Second Reading Speech (at col 928):\n... As the amount of cannabis in such a mixture does not usually fall below 50%, it is proposed that for the purpose of capital offences, trafficking in a cannabis mixture should be in amounts of more than 1,000 grammes (as compared to more than 500 grammes in the case of cannabis alone). This will give an allowance of 500 grammes for any non-cannabis material in the mixture. ... [emphasis added]\nIn short, Parliament's solution to the difficulty in accounting for the non-cannabis material in cannabis mixture was to \"give an allowance\" by doubling the threshold weights applicable to cannabis mixture from the threshold weights applicable to cannabis.\n(B) OUR DECISION\n\n162 We begin by reiterating the purpose and object of the MDA, which is to prevent and deter the distribution and consumption of illicit drugs. The social evil caused by the trafficking, importation and exportation of addictive drugs which the MDA seeks to prevent is broadly proportional to the quantity of drugs brought onto the illicit market (see Ong Ah Chuan v PP ([153] supra) at [38]). The specific purpose of including cannabis mixture as a drug under the MDA and criminalising dealings in it was to deter traffickers from trafficking in, importing or exporting large amounts of cannabis mixed with other vegetable matter.\n163 We first address Prof Amirthalingam's Different Proportions Argument and his concerns over the potential unequal treatment of offenders. In our judgment, it is largely a theoretical exercise to say that the two types of cannabis mixture mentioned at [160] above (meaning a cannabis mixture composed of a 50-50 mix of cannabis and non-cannabis plant material, and one composed of a 70-30 mix) are in fact situated differently. We say so for two reasons.\n164 First, based on the interpretation of the statutory definition of \"cannabis mixture\" that we have adopted, cannabis mixture is cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin, where the components cannot be easily distinguished or separated from each other. In other words, it is an inherent feature of cannabis mixture that the cannabis plant material therein cannot be easily distinguished or separated from the non-cannabis plant material. In reality, the cannabis and non-cannabis components in a compressed block of cannabis mixture cannot be separated, much less quantified. The concerns that Prof Amirthalingam identified can therefore be regarded as largely theoretical, especially having regard to our next point.\n165 Second, a sentencing framework based on the gross weight of cannabis mixture is in line with how cannabis products are in fact transacted in Singapore. Deputy Supt Qamarul of the CNB (see [43] above) testified that the pricing of cannabis products by traffickers is based on their gross weight, and the potency of cannabis products does not arise in the manner of pricing (see also the submissions of the Prosecution which we outlined at [157(c)] above). The prevailing market practice therefore supports the proposition that the gross weight of cannabis mixture is a reliable independent indicia of the harm done through the illicit importation, exportation and trafficking of cannabis mixture, in that the quantity of cannabis mixture imported, exported or trafficked, in terms of its gross weight, is proportionate to the harm done to society. Calibrating the sentencing regime according to the gross weight of cannabis mixture thus bears a rational relation to the purpose and object sought to be achieved by the MDA.\n166 Unless it is suggested that Parliament could not enact a law to deal with cannabis mixture because it consists of a non-differentiable mixture of cannabis and non-cannabis plant material, which no one has suggested or can suggest, there is in fact nothing objectionable about using the gross weight of cannabis mixture to calibrate the sentences for the offences of trafficking in, importing and exporting cannabis mixture.\n167 Further, the quantification of the amount of THC and CBN in cannabis mixture is, according to the HSA, neither precise nor accurate.\n168 Dr Yap testified that the HSA is currently unable to quantify accurately the amount of THC and CBN in a cannabis product, which includes cannabis mixture. Instead, the HSA has only developed a method for estimating the amount of THC in a cannabis product using gas chromatography-flame ionisation detection. Moreover, there are limitations which would impact the accuracy and precision of the results obtained from any such test:\n(a) First, the botanical nature of cannabis plant material is such that it is a heterogeneous mixture of different plant parts, each containing a different amount of THC. Sampling from such heterogeneous plant material gives rise to larger variability. The alternative to sampling would be to pulverise and homogenise the entire block of plant material, but this is not practical because: (i) the plant material is hard and difficult to pulverise; (ii) it is sticky and difficult to homogenise; and (iii) such treatment will cause further degradation of any THC present in the plant material.\n(b) Second, the nature of THC is unstable. THC is converted from THCA produced naturally by the cannabis plant, and is in turn converted to CBN upon exposure to heat or light (see [55] above). There is a non-linear rate of degradation from THCA to THC, and from THC to CBN. This is unlike other controlled drugs that are relatively stable, such as methamphetamine and morphine. These features of the cannabis plant cause the measurement of the amount of THC present in cannabis mixture to be less accurate and less precise. This means that the value obtained would be lower than the true value, and repeated measurements would produce results that are not as consistently close to each other compared to the measurements for other controlled drugs.\n169 Dr Yap also testified that it is not possible to determine the precise proportion of cannabis material in a block of cannabis-related plant material due to the inability to examine each and every plant fragment therein. Where a second type of plant material (such as tobacco) is mixed with the cannabis fragments, it is practically impossible for the HSA to separate the cannabis fragments from the other plant material because of the small size of the cannabis fragments. The HSA is therefore unable to ascertain the proportion of cannabis material relative to the total weight of the block of plant material. Because cannabis mixture cannot be calibrated by THC or by the proportion of non-cannabis material to cannabis material, science thus dictates a different methodology.\n170 Given the practical realities and limitations of the scientific testing methods, one is left to rely on the gross weight of cannabis mixture as the proxy indicator for sentencing. As we have noted above, this is also reflective of the realities of the prevailing market practice in transactions concerning cannabis products. Prof Amirthalingam too has acknowledged that the quantity of THC and CBN in cannabis mixture cannot be accurately ascertained. There is no suggestion that there is any other alternative or better method of assessing the differences in the proportions of cannabis and non-cannabis material present in different cannabis mixtures.\n171 Finally, we emphasise that Prof Amirthalingam's concerns about the constitutionality of using the gross weight of cannabis mixture to calibrate sentencing were confined to cases where the gross weight of the cannabis mixture in question is below 660g (see above at [158] and [160]), and did not extend to cases where the gross weight of the cannabis mixture is 660g or more. Prof Amirthalingam's acceptance that it is constitutional for Parliament to mandate specific sentences (namely, (a) imprisonment for 20 to 30 years or for life coupled with 15 strokes of the cane, and (b) death) based on specific threshold gross weights of cannabis mixture (namely, (a) between 660g to 1,000g, and (b) above 1,000g) is, in our respectful view, fatal to this part of his argument. If it is valid to rely on the gross weight of cannabis mixture to impose specific sentences in cases involving cannabis mixtures weighing 660g or more despite the theoretical possibility of differences in the proportions of cannabis and non-cannabis material present in such cannabis mixtures, it must follow, as a matter of logic, that there can be no meaningful difference when considering cannabis mixtures weighing less than 660g. It would further follow from this that, as a matter of principle, there is a rational relation between the differentia of the gross weight of cannabis mixture and the purpose and object of the MDA.\n172 We are therefore satisfied that the calibration of the sentencing ranges for the offences of trafficking in, importing and exporting cannabis mixture according to the gross weight of cannabis mixture does not breach Art 12(1) of the Constitution.\nIssue 3: Whether the Importation of Cannabis Mixture Charge can be established\n\n173 We turn to the last major issue, which is ultimately directed at whether the Importation of Cannabis Mixture Charge against the Appellant can be established.\nThe HSA's process for certifying cannabis and cannabis mixture\n\n174 As we have explained above at [56]-[64], the HSA has a comprehensive testing mechanism for the certification of cannabis and cannabis mixture. To recap, the testing procedure results in three groups of material emanating from a single compressed block of cannabis-related plant material: (a) material that can be identified and certified as cannabis; (b) fragmented vegetable matter that cannot be certified as cannabis, but with THC and CBN detected therein; and (c) observable extraneous matter that is discarded and disregarded (see [64] above). According to Dr Yap, the HSA in effect creates some part of the fragmented vegetable matter in the second group of plant material through its testing procedure when the HSA analyst inevitably, although often intentionally, breaks some of the cannabis plant parts. As a result, the contents of the block at the time it is analysed and handled by the HSA during and after testing will be different from the contents of the block at the time of trafficking, importation or exportation. This can be illustrated by the following diagram:\nThe shaded portion in the \"After\" diagram represents vegetable fragments that were created as a result of the HSA's testing procedure (\"Created Fragmented Vegetable Matter\"). A consequence of generating such Created Fragmented Vegetable Matter is that it gives rise to difficulties in bringing a charge pertaining to cannabis mixture in respect of such matter because it did not exist as cannabis mixture at the time of trafficking, importation or exportation.\nThe Prosecution's current charging practice\n\n175 Currently, for each compressed block of cannabis-related plant material, the Prosecution's general charging practice is the Dual Charging Practice outlined at [1] above; that is to say, the Prosecution will bring the following charges against the accused person:\n(a) a charge of trafficking in, importing or exporting cannabis in relation to the plant matter that fulfils the three-stage test for cannabis; and\n(b) a charge of trafficking in, importing or exporting cannabis mixture in relation to the remaining fragmented vegetable material containing THC and CBN.\nObservable extraneous matter in the block such as distinct non-cannabis vegetable matter, plastic pieces, foils and strings are excluded and disregarded.\n176 This is the practice that was adopted in the present case. Each of the ten bundles that the Appellant brought into Singapore was analysed by the HSA analyst. From each bundle, the vegetable matter that satisfied the classification test for cannabis was collectively made the subject of the Importation of Cannabis Charge. The remaining fragmented vegetable matter that was analysed and found to contain THC and CBN was collectively made the subject of the Importation of Cannabis Mixture Charge.\n177 In order to determine whether the Importation of Cannabis Mixture Charge can be established, two sub-issues arise for our determination:\n(a) The first is whether the fragmented vegetable matter in a compressed block of cannabis-related plant material can be said to fall within the definition of \"cannabis mixture\" in s 2 of the MDA (\"the Classification Issue\").\n(b) The second pertains to the Prosecution's Dual Charging Practice (\"the Charging Issue\"). In respect of a single compressed block of cannabis-related plant material that is found to contain (i) cannabis as well as (ii) fragmented vegetable matter containing CBN and THC (which cannot be certified as cannabis by the HSA), can two separate charges of trafficking in, importing or exporting cannabis and trafficking in, importing or exporting cannabis mixture be brought by the Prosecution? If not, what charging options would the Prosecution be left with?\nThe Classification Issue\n\n178 For the reasons set out at [105]-[109] above, we are satisfied that there is nothing objectionable with treating the fragmented vegetable matter in a block of cannabis-related plant material as cannabis mixture because cannabis mixture as we have defined it includes vegetable matter that is ultimately of indeterminate origin.\nThe Charging Issue\n\n179 But this is not the end of the matter, and it leads us to the Charging Issue. There are three possible approaches that the Prosecution may take in framing charges when dealing with a single compressed block of cannabis-related plant material:\n(a) prefer two distinct charges in relation to cannabis and cannabis mixture from the block, as it presently does under the Dual Charging Practice;\n(b) prefer one charge pertaining to cannabis in respect of the portion that can be certified as cannabis and disregard the remaining portion that is presently the subject of a further charge relating to cannabis mixture (\"the 2nd Approach\"); or\n(c) prefer one charge pertaining to cannabis mixture only in respect of the entire block (\"the 3rd Approach\").\n180 This raises the anterior question of whether the Prosecution is even permitted to prefer two separate charges in relation to cannabis and cannabis mixture arising from the same block of cannabis-related plant material, as is currently the case under the Dual Charging Practice.\n(1) The submissions of the Prosecution and Prof Amirthalingam\n\n181 The Prosecution submitted that it is legally entitled to adopt the Dual Charging Practice in relation to the cannabis and the cannabis mixture found in a single compressed block of cannabis-related plant material. In support of this position, the Prosecution put forward the following arguments:\n(a) To confine the Prosecution to either the 2nd or the 3rd Approach such that it must choose between preferring either a charge for the cannabis portion of the block only, with the remaining portion of the block disregarded, or a cannabis mixture charge for the entire block would fail to capture the totality of the offender's culpability. Those who deal in cannabis products transact and price them according to the gross weight of the product in question. Since the quantity of drugs trafficked, imported or exported bears a direct correlation with the degree of harm posed to society, the manner in which trafficking, importation and exportation charges are framed should, first and foremost, encompass the entire quantity of drugs involved.\n(b) The Dual Charging Practice (which is the Prosecution's current charging practice) coheres with the evidence: each compressed block of cannabis-related plant material will generally produce two main portions - a portion of cannabis and a portion of cannabis mixture.\n(c) The 2nd Approach results in the accused person not being punished for the portion that the Prosecution currently charges as cannabis mixture.\n(d) Charging the accused person only with trafficking in, importing or exporting cannabis mixture in respect of the entire compressed block (which is the 3rd Approach) would accord him an unwarranted discount in the penalty that he faces. It also overlooks the fact that at least a portion of the block meets the criteria for cannabis, a drug attracting more serious penalties than cannabis mixture.\n182 As against this, Prof Amirthalingam pointed out that the Prosecution's submissions might explain its preferences, but they fail to address whether its Dual Charging Practice is legally defensible. He submitted that this charging practice is not legally defensible for the following reasons:\n(a) In cases involving cannabis-related plant material which contains both cannabis and cannabis mixture, there would generally be no evidence that the accused person intended to traffic in, import or export two different types of drugs or even knew of their separate existence. The evidence in these cases is generally to the effect that the accused person intended to traffic in, import or export cannabis only, or knew only that he was trafficking in, importing or exporting cannabis. The Prosecution cannot then assert that the accused person had knowledge of the cannabis mixture, or the intention to traffic in, import or export it.\n(b) At least some of the fragmented vegetable matter would have been generated by the HSA in the course of handling the block of cannabis-related plant material as the HSA analyst prised it apart (such fragmented vegetable matter being the Created Fragmented Vegetable Matter defined at [174] above). At the point of trafficking, importation or exportation, those vegetable fragments were not in existence as such, and the accused person would not in fact have carried out the act of trafficking in, importing or exporting those fragments. Nor, for that matter, could the accused person have had the requisite intent to traffic in, import or export those fragments on the basis of their being cannabis mixture.\n(c) Further, it would be impossible to ascertain accurately the quantity of cannabis mixture at the time of the offence. As we have noted above, an indeterminate proportion of what is said to constitute cannabis mixture in a block of cannabis-related plant material only comes into existence as a result of the HSA's handling of the block in the course of testing, and any estimate of the quantity of cannabis mixture in the block would be imprecise and arbitrary, and therefore impermissible in the context of a sentencing framework based largely on the gross weight of cannabis mixture.\n(2) Our decision\n\n183 In our judgment, Prof Amirthalingam is correct to a significant extent on this. The Created Fragmented Vegetable Matter is generated or created by the HSA's testing procedure and only comes into existence by the physical forces exerted on a block of cannabis-related plant material when the HSA analyst prises it apart for analysis. Prior to the testing process, the Created Fragmented Vegetable Matter did not exist in that form. Instead, it existed in some other form at the time of the offence (see above at [174]).\n184 At the time of the offence, the accused person could not have committed the act of trafficking in, importing or exporting cannabis mixture in relation to the Created Fragmented Vegetable Matter as this only came into existence as such after the HSA had handled the block of cannabis-related plant material. This analysis does not change even if it were said that the Created Fragmented Vegetable Matter would otherwise have been cannabis. While that might well be true, the accused person is not, and evidently cannot be, charged on the basis that the Created Fragmented Vegetable Matter is cannabis because, upon testing, it will not meet the relevant criteria for certification as cannabis.\n185 For the offence of trafficking in a controlled drug under s 5(1)(a) of the MDA to be made out, the Prosecution must prove the act of trafficking in a controlled drug without any authorisation, and knowledge of the nature of the controlled drug (see Raman Selvam s/o Renganathan v Public Prosecutor [2004] 1 SLR(R) 550 at [35] and Public Prosecutor v Abdul Haleem bin Abdul Karim and another [2013] 3 SLR 734 at [28]). Similarly, in order to make out a charge of importation or exportation of a controlled drug under s 7 of the MDA, the element of importation or exportation (as the case may be) and the element of knowledge of the nature of the controlled drug must be proved (see Tan Kiam Peng v Public Prosecutor [2008] 1 SLR(R) 1 at [54] and [57]; Adili ([27] supra) at [27]). The type of knowledge that must be established for both a trafficking offence and an importation or exportation offence is knowledge of the specific nature of the drug (cannabis or cannabis mixture in this context), and not just knowledge that the drug is a controlled drug (see Public Prosecutor v Chijioke Stephen Obioha [2008] SGHC 243 at [171]).\n186 In the present case, the element of importation was not disputed (see [8] above). Thus, in order to make out the Importation of Cannabis Mixture Charge, what the Prosecution had to prove was knowledge, either actual or presumed, on the Appellant's part that the Created Fragmented Vegetable Matter was cannabis mixture. Given that the Created Fragmented Vegetable Matter did not exist in that form at the time the Appellant brought the ten bundles into Singapore on 6 November 2014, and given that there is no basis for saying that the fragmentation, which occurred as a consequence of the HSA's testing procedure, was intended by the Appellant, we do not see how it can be held that at the time of the offence, the Appellant knew the nature of the Created Fragmented Vegetable Matter or knew that it was cannabis mixture.\n187 This is significantly compounded by the problem of the indeterminacy of the quantity of the Created Fragmented Vegetable Matter. It is impossible to ascertain accurately the quantity of vegetable fragments that were created as a result of the HSA's testing procedure and the quantity of vegetable fragments that were already present in the ten bundles when the Appellant brought them into Singapore. Any estimate of the quantities of cannabis and cannabis mixture at the time of the offence extrapolated from their respective quantities after the HSA's testing would inevitably be arbitrary.\n188 For both these reasons, we are satisfied that the Importation of Cannabis Mixture Charge cannot be established.\n189 In respect of these arguments, the Prosecution accepted that the separation process effected by the HSA is likely to create more vegetable fragments and therefore increase the quantity of Created Fragmented Vegetable Matter. The Prosecution contended, however, that every compressed block of cannabis-related plant material is likely to already contain vegetable fragments even before the HSA handles the block because the process of compressing the dried plant material to form a dense and compact block is likely to have caused some of that material to fragment. The Prosecution argued that it is therefore not the case that a charge relating to cannabis mixture could not have been brought but for the HSA's actions during the testing process. The Prosecution also contended that the fact that the HSA's testing process leads to an increase in the cannabis mixture portion of a block of cannabis-related plant material does not prejudice the accused person because such an increase is accompanied by a corresponding decrease in the cannabis portion, which would likely result in the charges eventually brought against the accused person attracting a lower sentence.\n190 The Prosecution further submitted that the offender assumes the risk of the nature of the drug that he traffics in, imports or exports. If the drug breaks up on examination, that is a risk the offender assumes. The Prosecution suggested that offenders ought to bear the risks and consequences of having some part of the cannabis portion of a block of cannabis-related plant material fragment into cannabis mixture, whether in the course of compression, transportation, unpacking or analysis.\n191 In our judgment, these submissions by the Prosecution do not address the two points we have highlighted at [186]-[187] above. Charges cannot be brought on the basis of approximations. In order to establish a drug importation charge, it is incumbent on the Prosecution to prove that the accused person knew the nature of the drugs in question, and to establish accurately the relevant drug involved at the time of the offence. These are difficulties that the Prosecution cannot surmount where the drugs in question consist of cannabis-related plant material containing both cannabis and cannabis mixture, and they affect the Dual Charging Practice generally, and in this case specifically, the Importation of Cannabis Mixture Charge.\n(3) The Prosecution's alternative charging options\n\n192 In the light of our finding that the Dual Charging Practice is not defensible and is hence impermissible, we turn to analyse the Prosecution's two alternative charging options in respect of a single compressed block of cannabis-related plant material that is found to contain (i) cannabis as well as (ii) fragmented vegetable matter containing CBN and THC (which cannot be certified as cannabis by the HSA).\n193 The first option, which is the 2nd Approach outlined at [179(b)] above, is to charge the accused person solely in respect of the pure cannabis portion of the block that has been certified by the HSA as cannabis, by separating the pure cannabis portion and discarding the rest. There is plainly nothing objectionable with this, at least from the perspective of the accused person.\n194 The second option, which is the 3rd Approach outlined at [179(c)] above, is to determine that the composition of the block as a whole is a mixture of cannabis and other plant material of indeterminate or unknown origin and, on that basis, proceed with a single charge treating the entire block (less anything that can be easily separated into Group 3: see [58] above) as cannabis mixture.\n195 This too would be unobjectionable. The entire block would fall within the meaning of \"cannabis mixture\" that we have adopted in this judgment - namely, cannabis plant matter commingled with vegetable matter of indeterminate origin or known to be of non-cannabis origin, where the components cannot be easily distinguished or separated from each other.\n196 As we have mentioned above at [107], this charging option would not prejudice the offender as the penalties for offences involving cannabis mixture are less severe than those for offences involving pure cannabis of the same weight. The effect of this charging option is to treat as cannabis mixture even plant material which the HSA analyst subjectively believes to consist of cannabis, but which does not satisfy the relevant criteria for certification as cannabis. In our view, this is simply a consequence of the difference between what may be thought to be the reality of the situation and what can be proved in court. For the avoidance of doubt, in either situation, the Prosecution would of course have to establish all the elements of the offence, such as those set out at [185] above.\n197 For these reasons, we allow the Appellant's appeal against his conviction on the Importation of Cannabis Mixture Charge and set that aside. We also find that the Prosecution's Dual Charging Practice is indefensible and, hence, impermissible.\nConclusion\n\n198 In summary, we hold as follows in relation to the Importation of Cannabis Mixture Charge:\n(a) \"Cannabis mixture\" as defined in s 2 of the MDA means cannabis plant matter commingled with vegetable matter of non-cannabis origin or known to be of indeterminate origin, where the components cannot be easily distinguished or separated from each other.\n(b) The sentencing ranges for the offences of trafficking in, importing and exporting cannabis mixture should be calibrated according to the gross weight of cannabis mixture, and this sentencing framework does not breach Art 12(1) of the Constitution.\n(c) The Prosecution's Dual Charging Practice is impermissible.\n199 For the foregoing reasons, the Importation of Cannabis Mixture Charge cannot stand, and we set aside the Appellant's conviction on this charge. This does not, however, affect his conviction on the Importation of Cannabis Charge for the reasons explained above. We also see no basis for disturbing the sentence meted out by the Judge for that charge. Accordingly, the sentence which the Appellant now has to serve is the sentence for the Importation of Cannabis Charge, namely, life imprisonment and 15 strokes of the cane.\n200 In closing, we reiterate our deepest appreciation to Prof Amirthalingam and Dr Yap for the most valuable assistance they gave us in the course of these proceedings.\nSundaresh Menon Andrew Phang Boon Leong Steven Chong\nChief Justice Judge of Appeal Judge of Appeal\nThe appellant in person;\nKristy Tan, Anandan Bala, Wong Woon Kwong, Lu Zhuoren John, Nicholas Wuan Kin Lek and Shen Wanqin (Attorney-General's Chambers) for the respondent;\nProfessor Kumaralingam Amirthalingam (Faculty of Law, National University of Singapore) as amicus curiae.\n", "label": [[9, 53, "COURT"], [108, 127, "PETITIONER"], [256, 275, "RESPONDENT"], [368, 387, "RESPONDENT"], [656, 675, "PETITIONER"], [814, 829, "JUDGE"], [834, 857, "JUDGE"], [865, 877, "JUDGE"], [940, 955, "JUDGE"], [1082, 1101, "PETITIONER"], [1224, 1227, "PROVISION"], [1235, 1277, "STATUTE"], [1485, 1494, "GPE"], [1500, 1508, "GPE"], [1818, 1891, "PRECEDENT"], [2332, 2335, "ORG"], [2614, 2617, "ORG"], [2838, 2841, "ORG"], [3145, 3148, "COURT"], [3436, 3439, "ORG"], [3588, 3597, "GPE"], [3752, 3760, "GPE"], [3814, 3909, "COURT"], [4000, 4024, "DATE"], [4072, 4081, "GPE"], [4099, 4108, "GPE"], [4172, 4175, "STATUTE"], [4203, 4212, "GPE"], [4462, 4471, "PROVISION"], [4480, 4483, "STATUTE"], [4506, 4519, "PROVISION"], [4612, 4626, "PROVISION"], [4635, 4638, "STATUTE"], [4690, 4714, "DATE"], [4762, 4771, "GPE"], [4789, 4798, "GPE"], [4863, 4866, "STATUTE"], [4894, 4903, "GPE"], [5176, 5185, "PROVISION"], [5193, 5194, "STATUTE"], [5194, 5197, "STATUTE"], [5220, 5233, "PROVISION"], [5326, 5340, "PROVISION"], [5349, 5352, "STATUTE"], [5442, 5457, "DATE"], [5523, 5531, "GPE"], [5537, 5546, "GPE"], [5892, 5895, "ORG"], [6300, 6308, "PROVISION"], [6316, 6339, "STATUTE"], [6368, 6371, "STATUTE"], [6482, 6485, "OTHER_PERSON"], [6512, 6515, "OTHER_PERSON"], [6547, 6555, "GPE"], [6604, 6613, "GPE"], [6627, 6630, "OTHER_PERSON"], [6715, 6718, "OTHER_PERSON"], [6770, 6779, "GPE"], [6869, 6872, "OTHER_PERSON"], [6937, 6948, "GPE"], [7046, 7049, "OTHER_PERSON"], [7105, 7108, "OTHER_PERSON"], [7295, 7298, "OTHER_PERSON"], [7424, 7427, "OTHER_PERSON"], [7691, 7694, "OTHER_PERSON"], [7728, 7731, "OTHER_PERSON"], [7778, 7781, "OTHER_PERSON"], [7829, 7838, "GPE"], [7893, 7902, "GPE"], [7919, 7928, "GPE"], [7992, 7995, "OTHER_PERSON"], [8067, 8076, "GPE"], [8157, 8161, "PROVISION"], [8169, 8172, "STATUTE"], [8207, 8211, "PROVISION"], [8219, 8222, "STATUTE"], [8226, 8241, "DATE"], [8493, 8502, "GPE"], [8615, 8624, "GPE"], [8818, 8827, "GPE"], [8887, 8890, "OTHER_PERSON"], [8937, 8940, "OTHER_PERSON"], [9134, 9137, "OTHER_PERSON"], [9195, 9204, "GPE"], [9260, 9263, "OTHER_PERSON"], [9310, 9319, "GPE"], [9381, 9390, "GPE"], [9452, 9455, "OTHER_PERSON"], [9457, 9460, "OTHER_PERSON"], [9603, 9606, "OTHER_PERSON"], [9653, 9662, "GPE"], [9809, 9812, "OTHER_PERSON"], [9883, 9892, "GPE"], [10789, 10797, "PROVISION"], [10828, 10831, "STATUTE"], [10986, 10993, "PROVISION"], [11240, 11247, "PROVISION"], [11255, 11258, "STATUTE"], [11435, 11444, "GPE"], [12320, 12323, "OTHER_PERSON"], [12478, 12481, "OTHER_PERSON"], [12501, 12504, "OTHER_PERSON"], [12650, 12653, "OTHER_PERSON"], [12877, 12886, "GPE"], [13481, 13490, "GPE"], [14056, 14080, "ORG"], [14530, 14538, "PROVISION"], [14546, 14549, "STATUTE"], [14768, 14775, "PROVISION"], [14783, 14786, "STATUTE"], [14999, 15002, "OTHER_PERSON"], [15132, 15135, "OTHER_PERSON"], [15926, 15937, "PROVISION"], [15945, 15948, "STATUTE"], [16135, 16143, "PROVISION"], [16151, 16154, "STATUTE"], [16160, 16230, "PRECEDENT"], [16331, 16334, "PROVISION"], [16342, 16345, "STATUTE"], [16428, 16437, "GPE"], [16503, 16567, "PRECEDENT"], [16872, 16875, "ORG"], [16938, 16941, "ORG"], [17173, 17180, "PROVISION"], [17188, 17191, "STATUTE"], [17370, 17377, "PROVISION"], [17804, 17807, "ORG"], [18359, 18362, "OTHER_PERSON"], [18398, 18401, "OTHER_PERSON"], [18453, 18456, "OTHER_PERSON"], [18541, 18544, "OTHER_PERSON"], [18666, 18669, "OTHER_PERSON"], [18716, 18725, "GPE"], [19101, 19104, "OTHER_PERSON"], [19428, 19437, "GPE"], [20834, 20843, "GPE"], [20957, 20964, "PROVISION"], [20972, 20975, "STATUTE"], [21190, 21201, "PROVISION"], [21209, 21212, "STATUTE"], [21532, 21535, "OTHER_PERSON"], [21588, 21651, "PRECEDENT"], [21922, 21925, "OTHER_PERSON"], [22024, 22027, "OTHER_PERSON"], [22107, 22110, "OTHER_PERSON"], [22180, 22189, "GPE"], [22546, 22549, "OTHER_PERSON"], [22655, 22658, "OTHER_PERSON"], [22703, 22706, "OTHER_PERSON"], [22842, 22845, "OTHER_PERSON"], [23107, 23110, "OTHER_PERSON"], [23637, 23644, "PROVISION"], [23652, 23655, "STATUTE"], [23758, 23771, "DATE"], [24108, 24117, "GPE"], [24475, 24482, "PROVISION"], [24490, 24493, "STATUTE"], [24982, 24991, "GPE"], [25200, 25207, "PROVISION"], [25376, 25442, "PRECEDENT"], [26710, 26719, "GPE"], [27200, 27207, "PROVISION"], [27215, 27218, "STATUTE"], [28021, 28028, "PROVISION"], [28232, 28241, "GPE"], [28731, 28738, "PROVISION"], [28746, 28749, "STATUTE"], [28920, 28927, "PROVISION"], [28935, 28938, "STATUTE"], [29041, 29048, "PROVISION"], [29157, 29166, "GPE"], [29174, 29181, "PROVISION"], [29366, 29416, "PRECEDENT"], [29498, 29505, "PROVISION"], [29909, 29916, "PROVISION"], [30178, 30185, "PROVISION"], [30874, 30879, "OTHER_PERSON"], [31274, 31277, "OTHER_PERSON"], [31316, 31319, "OTHER_PERSON"], [31388, 31391, "OTHER_PERSON"], [31508, 31517, "GPE"], [31532, 31535, "OTHER_PERSON"], [31634, 31637, "OTHER_PERSON"], [32155, 32164, "GPE"], [32810, 32819, "GPE"], [32923, 32926, "OTHER_PERSON"], [33006, 33015, "GPE"], [33053, 33056, "OTHER_PERSON"], [33111, 33114, "OTHER_PERSON"], [33593, 33596, "OTHER_PERSON"], [33989, 33992, "OTHER_PERSON"], [34449, 34455, "OTHER_PERSON"], [34590, 34596, "OTHER_PERSON"], [34631, 34642, "GPE"], [34660, 34669, "GPE"], [34774, 34779, "GPE"], [34880, 34889, "GPE"], [35100, 35106, "OTHER_PERSON"], [35384, 35390, "GPE"], [35478, 35487, "GPE"], [36039, 36045, "GPE"], [36237, 36246, "GPE"], [36297, 36303, "GPE"], [36363, 36366, "OTHER_PERSON"], [36390, 36393, "OTHER_PERSON"], [36467, 36470, "OTHER_PERSON"], [36524, 36527, "OTHER_PERSON"], [36605, 36608, "OTHER_PERSON"], [36628, 36631, "OTHER_PERSON"], [36680, 36683, "OTHER_PERSON"], [36789, 36798, "GPE"], [36875, 36878, "OTHER_PERSON"], [36936, 36939, "OTHER_PERSON"], [36991, 36994, "OTHER_PERSON"], [37091, 37094, "OTHER_PERSON"], [37154, 37157, "OTHER_PERSON"], [37347, 37350, "OTHER_PERSON"], [37447, 37450, "OTHER_PERSON"], [37551, 37554, "OTHER_PERSON"], [37710, 37713, "PETITIONER"], [37779, 37788, "GPE"], [38226, 38229, "OTHER_PERSON"], [38233, 38248, "DATE"], [38698, 38701, "OTHER_PERSON"], [39631, 39708, "PRECEDENT"], [40106, 40113, "PROVISION"], [40121, 40124, "STATUTE"], [40289, 40296, "PROVISION"], [40441, 40454, "DATE"], [40662, 40665, "ORG"], [40839, 40842, "PROVISION"], [40850, 40853, "STATUTE"], [41142, 41155, "DATE"], [41186, 41212, "OTHER_PERSON"], [41220, 41233, "OTHER_PERSON"], [41306, 41309, "STATUTE"], [41469, 41472, "STATUTE"], [41724, 41727, "ORG"], [41857, 41860, "ORG"], [42173, 42176, "ORG"], [42451, 42466, "PROVISION"], [42474, 42477, "STATUTE"], [42990, 42993, "STATUTE"], [43203, 43206, "STATUTE"], [43308, 43311, "STATUTE"], [43392, 43401, "PROVISION"], [43409, 43450, "STATUTE"], [43578, 43590, "DATE"], [43597, 43611, "OTHER_PERSON"], [43627, 43630, "OTHER_PERSON"], [43670, 43716, "ORG"], [43751, 43803, "ORG"], [43832, 43845, "CASE_NUMBER"], [43875, 43887, "DATE"], [43913, 43937, "OTHER_PERSON"], [43969, 43972, "ORG"], [44042, 44051, "GPE"], [44148, 44158, "DATE"], [44221, 44224, "ORG"], [44441, 44444, "ORG"], [44576, 44579, "ORG"], [44705, 44708, "OTHER_PERSON"], [44751, 44761, "DATE"], [45283, 45293, "DATE"], [45832, 45835, "ORG"], [45869, 45882, "OTHER_PERSON"], [45973, 45976, "OTHER_PERSON"], [46156, 46169, "OTHER_PERSON"], [46300, 46303, "OTHER_PERSON"], [46401, 46404, "ORG"], [47095, 47098, "PROVISION"], [47106, 47109, "STATUTE"], [47244, 47317, "PRECEDENT"], [47320, 47331, "OTHER_PERSON"], [47341, 47350, "OTHER_PERSON"], [47506, 47517, "OTHER_PERSON"], [47649, 47658, "GPE"], [47696, 47707, "OTHER_PERSON"], [48105, 48116, "OTHER_PERSON"], [48364, 48375, "OTHER_PERSON"], [48518, 48527, "OTHER_PERSON"], [48635, 48638, "PROVISION"], [48646, 48649, "STATUTE"], [48742, 48792, "PRECEDENT"], [49957, 49960, "STATUTE"], [50220, 50226, "PROVISION"], [50234, 50246, "STATUTE"], [50623, 50626, "ORG"], [50745, 50748, "ORG"], [50823, 50826, "ORG"], [50905, 50908, "ORG"], [51193, 51196, "ORG"], [51652, 51655, "ORG"], [52176, 52179, "ORG"], [52608, 52611, "ORG"], [53166, 53169, "PROVISION"], [53177, 53180, "STATUTE"], [53428, 53431, "OTHER_PERSON"], [54218, 54221, "ORG"], [54367, 54370, "ORG"], [54475, 54484, "OTHER_PERSON"], [54502, 54505, "ORG"], [54616, 54619, "OTHER_PERSON"], [54829, 54832, "ORG"], [54962, 54965, "ORG"], [56259, 56262, "ORG"], [56648, 56651, "ORG"], [57619, 57622, "ORG"], [58719, 58722, "OTHER_PERSON"], [58818, 58858, "ORG"], [59092, 59095, "ORG"], [59512, 59515, "ORG"], [59790, 59793, "ORG"], [61399, 61402, "ORG"], [61904, 61913, "GPE"], [61921, 61924, "WITNESS"], [62031, 62034, "ORG"], [62630, 62633, "ORG"], [63019, 63022, "ORG"], [63118, 63121, "OTHER_PERSON"], [63170, 63173, "ORG"], [63677, 63680, "OTHER_PERSON"], [63989, 63992, "COURT"], [64243, 64246, "ORG"], [64488, 64491, "STATUTE"], [64566, 64569, "STATUTE"], [64660, 64663, "STATUTE"], [65071, 65082, "OTHER_PERSON"], [65253, 65277, "ORG"], [66019, 66030, "PROVISION"], [66694, 66697, "ORG"], [66945, 66948, "ORG"], [67524, 67535, "OTHER_PERSON"], [67562, 67571, "OTHER_PERSON"], [67605, 67616, "OTHER_PERSON"], [67624, 67635, "OTHER_PERSON"], [67927, 67937, "ORG"], [68166, 68176, "ORG"], [68352, 68364, "LAWYER"], [68859, 68892, "ORG"], [68914, 68917, "ORG"], [68951, 68954, "ORG"], [69132, 69135, "ORG"], [70176, 70185, "GPE"], [70227, 70236, "GPE"], [70276, 70287, "OTHER_PERSON"], [70344, 70347, "PROVISION"], [70355, 70358, "STATUTE"], [70715, 70726, "OTHER_PERSON"], [71326, 71329, "PROVISION"], [71337, 71340, "STATUTE"], [72256, 72259, "PROVISION"], [72267, 72270, "STATUTE"], [72597, 72601, "PROVISION"], [72609, 72612, "STATUTE"], [72790, 72795, "PROVISION"], [74063, 74066, "PROVISION"], [74074, 74077, "STATUTE"], [74312, 74315, "ORG"], [74487, 74490, "ORG"], [74616, 74619, "OTHER_PERSON"], [74712, 74715, "ORG"], [75500, 75503, "ORG"], [75558, 75567, "OTHER_PERSON"], [75662, 75665, "PROVISION"], [75673, 75676, "STATUTE"], [75750, 75753, "STATUTE"], [75892, 75895, "PROVISION"], [76601, 76604, "STATUTE"], [76750, 76759, "PROVISION"], [76767, 76770, "STATUTE"], [76933, 76936, "STATUTE"], [77095, 77105, "ORG"], [77107, 77117, "ORG"], [77169, 77172, "STATUTE"], [77700, 77711, "OTHER_PERSON"], [77766, 77775, "OTHER_PERSON"], [77950, 77959, "OTHER_PERSON"], [78118, 78131, "OTHER_PERSON"], [78374, 78387, "OTHER_PERSON"], [78411, 78424, "OTHER_PERSON"], [78492, 78503, "OTHER_PERSON"], [78616, 78625, "OTHER_PERSON"], [78709, 78718, "OTHER_PERSON"], [78855, 78866, "OTHER_PERSON"], [79121, 79134, "OTHER_PERSON"], [79234, 79244, "ORG"], [79373, 79434, "PRECEDENT"], [79467, 79478, "OTHER_PERSON"], [79964, 79974, "ORG"], [80178, 80181, "PROVISION"], [80189, 80192, "STATUTE"], [80353, 80364, "OTHER_PERSON"], [80546, 80549, "STATUTE"], [80670, 80679, "GPE"], [80932, 80942, "ORG"], [81032, 81041, "GPE"], [81119, 81122, "PROVISION"], [81130, 81133, "STATUTE"], [81413, 81422, "OTHER_PERSON"], [82170, 82180, "ORG"], [82305, 82318, "OTHER_PERSON"], [82375, 82384, "OTHER_PERSON"], [82723, 82732, "GPE"], [82800, 82803, "STATUTE"], [82856, 82866, "ORG"], [82955, 82958, "PROVISION"], [82966, 82969, "STATUTE"], [83031, 83040, "GPE"], [83094, 83103, "OTHER_PERSON"], [83159, 83169, "ORG"], [83286, 83289, "PROVISION"], [83297, 83300, "STATUTE"], [83567, 83581, "OTHER_PERSON"], [84563, 84641, "PRECEDENT"], [85341, 85355, "OTHER_PERSON"], [85372, 85432, "PRECEDENT"], [85636, 85738, "PRECEDENT"], [85744, 85793, "PRECEDENT"], [85990, 86002, "OTHER_PERSON"], [86040, 86140, "PRECEDENT"], [86241, 86244, "PROVISION"], [86252, 86255, "STATUTE"], [86627, 86641, "OTHER_PERSON"], [87775, 87785, "ORG"], [87851, 87861, "ORG"], [87891, 87905, "OTHER_PERSON"], [88158, 88161, "PROVISION"], [88169, 88172, "STATUTE"], [88244, 88255, "OTHER_PERSON"], [88692, 88695, "PROVISION"], [88703, 88706, "STATUTE"], [88895, 88898, "STATUTE"], [89205, 89219, "OTHER_PERSON"], [89340, 89343, "PROVISION"], [89351, 89354, "STATUTE"], [89404, 89407, "STATUTE"], [89725, 89735, "ORG"], [89802, 89805, "PROVISION"], [89813, 89816, "STATUTE"], [90001, 90015, "OTHER_PERSON"], [90319, 90329, "ORG"], [90627, 90630, "STATUTE"], [90854, 90857, "ORG"], [91923, 91936, "OTHER_PERSON"], [92056, 92067, "OTHER_PERSON"], [92763, 92766, "PROVISION"], [92774, 92777, "STATUTE"], [93053, 93062, "OTHER_PERSON"], [93541, 93544, "STATUTE"], [93779, 93789, "ORG"], [93942, 93951, "GPE"], [94362, 94365, "PROVISION"], [94373, 94376, "STATUTE"], [94548, 94551, "PROVISION"], [94559, 94562, "STATUTE"], [94587, 94590, "STATUTE"], [95142, 95145, "PROVISION"], [95153, 95156, "STATUTE"], [95187, 95196, "OTHER_PERSON"], [95251, 95260, "OTHER_PERSON"], [95281, 95291, "ORG"], [95555, 95564, "OTHER_PERSON"], [95769, 95772, "PROVISION"], [95780, 95783, "STATUTE"], [96164, 96173, "OTHER_PERSON"], [96361, 96372, "OTHER_PERSON"], [96537, 96546, "OTHER_PERSON"], [96856, 96859, "OTHER_PERSON"], [96880, 96883, "ORG"], [97148, 97151, "ORG"], [97198, 97201, "ORG"], [97627, 97630, "ORG"], [97754, 97794, "ORG"], [97822, 97825, "ORG"], [98571, 98574, "ORG"], [98706, 98709, "OTHER_PERSON"], [98740, 98743, "ORG"], [98828, 98831, "ORG"], [99738, 99741, "ORG"], [99975, 99985, "ORG"], [100190, 100203, "OTHER_PERSON"], [100235, 100244, "GPE"], [100398, 100408, "ORG"], [100518, 100531, "OTHER_PERSON"], [100663, 100673, "ORG"], [101214, 101224, "ORG"], [101289, 101302, "OTHER_PERSON"], [101331, 101342, "OTHER_PERSON"], [101494, 101504, "ORG"], [101674, 101687, "OTHER_PERSON"], [101721, 101732, "OTHER_PERSON"], [101854, 101867, "OTHER_PERSON"], [101970, 101979, "OTHER_PERSON"], [102035, 102045, "ORG"], [102065, 102074, "OTHER_PERSON"], [102101, 102111, "ORG"], [102302, 102311, "GPE"], [102621, 102630, "GPE"], [102866, 102869, "ORG"], [103258, 103271, "OTHER_PERSON"], [103487, 103514, "COURT"], [103518, 103610, "PRECEDENT"], [104220, 104249, "PROVISION"], [104257, 104275, "STATUTE"], [105095, 105104, "JUDGE"], [105415, 105442, "COURT"], [105446, 105500, "PRECEDENT"], [105611, 105614, "ORG"], [106505, 106518, "OTHER_PERSON"], [106871, 106874, "COURT"], [106961, 106969, "OTHER_PERSON"], [107440, 107477, "PRECEDENT"], [107564, 107567, "ORG"], [107598, 107601, "OTHER_PERSON"], [107909, 107912, "ORG"], [108411, 108425, "ORG"], [108773, 108776, "PROVISION"], [108784, 108787, "STATUTE"], [109287, 109290, "PROVISION"], [109675, 109678, "STATUTE"], [109830, 109833, "OTHER_PERSON"], [110129, 110139, "ORG"], [110203, 110206, "STATUTE"], [110646, 110649, "STATUTE"], [111263, 111273, "ORG"], [111700, 111703, "PROVISION"], [111711, 111714, "STATUTE"], [112612, 112615, "ORG"], [112867, 112873, "PROVISION"], [112881, 112893, "STATUTE"], [113109, 113112, "STATUTE"], [113157, 113160, "STATUTE"], [113305, 113382, "PRECEDENT"], [113411, 113414, "STATUTE"], [113631, 113634, "STATUTE"], [114093, 114096, "STATUTE"], [116169, 116172, "PROVISION"], [116180, 116183, "STATUTE"], [116562, 116575, "OTHER_PERSON"], [116667, 116670, "PROVISION"], [116678, 116681, "STATUTE"], [117107, 117120, "OTHER_PERSON"], [117263, 117266, "PROVISION"], [117274, 117277, "STATUTE"], [117395, 117408, "OTHER_PERSON"], [117749, 117762, "OTHER_PERSON"], [117951, 117969, "PROVISION"], [117977, 117980, "STATUTE"], [118408, 118411, "PROVISION"], [118419, 118422, "STATUTE"], [118637, 118640, "PROVISION"], [118648, 118651, "STATUTE"], [118852, 118855, "STATUTE"], [118953, 118960, "PROVISION"], [119664, 119693, "PROVISION"], [120359, 120377, "OTHER_PERSON"], [120442, 120455, "OTHER_PERSON"], [120871, 120884, "OTHER_PERSON"], [121015, 121044, "PROVISION"], [121077, 121104, "COURT"], [121108, 121134, "PRECEDENT"], [121288, 121301, "OTHER_PERSON"], [121510, 121513, "ORG"], [121588, 121601, "OTHER_PERSON"], [121668, 121671, "OTHER_PERSON"], [121676, 121679, "OTHER_PERSON"], [121779, 121782, "ORG"], [122152, 122165, "OTHER_PERSON"], [122441, 122444, "ORG"], [122827, 122840, "OTHER_PERSON"], [123108, 123111, "STATUTE"], [123380, 123390, "ORG"], [125279, 125289, "ORG"], [125829, 125832, "STATUTE"], [126235, 126238, "ORG"], [126795, 126798, "STATUTE"], [127025, 127028, "STATUTE"], [127626, 127705, "PRECEDENT"], [128449, 128457, "OTHER_PERSON"], [128593, 128601, "OTHER_PERSON"], [129024, 129037, "OTHER_PERSON"], [129100, 129113, "OTHER_PERSON"], [129205, 129218, "GPE"], [129651, 129661, "ORG"], [130052, 130062, "ORG"], [130281, 130291, "ORG"], [130822, 130825, "PROVISION"], [130833, 130836, "STATUTE"], [130911, 130924, "OTHER_PERSON"], [131063, 131066, "STATUTE"], [131532, 131541, "OTHER_PERSON"], [131829, 131838, "GPE"], [132230, 132243, "OTHER_PERSON"], [132526, 132529, "OTHER_PERSON"], [132553, 132556, "ORG"], [132684, 132697, "OTHER_PERSON"], [132735, 132744, "GPE"], [132753, 132767, "GPE"], [132776, 132785, "GPE"], [133106, 133153, "PRECEDENT"], [133158, 133222, "PRECEDENT"], [133236, 133250, "GPE"], [133768, 133819, "PRECEDENT"], [134326, 134335, "GPE"], [134344, 134358, "GPE"], [134552, 134555, "STATUTE"], [134763, 134772, "PROVISION"], [134780, 134783, "STATUTE"], [135660, 135663, "PROVISION"], [135671, 135674, "STATUTE"], [135676, 135686, "ORG"], [136403, 136412, "PROVISION"], [136420, 136432, "STATUTE"], [136561, 136570, "PROVISION"], [136578, 136590, "STATUTE"], [136870, 136883, "PROVISION"], [136891, 136903, "STATUTE"], [137753, 137839, "PRECEDENT"], [137934, 138033, "PRECEDENT"], [138036, 138044, "OTHER_PERSON"], [138161, 138170, "PROVISION"], [138673, 138683, "ORG"], [138879, 138893, "OTHER_PERSON"], [138908, 138985, "PRECEDENT"], [138990, 139048, "PRECEDENT"], [139059, 139073, "OTHER_PERSON"], [139180, 139189, "GPE"], [139231, 139244, "DATE"], [139700, 139710, "ORG"], [140379, 140382, "COURT"], [140986, 140989, "ORG"], [141052, 141065, "OTHER_PERSON"], [141400, 141403, "STATUTE"], [141445, 141448, "STATUTE"], [141520, 141523, "STATUTE"], [141636, 141692, "PRECEDENT"], [141931, 141939, "OTHER_PERSON"], [142075, 142078, "ORG"], [142365, 142374, "GPE"], [142655, 142664, "GPE"], [142752, 142761, "GPE"], [143770, 143783, "OTHER_PERSON"], [144223, 144236, "OTHER_PERSON"], [144781, 144791, "ORG"], [145284, 145292, "OTHER_PERSON"], [145464, 145477, "OTHER_PERSON"], [146185, 146198, "OTHER_PERSON"], [146405, 146418, "OTHER_PERSON"], [146871, 146880, "PROVISION"], [146888, 146900, "STATUTE"], [146950, 146960, "ORG"], [147809, 147819, "ORG"], [148132, 148135, "COURT"], [148318, 148321, "COURT"], [148425, 148464, "PRECEDENT"], [148538, 148541, "STATUTE"], [148731, 148744, "OTHER_PERSON"], [149839, 149852, "OTHER_PERSON"], [150103, 150112, "GPE"], [150141, 150144, "ORG"], [150979, 150982, "ORG"], [151016, 151026, "ORG"], [151514, 151517, "ORG"], [151556, 151559, "WITNESS"], [151579, 151582, "ORG"], [151721, 151724, "ORG"], [153332, 153335, "WITNESS"], [153680, 153683, "ORG"], [153806, 153809, "ORG"], [154442, 154455, "OTHER_PERSON"], [154802, 154815, "OTHER_PERSON"], [155150, 155163, "OTHER_PERSON"], [155207, 155217, "ORG"], [156170, 156173, "COURT"], [156395, 156404, "PROVISION"], [156412, 156424, "STATUTE"], [156672, 156675, "ORG"], [156781, 156784, "ORG"], [157301, 157304, "OTHER_PERSON"], [157310, 157313, "ORG"], [157454, 157457, "ORG"], [157634, 157637, "ORG"], [157928, 157931, "ORG"], [159167, 159176, "GPE"], [159197, 159200, "ORG"], [159870, 159873, "PROVISION"], [159881, 159884, "STATUTE"], [160233, 160236, "ORG"], [161931, 161944, "OTHER_PERSON"], [163835, 163848, "OTHER_PERSON"], [164829, 164832, "ORG"], [164911, 164914, "ORG"], [165765, 165768, "ORG"], [166087, 166100, "OTHER_PERSON"], [166216, 166219, "ORG"], [166356, 166359, "ORG"], [166833, 166836, "ORG"], [167343, 167352, "PROVISION"], [167360, 167363, "STATUTE"], [167534, 167610, "PRECEDENT"], [167615, 167700, "PRECEDENT"], [167801, 167804, "PROVISION"], [167812, 167815, "STATUTE"], [167966, 168062, "PRECEDENT"], [168344, 168412, "PRECEDENT"], [168872, 168881, "GPE"], [168885, 168900, "DATE"], [169009, 169012, "ORG"], [169489, 169492, "ORG"], [169635, 169644, "GPE"], [170058, 170061, "COURT"], [170347, 170350, "ORG"], [170663, 170666, "ORG"], [170759, 170762, "ORG"], [172818, 172821, "ORG"], [173023, 173026, "ORG"], [175143, 175146, "PROVISION"], [175154, 175157, "STATUTE"], [175585, 175594, "PROVISION"], [175602, 175614, "STATUTE"], [176268, 176281, "OTHER_PERSON"], [176289, 176292, "OTHER_PERSON"], [176375, 176427, "JUDGE"], [176499, 176509, "OTHER_PERSON"], [176511, 176523, "OTHER_PERSON"], [176525, 176540, "OTHER_PERSON"], [176542, 176557, "OTHER_PERSON"], [176559, 176580, "OTHER_PERSON"], [176585, 176596, "OTHER_PERSON"], [176657, 176683, "OTHER_PERSON"], [176701, 176733, "ORG"]]}
